export default [
    {
        "children": [
            {
                "children": [
                    {
                        "name": "丰乐种业",
                        "scale": 5593676468,
                        "id": "000713.SZ"
                    },
                    {
                        "name": "隆平高科",
                        "scale": 19633537444,
                        "id": "000998.SZ"
                    },
                    {
                        "name": "登海种业",
                        "scale": 1.80224E+10,
                        "id": "002041.SZ"
                    },
                    {
                        "name": "众兴菌业",
                        "scale": 2993142838,
                        "id": "002772.SZ"
                    },
                    {
                        "name": "荃银高科",
                        "scale": 9721856207,
                        "id": "300087.SZ"
                    },
                    {
                        "name": "神农科技",
                        "scale": 4410767846,
                        "id": "300189.SZ"
                    },
                    {
                        "name": "雪榕生物",
                        "scale": 2.29544467E+9,
                        "id": "300511.SZ"
                    },
                    {
                        "name": "华绿生物",
                        "scale": 1230732703,
                        "id": "300970.SZ"
                    },
                    {
                        "name": "万辰生物",
                        "scale": 9.4043712E+8,
                        "id": "300972.SZ"
                    },
                    {
                        "name": "亚盛集团",
                        "scale": 6522165655,
                        "id": "600108.SH"
                    },
                    {
                        "name": "农发种业",
                        "scale": 10611923884,
                        "id": "600313.SH"
                    },
                    {
                        "name": "敦煌种业",
                        "scale": 3319875083,
                        "id": "600354.SH"
                    },
                    {
                        "name": "新农开发",
                        "scale": 3120774868,
                        "id": "600359.SH"
                    },
                    {
                        "name": "万向德农",
                        "scale": 3.90006474E+9,
                        "id": "600371.SH"
                    },
                    {
                        "name": "香梨股份",
                        "scale": 1580463541,
                        "id": "600506.SH"
                    },
                    {
                        "name": "新赛股份",
                        "scale": 2872002182,
                        "id": "600540.SH"
                    },
                    {
                        "name": "北大荒",
                        "scale": 24727527534,
                        "id": "600598.SH"
                    },
                    {
                        "name": "海南橡胶",
                        "scale": 19086247975,
                        "id": "601118.SH"
                    },
                    {
                        "name": "苏垦农发",
                        "scale": 1.81896E+10,
                        "id": "601952.SH"
                    },
                    {
                        "name": "宏辉果蔬",
                        "scale": 2856108675,
                        "id": "603336.SH"
                    }
                ],
                "name": "种植业",
                "scale": 161628749433,
                "id": "110100"
            },
            {
                "children": [
                    {
                        "name": "中水渔业",
                        "scale": 3.36666045E+9,
                        "id": "000798.SZ"
                    },
                    {
                        "name": "ST獐子岛",
                        "scale": 3010235742,
                        "id": "002069.SZ"
                    },
                    {
                        "name": "ST东洋",
                        "scale": 1950003348,
                        "id": "002086.SZ"
                    },
                    {
                        "name": "百洋股份",
                        "scale": 2281098785,
                        "id": "002696.SZ"
                    },
                    {
                        "name": "国联水产",
                        "scale": 4.54307104E+9,
                        "id": "300094.SZ"
                    },
                    {
                        "name": "开创国际",
                        "scale": 2279259848,
                        "id": "600097.SH"
                    },
                    {
                        "name": "大湖股份",
                        "scale": 2507245749,
                        "id": "600257.SH"
                    },
                    {
                        "name": "好当家",
                        "scale": 3769365304,
                        "id": "600467.SH"
                    }
                ],
                "name": "渔业",
                "scale": 23706940266,
                "id": "110200"
            },
            {
                "children": [
                    {
                        "name": "平潭发展",
                        "scale": 5569556423,
                        "id": "000592.SZ"
                    },
                    {
                        "name": "福建金森",
                        "scale": 2.58860088E+9,
                        "id": "002679.SZ"
                    },
                    {
                        "name": "ST景谷",
                        "scale": 2.061224E+9,
                        "id": "600265.SH"
                    }
                ],
                "name": "林业",
                "scale": 10219381303,
                "id": "110300"
            },
            {
                "children": [
                    {
                        "name": "京基智农",
                        "scale": 9470630425,
                        "id": "000048.SZ"
                    },
                    {
                        "name": "正虹科技",
                        "scale": 1591808419,
                        "id": "000702.SZ"
                    },
                    {
                        "name": "新 希 望",
                        "scale": 67825743659,
                        "id": "000876.SZ"
                    },
                    {
                        "name": "天康生物",
                        "scale": 14314700512,
                        "id": "002100.SZ"
                    },
                    {
                        "name": "天邦食品",
                        "scale": 10517381491,
                        "id": "002124.SZ"
                    },
                    {
                        "name": "正邦科技",
                        "scale": 13937719506,
                        "id": "002157.SZ"
                    },
                    {
                        "name": "海大集团",
                        "scale": 97879208121,
                        "id": "002311.SZ"
                    },
                    {
                        "name": "大北农",
                        "scale": 23707289711,
                        "id": "002385.SZ"
                    },
                    {
                        "name": "金新农",
                        "scale": 3622245537,
                        "id": "002548.SZ"
                    },
                    {
                        "name": "唐人神",
                        "scale": 10270820641,
                        "id": "002567.SZ"
                    },
                    {
                        "name": "中宠股份",
                        "scale": 7823218217,
                        "id": "002891.SZ"
                    },
                    {
                        "name": "佩蒂股份",
                        "scale": 2760926163,
                        "id": "300673.SZ"
                    },
                    {
                        "name": "傲农生物",
                        "scale": 12827715533,
                        "id": "603363.SH"
                    },
                    {
                        "name": "禾丰股份",
                        "scale": 9153019778,
                        "id": "603609.SH"
                    },
                    {
                        "name": "天马科技",
                        "scale": 8.56268792E+9,
                        "id": "603668.SH"
                    },
                    {
                        "name": "驱动力",
                        "scale": 323740308,
                        "id": "838275.BJ"
                    }
                ],
                "name": "饲料",
                "scale": 294588855941,
                "id": "110400"
            },
            {
                "children": [
                    {
                        "name": "京粮控股",
                        "scale": 5376261052,
                        "id": "000505.SZ"
                    },
                    {
                        "name": "南宁糖业",
                        "scale": 2894042767,
                        "id": "000911.SZ"
                    },
                    {
                        "name": "中粮科技",
                        "scale": 16445357132,
                        "id": "000930.SZ"
                    },
                    {
                        "name": "ST中基",
                        "scale": 2159594021,
                        "id": "000972.SZ"
                    },
                    {
                        "name": "保龄宝",
                        "scale": 4202132427,
                        "id": "002286.SZ"
                    },
                    {
                        "name": "道道全",
                        "scale": 4347660412,
                        "id": "002852.SZ"
                    },
                    {
                        "name": "晨光生物",
                        "scale": 6.38520633E+9,
                        "id": "300138.SZ"
                    },
                    {
                        "name": "朗源股份",
                        "scale": 1.920864E+9,
                        "id": "300175.SZ"
                    },
                    {
                        "name": "佳沃食品",
                        "scale": 3763599626,
                        "id": "300268.SZ"
                    },
                    {
                        "name": "金丹科技",
                        "scale": 3.15657224E+9,
                        "id": "300829.SZ"
                    },
                    {
                        "name": "金龙鱼",
                        "scale": 25553251798,
                        "id": "300999.SZ"
                    },
                    {
                        "name": "金健米业",
                        "scale": 5487246514,
                        "id": "600127.SH"
                    },
                    {
                        "name": "*ST华资",
                        "scale": 2.8126056E+9,
                        "id": "600191.SH"
                    },
                    {
                        "name": "冠农股份",
                        "scale": 8407070568,
                        "id": "600251.SH"
                    },
                    {
                        "name": "安琪酵母",
                        "scale": 4.033876216E+10,
                        "id": "600298.SH"
                    },
                    {
                        "name": "中粮糖业",
                        "scale": 15699145994,
                        "id": "600737.SH"
                    },
                    {
                        "name": "梅花生物",
                        "scale": 3.355839388E+10,
                        "id": "600873.SH"
                    },
                    {
                        "name": "国投中鲁",
                        "scale": 3.0177576E+9,
                        "id": "600962.SH"
                    },
                    {
                        "name": "百龙创园",
                        "scale": 2.4669883E+9,
                        "id": "605016.SH"
                    },
                    {
                        "name": "德利股份",
                        "scale": 1.88512336E+9,
                        "id": "605198.SH"
                    },
                    {
                        "name": "盖世食品",
                        "scale": 343984548,
                        "id": "836826.BJ"
                    }
                ],
                "name": "农产品加工",
                "scale": 190221620329,
                "id": "110500"
            },
            {
                "children": [
                    {
                        "name": "大禹节水",
                        "scale": 3276215719,
                        "id": "300021.SZ"
                    },
                    {
                        "name": "金埔园林",
                        "scale": 518835583,
                        "id": "301098.SZ"
                    }
                ],
                "name": "农业综合",
                "scale": 3795051302,
                "id": "110600"
            },
            {
                "children": [
                    {
                        "name": "罗 牛 山",
                        "scale": 7492273127,
                        "id": "000735.SZ"
                    },
                    {
                        "name": "东瑞股份",
                        "scale": 3.00214535E+9,
                        "id": "001201.SZ"
                    },
                    {
                        "name": "民和股份",
                        "scale": 4221205332,
                        "id": "002234.SZ"
                    },
                    {
                        "name": "圣农发展",
                        "scale": 23831494371,
                        "id": "002299.SZ"
                    },
                    {
                        "name": "ST华英",
                        "scale": 5068593204,
                        "id": "002321.SZ"
                    },
                    {
                        "name": "益生股份",
                        "scale": 6182760157,
                        "id": "002458.SZ"
                    },
                    {
                        "name": "牧原股份",
                        "scale": 200761693954,
                        "id": "002714.SZ"
                    },
                    {
                        "name": "仙坛股份",
                        "scale": 6337408707,
                        "id": "002746.SZ"
                    },
                    {
                        "name": "湘佳股份",
                        "scale": 1.86390625E+9,
                        "id": "002982.SZ"
                    },
                    {
                        "name": "西部牧业",
                        "scale": 1792097989,
                        "id": "300106.SZ"
                    },
                    {
                        "name": "ST天山",
                        "scale": 1294778925,
                        "id": "300313.SZ"
                    },
                    {
                        "name": "温氏股份",
                        "scale": 118187055271,
                        "id": "300498.SZ"
                    },
                    {
                        "name": "立华股份",
                        "scale": 1.396565128E+10,
                        "id": "300761.SZ"
                    },
                    {
                        "name": "晓鸣股份",
                        "scale": 1.81627952E+9,
                        "id": "300967.SZ"
                    },
                    {
                        "name": "新五丰",
                        "scale": 5593429755,
                        "id": "600975.SH"
                    },
                    {
                        "name": "神农集团",
                        "scale": 1714290528,
                        "id": "605296.SH"
                    }
                ],
                "name": "畜禽养殖",
                "scale": 4.0312506372E+11,
                "id": "110700"
            },
            {
                "children": [
                    {
                        "name": "金河生物",
                        "scale": 3930224928,
                        "id": "002688.SZ"
                    },
                    {
                        "name": "绿康生化",
                        "scale": 2595444478,
                        "id": "002868.SZ"
                    },
                    {
                        "name": "瑞普生物",
                        "scale": 5651092068,
                        "id": "300119.SZ"
                    },
                    {
                        "name": "回盛生物",
                        "scale": 1864126974,
                        "id": "300871.SZ"
                    },
                    {
                        "name": "中牧股份",
                        "scale": 13223869967,
                        "id": "600195.SH"
                    },
                    {
                        "name": "生物股份",
                        "scale": 9724804882,
                        "id": "600201.SH"
                    },
                    {
                        "name": "普莱柯",
                        "scale": 1.02235728E+10,
                        "id": "603566.SH"
                    },
                    {
                        "name": "海利生物",
                        "scale": 7.12264E+9,
                        "id": "603718.SH"
                    },
                    {
                        "name": "蔚蓝生物",
                        "scale": 3.33462052E+9,
                        "id": "603739.SH"
                    },
                    {
                        "name": "申联生物",
                        "scale": 2256049486,
                        "id": "688098.SH"
                    },
                    {
                        "name": "科前生物",
                        "scale": 3053118118,
                        "id": "688526.SH"
                    }
                ],
                "name": "动物保健",
                "scale": 62979564221,
                "id": "110800"
            }
        ],
        "name": "农林牧渔",
        "scale": 1150265226515,
        "id": "110000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "ST洲际",
                        "scale": 5193823241,
                        "id": "600759.SH"
                    },
                    {
                        "name": "新潮能源",
                        "scale": 15954120492,
                        "id": "600777.SH"
                    },
                    {
                        "name": "中国石油",
                        "scale": 848471687766,
                        "id": "601857.SH"
                    }
                ],
                "name": "石油开采",
                "scale": 869619631499,
                "id": "210100"
            },
            {
                "children": [
                    {
                        "name": "靖远煤电",
                        "scale": 9791804324,
                        "id": "000552.SZ"
                    },
                    {
                        "name": "ST大洲",
                        "scale": 1994388996,
                        "id": "000571.SZ"
                    },
                    {
                        "name": "美锦能源",
                        "scale": 4.506209915E+10,
                        "id": "000723.SZ"
                    },
                    {
                        "name": "ST平能",
                        "scale": 0.0,
                        "id": "000780.SZ"
                    },
                    {
                        "name": "冀中能源",
                        "scale": 19968340915,
                        "id": "000937.SZ"
                    },
                    {
                        "name": "蓝焰控股",
                        "scale": 9916902265,
                        "id": "000968.SZ"
                    },
                    {
                        "name": "山西焦煤",
                        "scale": 4.99370664E+10,
                        "id": "000983.SZ"
                    },
                    {
                        "name": "电投能源",
                        "scale": 24019117406,
                        "id": "002128.SZ"
                    },
                    {
                        "name": "郑州煤电",
                        "scale": 7347024589,
                        "id": "600121.SH"
                    },
                    {
                        "name": "兰花科创",
                        "scale": 1.702176E+10,
                        "id": "600123.SH"
                    },
                    {
                        "name": "兖矿能源",
                        "scale": 1.2652777979E+11,
                        "id": "600188.SH"
                    },
                    {
                        "name": "华阳股份",
                        "scale": 4.975945E+10,
                        "id": "600348.SH"
                    },
                    {
                        "name": "盘江股份",
                        "scale": 13885885114,
                        "id": "600395.SH"
                    },
                    {
                        "name": "安源煤业",
                        "scale": 3138172826,
                        "id": "600397.SH"
                    },
                    {
                        "name": "大有能源",
                        "scale": 12695213855,
                        "id": "600403.SH"
                    },
                    {
                        "name": "安泰集团",
                        "scale": 3.201624E+9,
                        "id": "600408.SH"
                    },
                    {
                        "name": "上海能源",
                        "scale": 1.253193012E+10,
                        "id": "600508.SH"
                    },
                    {
                        "name": "山煤国际",
                        "scale": 33543157889,
                        "id": "600546.SH"
                    },
                    {
                        "name": "云维股份",
                        "scale": 5.0038282E+9,
                        "id": "600725.SH"
                    },
                    {
                        "name": "山西焦化",
                        "scale": 1.647443902E+10,
                        "id": "600740.SH"
                    },
                    {
                        "name": "辽宁能源",
                        "scale": 5613159425,
                        "id": "600758.SH"
                    },
                    {
                        "name": "云煤能源",
                        "scale": 3939895928,
                        "id": "600792.SH"
                    },
                    {
                        "name": "恒源煤电",
                        "scale": 9048036825,
                        "id": "600971.SH"
                    },
                    {
                        "name": "淮北矿业",
                        "scale": 3.406462325E+10,
                        "id": "600985.SH"
                    },
                    {
                        "name": "开滦股份",
                        "scale": 1.140040293E+10,
                        "id": "600997.SH"
                    },
                    {
                        "name": "晋控煤业",
                        "scale": 2.5005078E+10,
                        "id": "601001.SH"
                    },
                    {
                        "name": "宝泰隆",
                        "scale": 6868575659,
                        "id": "601011.SH"
                    },
                    {
                        "name": "陕西黑猫",
                        "scale": 11499261708,
                        "id": "601015.SH"
                    },
                    {
                        "name": "中国神华",
                        "scale": 477250638418,
                        "id": "601088.SH"
                    },
                    {
                        "name": "昊华能源",
                        "scale": 10281585192,
                        "id": "601101.SH"
                    },
                    {
                        "name": "陕西煤业",
                        "scale": 2.0272245E+11,
                        "id": "601225.SH"
                    },
                    {
                        "name": "平煤股份",
                        "scale": 28999243591,
                        "id": "601666.SH"
                    },
                    {
                        "name": "潞安环能",
                        "scale": 4.247801064E+10,
                        "id": "601699.SH"
                    },
                    {
                        "name": "中煤能源",
                        "scale": 84839043708,
                        "id": "601898.SH"
                    },
                    {
                        "name": "新集能源",
                        "scale": 12615938566,
                        "id": "601918.SH"
                    },
                    {
                        "name": "物产环能",
                        "scale": 1796724902,
                        "id": "603071.SH"
                    },
                    {
                        "name": "金能科技",
                        "scale": 8567912873,
                        "id": "603113.SH"
                    }
                ],
                "name": "煤炭开采",
                "scale": 1438810566474,
                "id": "210200"
            },
            {
                "children": [
                    {
                        "name": "攀钢钒钛",
                        "scale": 50849433426,
                        "id": "000629.SZ"
                    },
                    {
                        "name": "金岭矿业",
                        "scale": 4566259564,
                        "id": "000655.SZ"
                    },
                    {
                        "name": "西藏矿业",
                        "scale": 27997967048,
                        "id": "000762.SZ"
                    },
                    {
                        "name": "粤桂股份",
                        "scale": 3024680176,
                        "id": "000833.SZ"
                    },
                    {
                        "name": "河钢资源",
                        "scale": 7898810333,
                        "id": "000923.SZ"
                    },
                    {
                        "name": "大中矿业",
                        "scale": 6237011397,
                        "id": "001203.SZ"
                    },
                    {
                        "name": "安宁股份",
                        "scale": 3.87505E+9,
                        "id": "002978.SZ"
                    },
                    {
                        "name": "鄂尔多斯",
                        "scale": 1.632525923E+10,
                        "id": "600295.SH"
                    },
                    {
                        "name": "*ST未来",
                        "scale": 12235918221,
                        "id": "600532.SH"
                    },
                    {
                        "name": "海南矿业",
                        "scale": 16557737161,
                        "id": "601969.SH"
                    },
                    {
                        "name": "金石资源",
                        "scale": 16673108431,
                        "id": "603505.SH"
                    },
                    {
                        "name": "龙高股份",
                        "scale": 1.04759296E+9,
                        "id": "605086.SH"
                    }
                ],
                "name": "其他采掘",
                "scale": 167288827947,
                "id": "210300"
            },
            {
                "children": [
                    {
                        "name": "准油股份",
                        "scale": 2109460674,
                        "id": "002207.SZ"
                    },
                    {
                        "name": "惠博普",
                        "scale": 3206538607,
                        "id": "002554.SZ"
                    },
                    {
                        "name": "仁智股份",
                        "scale": 1416276338,
                        "id": "002629.SZ"
                    },
                    {
                        "name": "贝肯能源",
                        "scale": 1305362647,
                        "id": "002828.SZ"
                    },
                    {
                        "name": "恒泰艾普",
                        "scale": 2812004996,
                        "id": "300157.SZ"
                    },
                    {
                        "name": "通源石油",
                        "scale": 2199973371,
                        "id": "300164.SZ"
                    },
                    {
                        "name": "潜能恒信",
                        "scale": 4.637248E+9,
                        "id": "300191.SZ"
                    },
                    {
                        "name": "中油工程",
                        "scale": 16246959141,
                        "id": "600339.SH"
                    },
                    {
                        "name": "海油工程",
                        "scale": 19056039188,
                        "id": "600583.SH"
                    },
                    {
                        "name": "石化油服",
                        "scale": 26053206818,
                        "id": "600871.SH"
                    },
                    {
                        "name": "海油发展",
                        "scale": 25921015707,
                        "id": "600968.SH"
                    },
                    {
                        "name": "中海油服",
                        "scale": 4.076564436E+10,
                        "id": "601808.SH"
                    },
                    {
                        "name": "中曼石油",
                        "scale": 8556002139,
                        "id": "603619.SH"
                    },
                    {
                        "name": "博迈科",
                        "scale": 3514799822,
                        "id": "603727.SH"
                    },
                    {
                        "name": "金诚信",
                        "scale": 11694151674,
                        "id": "603979.SH"
                    }
                ],
                "name": "采掘服务",
                "scale": 169494683482,
                "id": "210400"
            }
        ],
        "name": "采掘",
        "scale": 2645213709402,
        "id": "210000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "华锦股份",
                        "scale": 10588309595,
                        "id": "000059.SZ"
                    },
                    {
                        "name": "广聚能源",
                        "scale": 4.980768E+9,
                        "id": "000096.SZ"
                    },
                    {
                        "name": "国际实业",
                        "scale": 3912783983,
                        "id": "000159.SZ"
                    },
                    {
                        "name": "泰山石油",
                        "scale": 2077982838,
                        "id": "000554.SZ"
                    },
                    {
                        "name": "茂化实华",
                        "scale": 1766408501,
                        "id": "000637.SZ"
                    },
                    {
                        "name": "沈阳化工",
                        "scale": 3480609132,
                        "id": "000698.SZ"
                    },
                    {
                        "name": "岳阳兴长",
                        "scale": 7409951816,
                        "id": "000819.SZ"
                    },
                    {
                        "name": "东华能源",
                        "scale": 12970248172,
                        "id": "002221.SZ"
                    },
                    {
                        "name": "中晟高科",
                        "scale": 1661713956,
                        "id": "002778.SZ"
                    },
                    {
                        "name": "宇新股份",
                        "scale": 3682217063,
                        "id": "002986.SZ"
                    },
                    {
                        "name": "宝利国际",
                        "scale": 1.86669327E+9,
                        "id": "300135.SZ"
                    },
                    {
                        "name": "博汇股份",
                        "scale": 1213946031,
                        "id": "300839.SZ"
                    },
                    {
                        "name": "中国石化",
                        "scale": 396564749841,
                        "id": "600028.SH"
                    },
                    {
                        "name": "广汇能源",
                        "scale": 7.130410081E+10,
                        "id": "600256.SH"
                    },
                    {
                        "name": "ST海越",
                        "scale": 2751570231,
                        "id": "600387.SH"
                    },
                    {
                        "name": "上海石化",
                        "scale": 2.271932185E+10,
                        "id": "600688.SH"
                    },
                    {
                        "name": "和顺石油",
                        "scale": 1.20946514E+9,
                        "id": "603353.SH"
                    },
                    {
                        "name": "康普顿",
                        "scale": 2.198E+9,
                        "id": "603798.SH"
                    },
                    {
                        "name": "龙蟠科技",
                        "scale": 17413139634,
                        "id": "603906.SH"
                    }
                ],
                "name": "石油化工",
                "scale": 569771979863,
                "id": "220100"
            },
            {
                "children": [
                    {
                        "name": "湖北宜化",
                        "scale": 17309762032,
                        "id": "000422.SZ"
                    },
                    {
                        "name": "新金路",
                        "scale": 3660707421,
                        "id": "000510.SZ"
                    },
                    {
                        "name": "金浦钛业",
                        "scale": 5015701759,
                        "id": "000545.SZ"
                    },
                    {
                        "name": "英 力 特",
                        "scale": 3082400912,
                        "id": "000635.SZ"
                    },
                    {
                        "name": "远兴能源",
                        "scale": 30605590313,
                        "id": "000683.SZ"
                    },
                    {
                        "name": "双环科技",
                        "scale": 5592956468,
                        "id": "000707.SZ"
                    },
                    {
                        "name": "航锦科技",
                        "scale": 22456452942,
                        "id": "000818.SZ"
                    },
                    {
                        "name": "山东海化",
                        "scale": 8216943881,
                        "id": "000822.SZ"
                    },
                    {
                        "name": "鸿达兴业",
                        "scale": 11704365325,
                        "id": "002002.SZ"
                    },
                    {
                        "name": "云南能投",
                        "scale": 9694803231,
                        "id": "002053.SZ"
                    },
                    {
                        "name": "中泰化学",
                        "scale": 18797920268,
                        "id": "002092.SZ"
                    },
                    {
                        "name": "湘潭电化",
                        "scale": 12743006348,
                        "id": "002125.SZ"
                    },
                    {
                        "name": "天原股份",
                        "scale": 9893900591,
                        "id": "002386.SZ"
                    },
                    {
                        "name": "丰元股份",
                        "scale": 6974504433,
                        "id": "002805.SZ"
                    },
                    {
                        "name": "大洋生物",
                        "scale": 1338373529,
                        "id": "003017.SZ"
                    },
                    {
                        "name": "国瓷材料",
                        "scale": 26565581468,
                        "id": "300285.SZ"
                    },
                    {
                        "name": "道氏技术",
                        "scale": 10377538698,
                        "id": "300409.SZ"
                    },
                    {
                        "name": "晶瑞电材",
                        "scale": 12014538182,
                        "id": "300655.SZ"
                    },
                    {
                        "name": "江天化学",
                        "scale": 1643334587,
                        "id": "300927.SZ"
                    },
                    {
                        "name": "保立佳",
                        "scale": 5.873813E+8,
                        "id": "301037.SZ"
                    },
                    {
                        "name": "本立科技",
                        "scale": 7.015424E+8,
                        "id": "301065.SZ"
                    },
                    {
                        "name": "华润材料",
                        "scale": 2060873358,
                        "id": "301090.SZ"
                    },
                    {
                        "name": "恒光股份",
                        "scale": 1137433536,
                        "id": "301118.SZ"
                    },
                    {
                        "name": "隆华新材",
                        "scale": 1032674886,
                        "id": "301149.SZ"
                    },
                    {
                        "name": "新疆天业",
                        "scale": 7891805455,
                        "id": "600075.SH"
                    },
                    {
                        "name": "亿利洁能",
                        "scale": 18515235409,
                        "id": "600277.SH"
                    },
                    {
                        "name": "亚星化学",
                        "scale": 2.03873724E+9,
                        "id": "600319.SH"
                    },
                    {
                        "name": "中盐化工",
                        "scale": 11264981911,
                        "id": "600328.SH"
                    },
                    {
                        "name": "红星发展",
                        "scale": 7240011654,
                        "id": "600367.SH"
                    },
                    {
                        "name": "三友化工",
                        "scale": 14656881081,
                        "id": "600409.SH"
                    },
                    {
                        "name": "氯碱化工",
                        "scale": 8660651723,
                        "id": "600618.SH"
                    },
                    {
                        "name": "金瑞矿业",
                        "scale": 3.38895297E+9,
                        "id": "600714.SH"
                    },
                    {
                        "name": "金牛化工",
                        "scale": 3.65331666E+9,
                        "id": "600722.SH"
                    },
                    {
                        "name": "雪天盐业",
                        "scale": 10250033511,
                        "id": "600929.SH"
                    },
                    {
                        "name": "华塑股份",
                        "scale": 2.1692638E+9,
                        "id": "600935.SH"
                    },
                    {
                        "name": "宝丰能源",
                        "scale": 3.043203E+10,
                        "id": "600989.SH"
                    },
                    {
                        "name": "君正集团",
                        "scale": 37549177386,
                        "id": "601216.SH"
                    },
                    {
                        "name": "北元集团",
                        "scale": 15783829118,
                        "id": "601568.SH"
                    },
                    {
                        "name": "滨化股份",
                        "scale": 1.245111947E+10,
                        "id": "601678.SH"
                    },
                    {
                        "name": "振华股份",
                        "scale": 9461118244,
                        "id": "603067.SH"
                    },
                    {
                        "name": "和邦生物",
                        "scale": 35501625917,
                        "id": "603077.SH"
                    },
                    {
                        "name": "镇洋发展",
                        "scale": 1.0219716E+9,
                        "id": "603213.SH"
                    },
                    {
                        "name": "苏盐井神",
                        "scale": 9553372096,
                        "id": "603299.SH"
                    },
                    {
                        "name": "兴业股份",
                        "scale": 2.606688E+9,
                        "id": "603928.SH"
                    },
                    {
                        "name": "三孚股份",
                        "scale": 14211767024,
                        "id": "603938.SH"
                    }
                ],
                "name": "化学原料",
                "scale": 481510858137,
                "id": "220200"
            },
            {
                "children": [
                    {
                        "name": "藏格矿业",
                        "scale": 53560385439,
                        "id": "000408.SZ"
                    },
                    {
                        "name": "广州浪奇",
                        "scale": 4722567861,
                        "id": "000523.SZ"
                    },
                    {
                        "name": "ST红太阳",
                        "scale": 9140530913,
                        "id": "000525.SZ"
                    },
                    {
                        "name": "安道麦A",
                        "scale": 24100136793,
                        "id": "000553.SZ"
                    },
                    {
                        "name": "渝三峡Ａ",
                        "scale": 3243269806,
                        "id": "000565.SZ"
                    },
                    {
                        "name": "四川美丰",
                        "scale": 5851380282,
                        "id": "000731.SZ"
                    },
                    {
                        "name": "北方铜业",
                        "scale": 3855147004,
                        "id": "000737.SZ"
                    },
                    {
                        "name": "盐湖股份",
                        "scale": 157220237724,
                        "id": "000792.SZ"
                    },
                    {
                        "name": "鲁西化工",
                        "scale": 21200256864,
                        "id": "000830.SZ"
                    },
                    {
                        "name": "中广核技",
                        "scale": 6634754454,
                        "id": "000881.SZ"
                    },
                    {
                        "name": "亚钾国际",
                        "scale": 26109281634,
                        "id": "000893.SZ"
                    },
                    {
                        "name": "新洋丰",
                        "scale": 20105083108,
                        "id": "000902.SZ"
                    },
                    {
                        "name": "泸天化",
                        "scale": 8.05952E+9,
                        "id": "000912.SZ"
                    },
                    {
                        "name": "河化股份",
                        "scale": 2.21503928E+9,
                        "id": "000953.SZ"
                    },
                    {
                        "name": "大庆华科",
                        "scale": 2.10534548E+9,
                        "id": "000985.SZ"
                    },
                    {
                        "name": "诚志股份",
                        "scale": 13131555479,
                        "id": "000990.SZ"
                    },
                    {
                        "name": "华尔泰",
                        "scale": 1.2412312E+9,
                        "id": "001217.SZ"
                    },
                    {
                        "name": "丽臣实业",
                        "scale": 7.4592E+8,
                        "id": "001218.SZ"
                    },
                    {
                        "name": "华邦健康",
                        "scale": 11056450824,
                        "id": "002004.SZ"
                    },
                    {
                        "name": "保利联合",
                        "scale": 4514633671,
                        "id": "002037.SZ"
                    },
                    {
                        "name": "德美化工",
                        "scale": 3181225073,
                        "id": "002054.SZ"
                    },
                    {
                        "name": "中材科技",
                        "scale": 4.465486857E+10,
                        "id": "002080.SZ"
                    },
                    {
                        "name": "青岛金王",
                        "scale": 2.67895977E+9,
                        "id": "002094.SZ"
                    },
                    {
                        "name": "南岭民爆",
                        "scale": 4565163192,
                        "id": "002096.SZ"
                    },
                    {
                        "name": "兴化股份",
                        "scale": 6107079776,
                        "id": "002109.SZ"
                    },
                    {
                        "name": "安 纳 达",
                        "scale": 3.36183605E+9,
                        "id": "002136.SZ"
                    },
                    {
                        "name": "中核钛白",
                        "scale": 21042257593,
                        "id": "002145.SZ"
                    },
                    {
                        "name": "红 宝 丽",
                        "scale": 3461954883,
                        "id": "002165.SZ"
                    },
                    {
                        "name": "芭田股份",
                        "scale": 4429584436,
                        "id": "002170.SZ"
                    },
                    {
                        "name": "正威新材",
                        "scale": 10924232558,
                        "id": "002201.SZ"
                    },
                    {
                        "name": "ST宏达",
                        "scale": 1253454759,
                        "id": "002211.SZ"
                    },
                    {
                        "name": "诺 普 信",
                        "scale": 4951060538,
                        "id": "002215.SZ"
                    },
                    {
                        "name": "江南化工",
                        "scale": 7029847226,
                        "id": "002226.SZ"
                    },
                    {
                        "name": "北化股份",
                        "scale": 4974255234,
                        "id": "002246.SZ"
                    },
                    {
                        "name": "联化科技",
                        "scale": 19557812686,
                        "id": "002250.SZ"
                    },
                    {
                        "name": "利尔化学",
                        "scale": 17659945911,
                        "id": "002258.SZ"
                    },
                    {
                        "name": "华昌化工",
                        "scale": 8667111961,
                        "id": "002274.SZ"
                    },
                    {
                        "name": "乐通股份",
                        "scale": 2.918E+9,
                        "id": "002319.SZ"
                    },
                    {
                        "name": "永太科技",
                        "scale": 21380881035,
                        "id": "002326.SZ"
                    },
                    {
                        "name": "新纶新材",
                        "scale": 4409790604,
                        "id": "002341.SZ"
                    },
                    {
                        "name": "同德化工",
                        "scale": 2562911862,
                        "id": "002360.SZ"
                    },
                    {
                        "name": "神剑股份",
                        "scale": 4180662002,
                        "id": "002361.SZ"
                    },
                    {
                        "name": "长青股份",
                        "scale": 3463292333,
                        "id": "002391.SZ"
                    },
                    {
                        "name": "多氟多",
                        "scale": 32246955582,
                        "id": "002407.SZ"
                    },
                    {
                        "name": "齐翔腾达",
                        "scale": 22746491014,
                        "id": "002408.SZ"
                    },
                    {
                        "name": "闰土股份",
                        "scale": 7785079532,
                        "id": "002440.SZ"
                    },
                    {
                        "name": "华软科技",
                        "scale": 7.48813062E+9,
                        "id": "002453.SZ"
                    },
                    {
                        "name": "百川股份",
                        "scale": 6.26199619E+9,
                        "id": "002455.SZ"
                    },
                    {
                        "name": "ST金正",
                        "scale": 7416632489,
                        "id": "002470.SZ"
                    },
                    {
                        "name": "宝莫股份",
                        "scale": 3726767126,
                        "id": "002476.SZ"
                    },
                    {
                        "name": "辉丰股份",
                        "scale": 2641239376,
                        "id": "002496.SZ"
                    },
                    {
                        "name": "雅化集团",
                        "scale": 30539288565,
                        "id": "002497.SZ"
                    },
                    {
                        "name": "蓝丰生化",
                        "scale": 1638106485,
                        "id": "002513.SZ"
                    },
                    {
                        "name": "司尔特",
                        "scale": 8264181766,
                        "id": "002538.SZ"
                    },
                    {
                        "name": "云图控股",
                        "scale": 10765369786,
                        "id": "002539.SZ"
                    },
                    {
                        "name": "东方铁塔",
                        "scale": 1.12753553E+10,
                        "id": "002545.SZ"
                    },
                    {
                        "name": "凯美特气",
                        "scale": 11993463689,
                        "id": "002549.SZ"
                    },
                    {
                        "name": "辉隆股份",
                        "scale": 9775022051,
                        "id": "002556.SZ"
                    },
                    {
                        "name": "兄弟科技",
                        "scale": 4585712509,
                        "id": "002562.SZ"
                    },
                    {
                        "name": "西陇科学",
                        "scale": 3307494421,
                        "id": "002584.SZ"
                    },
                    {
                        "name": "史丹利",
                        "scale": 5195186049,
                        "id": "002588.SZ"
                    },
                    {
                        "name": "龙佰集团",
                        "scale": 31404408209,
                        "id": "002601.SZ"
                    },
                    {
                        "name": "道明光学",
                        "scale": 4.17728882E+9,
                        "id": "002632.SZ"
                    },
                    {
                        "name": "赞宇科技",
                        "scale": 6135792836,
                        "id": "002637.SZ"
                    },
                    {
                        "name": "万润股份",
                        "scale": 17843428843,
                        "id": "002643.SZ"
                    },
                    {
                        "name": "卫星化学",
                        "scale": 6.175543846E+10,
                        "id": "002648.SZ"
                    },
                    {
                        "name": "德联集团",
                        "scale": 2740549435,
                        "id": "002666.SZ"
                    },
                    {
                        "name": "康达新材",
                        "scale": 4020835113,
                        "id": "002669.SZ"
                    },
                    {
                        "name": "广东宏大",
                        "scale": 22534231705,
                        "id": "002683.SZ"
                    },
                    {
                        "name": "天赐材料",
                        "scale": 107043648203,
                        "id": "002709.SZ"
                    },
                    {
                        "name": "利民股份",
                        "scale": 3397982641,
                        "id": "002734.SZ"
                    },
                    {
                        "name": "光华科技",
                        "scale": 7698769778,
                        "id": "002741.SZ"
                    },
                    {
                        "name": "世龙实业",
                        "scale": 3.6072E+9,
                        "id": "002748.SZ"
                    },
                    {
                        "name": "国光股份",
                        "scale": 4351781651,
                        "id": "002749.SZ"
                    },
                    {
                        "name": "凯龙股份",
                        "scale": 3376010302,
                        "id": "002783.SZ"
                    },
                    {
                        "name": "洪汇新材",
                        "scale": 2303903011,
                        "id": "002802.SZ"
                    },
                    {
                        "name": "红墙股份",
                        "scale": 1472632276,
                        "id": "002809.SZ"
                    },
                    {
                        "name": "山东赫达",
                        "scale": 11857063666,
                        "id": "002810.SZ"
                    },
                    {
                        "name": "恩捷股份",
                        "scale": 158009533371,
                        "id": "002812.SZ"
                    },
                    {
                        "name": "高争民爆",
                        "scale": 2.898E+9,
                        "id": "002827.SZ"
                    },
                    {
                        "name": "川恒股份",
                        "scale": 14728466798,
                        "id": "002895.SZ"
                    },
                    {
                        "name": "集泰股份",
                        "scale": 4223465738,
                        "id": "002909.SZ"
                    },
                    {
                        "name": "中欣氟材",
                        "scale": 5115391917,
                        "id": "002915.SZ"
                    },
                    {
                        "name": "金奥博",
                        "scale": 2742515406,
                        "id": "002917.SZ"
                    },
                    {
                        "name": "名臣健康",
                        "scale": 4533639748,
                        "id": "002919.SZ"
                    },
                    {
                        "name": "新农股份",
                        "scale": 2488308127,
                        "id": "002942.SZ"
                    },
                    {
                        "name": "和远气体",
                        "scale": 2.6380511E+9,
                        "id": "002971.SZ"
                    },
                    {
                        "name": "天禾股份",
                        "scale": 1.50023216E+9,
                        "id": "002999.SZ"
                    },
                    {
                        "name": "壶化股份",
                        "scale": 1183743008,
                        "id": "003002.SZ"
                    },
                    {
                        "name": "联泓新科",
                        "scale": 1.7481672E+10,
                        "id": "003022.SZ"
                    },
                    {
                        "name": "中农联合",
                        "scale": 1.6062618E+9,
                        "id": "003042.SZ"
                    },
                    {
                        "name": "硅宝科技",
                        "scale": 7764438099,
                        "id": "300019.SZ"
                    },
                    {
                        "name": "中科电气",
                        "scale": 15709714277,
                        "id": "300035.SZ"
                    },
                    {
                        "name": "新宙邦",
                        "scale": 27249596986,
                        "id": "300037.SZ"
                    },
                    {
                        "name": "回天新材",
                        "scale": 8134142413,
                        "id": "300041.SZ"
                    },
                    {
                        "name": "鼎龙股份",
                        "scale": 17691203499,
                        "id": "300054.SZ"
                    },
                    {
                        "name": "安诺其",
                        "scale": 2899500881,
                        "id": "300067.SZ"
                    },
                    {
                        "name": "海新能科",
                        "scale": 11438318476,
                        "id": "300072.SZ"
                    },
                    {
                        "name": "当升科技",
                        "scale": 45614266241,
                        "id": "300073.SZ"
                    },
                    {
                        "name": "奥克股份",
                        "scale": 7379883756,
                        "id": "300082.SZ"
                    },
                    {
                        "name": "建新股份",
                        "scale": 2041823097,
                        "id": "300107.SZ"
                    },
                    {
                        "name": "新开源",
                        "scale": 6613935592,
                        "id": "300109.SZ"
                    },
                    {
                        "name": "青松股份",
                        "scale": 3084990825,
                        "id": "300132.SZ"
                    },
                    {
                        "name": "先锋新材",
                        "scale": 1.70504892E+9,
                        "id": "300163.SZ"
                    },
                    {
                        "name": "天晟新材",
                        "scale": 1626067788,
                        "id": "300169.SZ"
                    },
                    {
                        "name": "元力股份",
                        "scale": 6127557811,
                        "id": "300174.SZ"
                    },
                    {
                        "name": "长海股份",
                        "scale": 4302913703,
                        "id": "300196.SZ"
                    },
                    {
                        "name": "高盟新材",
                        "scale": 3731099429,
                        "id": "300200.SZ"
                    },
                    {
                        "name": "日科化学",
                        "scale": 3358408409,
                        "id": "300214.SZ"
                    },
                    {
                        "name": "金力泰",
                        "scale": 3563855427,
                        "id": "300225.SZ"
                    },
                    {
                        "name": "上海新阳",
                        "scale": 11238637308,
                        "id": "300236.SZ"
                    },
                    {
                        "name": "瑞丰高材",
                        "scale": 2002016552,
                        "id": "300243.SZ"
                    },
                    {
                        "name": "雅本化学",
                        "scale": 12470499856,
                        "id": "300261.SZ"
                    },
                    {
                        "name": "富邦股份",
                        "scale": 2021651803,
                        "id": "300387.SZ"
                    },
                    {
                        "name": "飞凯材料",
                        "scale": 12683493172,
                        "id": "300398.SZ"
                    },
                    {
                        "name": "科隆股份",
                        "scale": 1377728136,
                        "id": "300405.SZ"
                    },
                    {
                        "name": "强力新材",
                        "scale": 3873624764,
                        "id": "300429.SZ"
                    },
                    {
                        "name": "清水源",
                        "scale": 3.89583018E+9,
                        "id": "300437.SZ"
                    },
                    {
                        "name": "乐凯新材",
                        "scale": 2455886079,
                        "id": "300446.SZ"
                    },
                    {
                        "name": "濮阳惠成",
                        "scale": 12985685094,
                        "id": "300481.SZ"
                    },
                    {
                        "name": "蓝晓科技",
                        "scale": 16404583386,
                        "id": "300487.SZ"
                    },
                    {
                        "name": "川金诺",
                        "scale": 4965158503,
                        "id": "300505.SZ"
                    },
                    {
                        "name": "世名科技",
                        "scale": 2568678697,
                        "id": "300522.SZ"
                    },
                    {
                        "name": "达志科技",
                        "scale": 3065863636,
                        "id": "300530.SZ"
                    },
                    {
                        "name": "达威股份",
                        "scale": 1286308877,
                        "id": "300535.SZ"
                    },
                    {
                        "name": "广信材料",
                        "scale": 2.53595764E+9,
                        "id": "300537.SZ"
                    },
                    {
                        "name": "星源材质",
                        "scale": 27635480958,
                        "id": "300568.SZ"
                    },
                    {
                        "name": "中旗股份",
                        "scale": 4190304228,
                        "id": "300575.SZ"
                    },
                    {
                        "name": "容大感光",
                        "scale": 3542366398,
                        "id": "300576.SZ"
                    },
                    {
                        "name": "利安隆",
                        "scale": 9520541831,
                        "id": "300596.SZ"
                    },
                    {
                        "name": "晨化股份",
                        "scale": 3244068063,
                        "id": "300610.SZ"
                    },
                    {
                        "name": "扬帆新材",
                        "scale": 2009470921,
                        "id": "300637.SZ"
                    },
                    {
                        "name": "正丹股份",
                        "scale": 3020857957,
                        "id": "300641.SZ"
                    },
                    {
                        "name": "飞鹿股份",
                        "scale": 1250631106,
                        "id": "300665.SZ"
                    },
                    {
                        "name": "双一科技",
                        "scale": 2501898016,
                        "id": "300690.SZ"
                    },
                    {
                        "name": "怡达股份",
                        "scale": 3340367386,
                        "id": "300721.SZ"
                    },
                    {
                        "name": "润禾材料",
                        "scale": 4876903618,
                        "id": "300727.SZ"
                    },
                    {
                        "name": "水羊股份",
                        "scale": 7167697611,
                        "id": "300740.SZ"
                    },
                    {
                        "name": "天地数码",
                        "scale": 1236409418,
                        "id": "300743.SZ"
                    },
                    {
                        "name": "七彩化学",
                        "scale": 5043348647,
                        "id": "300758.SZ"
                    },
                    {
                        "name": "德方纳米",
                        "scale": 55124446332,
                        "id": "300769.SZ"
                    },
                    {
                        "name": "贝斯美",
                        "scale": 1580338474,
                        "id": "300796.SZ"
                    },
                    {
                        "name": "锦鸡股份",
                        "scale": 1578568943,
                        "id": "300798.SZ"
                    },
                    {
                        "name": "泰和科技",
                        "scale": 2459090999,
                        "id": "300801.SZ"
                    },
                    {
                        "name": "斯迪克",
                        "scale": 5131954654,
                        "id": "300806.SZ"
                    },
                    {
                        "name": "东岳硅材",
                        "scale": 7.34754E+9,
                        "id": "300821.SZ"
                    },
                    {
                        "name": "中船汉光",
                        "scale": 2026774127,
                        "id": "300847.SZ"
                    },
                    {
                        "name": "美瑞新材",
                        "scale": 2.08487142E+9,
                        "id": "300848.SZ"
                    },
                    {
                        "name": "科思股份",
                        "scale": 2.8351686E+9,
                        "id": "300856.SZ"
                    },
                    {
                        "name": "华业香料",
                        "scale": 864067991,
                        "id": "300886.SZ"
                    },
                    {
                        "name": "翔丰华",
                        "scale": 4481522228,
                        "id": "300890.SZ"
                    },
                    {
                        "name": "惠云钛业",
                        "scale": 3.0247392E+9,
                        "id": "300891.SZ"
                    },
                    {
                        "name": "瑞丰新材",
                        "scale": 5556679623,
                        "id": "300910.SZ"
                    },
                    {
                        "name": "中伟股份",
                        "scale": 22739838522,
                        "id": "300919.SZ"
                    },
                    {
                        "name": "贝泰妮",
                        "scale": 42435252387,
                        "id": "300957.SZ"
                    },
                    {
                        "name": "晶雪节能",
                        "scale": 1154073982,
                        "id": "301010.SZ"
                    },
                    {
                        "name": "润丰股份",
                        "scale": 6818547803,
                        "id": "301035.SZ"
                    },
                    {
                        "name": "双乐股份",
                        "scale": 1054670539,
                        "id": "301036.SZ"
                    },
                    {
                        "name": "汇隆新材",
                        "scale": 5.66475E+8,
                        "id": "301057.SZ"
                    },
                    {
                        "name": "凯盛新材",
                        "scale": 2.5518E+9,
                        "id": "301069.SZ"
                    },
                    {
                        "name": "争光股份",
                        "scale": 1190000024,
                        "id": "301092.SZ"
                    },
                    {
                        "name": "洁雅股份",
                        "scale": 765808716,
                        "id": "301108.SZ"
                    },
                    {
                        "name": "善水科技",
                        "scale": 1.4176972E+9,
                        "id": "301190.SZ"
                    },
                    {
                        "name": "*ST澄星",
                        "scale": 10654171605,
                        "id": "600078.SH"
                    },
                    {
                        "name": "云天化",
                        "scale": 47596133328,
                        "id": "600096.SH"
                    },
                    {
                        "name": "兴发集团",
                        "scale": 37882084589,
                        "id": "600141.SH"
                    },
                    {
                        "name": "巨化股份",
                        "scale": 45706701151,
                        "id": "600160.SH"
                    },
                    {
                        "name": "新日恒力",
                        "scale": 7191279638,
                        "id": "600165.SH"
                    },
                    {
                        "name": "中国巨石",
                        "scale": 60207176389,
                        "id": "600176.SH"
                    },
                    {
                        "name": "返利科技",
                        "scale": 1.5251424E+9,
                        "id": "600228.SH"
                    },
                    {
                        "name": "沧州大化",
                        "scale": 6935781374,
                        "id": "600230.SH"
                    },
                    {
                        "name": "两面针",
                        "scale": 2.7775E+9,
                        "id": "600249.SH"
                    },
                    {
                        "name": "嘉化能源",
                        "scale": 14650327413,
                        "id": "600273.SH"
                    },
                    {
                        "name": "安迪苏",
                        "scale": 25531700119,
                        "id": "600299.SH"
                    },
                    {
                        "name": "万华化学",
                        "scale": 275889536027,
                        "id": "600309.SH"
                    },
                    {
                        "name": "上海家化",
                        "scale": 2.39251385E+10,
                        "id": "600315.SH"
                    },
                    {
                        "name": "浙江龙盛",
                        "scale": 32240518733,
                        "id": "600352.SH"
                    },
                    {
                        "name": "昊华科技",
                        "scale": 37621898594,
                        "id": "600378.SH"
                    },
                    {
                        "name": "江山股份",
                        "scale": 1.716363E+10,
                        "id": "600389.SH"
                    },
                    {
                        "name": "柳化股份",
                        "scale": 3035041099,
                        "id": "600423.SH"
                    },
                    {
                        "name": "华鲁恒升",
                        "scale": 61693269212,
                        "id": "600426.SH"
                    },
                    {
                        "name": "时代新材",
                        "scale": 8854863617,
                        "id": "600458.SH"
                    },
                    {
                        "name": "六国化工",
                        "scale": 3.844192E+9,
                        "id": "600470.SH"
                    },
                    {
                        "name": "扬农化工",
                        "scale": 36202390316,
                        "id": "600486.SH"
                    },
                    {
                        "name": "中化国际",
                        "scale": 20163197153,
                        "id": "600500.SH"
                    },
                    {
                        "name": "ST榕泰",
                        "scale": 1492550556,
                        "id": "600589.SH"
                    },
                    {
                        "name": "新安股份",
                        "scale": 21027915412,
                        "id": "600596.SH"
                    },
                    {
                        "name": "华谊集团",
                        "scale": 14208561302,
                        "id": "600623.SH"
                    },
                    {
                        "name": "阳煤化工",
                        "scale": 9431076229,
                        "id": "600691.SH"
                    },
                    {
                        "name": "鲁北化工",
                        "scale": 3411435967,
                        "id": "600727.SH"
                    },
                    {
                        "name": "湖南海利",
                        "scale": 4186150194,
                        "id": "600731.SH"
                    },
                    {
                        "name": "江苏索普",
                        "scale": 4606339992,
                        "id": "600746.SH"
                    },
                    {
                        "name": "丹化科技",
                        "scale": 2657419948,
                        "id": "600844.SH"
                    },
                    {
                        "name": "维远股份",
                        "scale": 3.895375E+9,
                        "id": "600955.SH"
                    },
                    {
                        "name": "宏昌电子",
                        "scale": 3975243699,
                        "id": "603002.SH"
                    },
                    {
                        "name": "万盛股份",
                        "scale": 8370953282,
                        "id": "603010.SH"
                    },
                    {
                        "name": "石大胜华",
                        "scale": 2.817252E+10,
                        "id": "603026.SH"
                    },
                    {
                        "name": "美思德",
                        "scale": 1880785914,
                        "id": "603041.SH"
                    },
                    {
                        "name": "江化微",
                        "scale": 7113008451,
                        "id": "603078.SH"
                    },
                    {
                        "name": "先达股份",
                        "scale": 4137677482,
                        "id": "603086.SH"
                    },
                    {
                        "name": "东方材料",
                        "scale": 6936285452,
                        "id": "603110.SH"
                    },
                    {
                        "name": "碳元科技",
                        "scale": 2370068316,
                        "id": "603133.SH"
                    },
                    {
                        "name": "新亚强",
                        "scale": 1917840905,
                        "id": "603155.SH"
                    },
                    {
                        "name": "皇马科技",
                        "scale": 1.0225719E+10,
                        "id": "603181.SH"
                    },
                    {
                        "name": "亚邦股份",
                        "scale": 2.4916429E+9,
                        "id": "603188.SH"
                    },
                    {
                        "name": "汇得科技",
                        "scale": 3682986676,
                        "id": "603192.SH"
                    },
                    {
                        "name": "元利科技",
                        "scale": 3001388014,
                        "id": "603217.SH"
                    },
                    {
                        "name": "雪峰科技",
                        "scale": 7.318157E+9,
                        "id": "603227.SH"
                    },
                    {
                        "name": "宏和科技",
                        "scale": 6.680058E+9,
                        "id": "603256.SH"
                    },
                    {
                        "name": "上海天洋",
                        "scale": 5025670848,
                        "id": "603330.SH"
                    },
                    {
                        "name": "百傲化学",
                        "scale": 4.01740078E+9,
                        "id": "603360.SH"
                    },
                    {
                        "name": "亚士创能",
                        "scale": 4251678689,
                        "id": "603378.SH"
                    },
                    {
                        "name": "三美股份",
                        "scale": 18167856141,
                        "id": "603379.SH"
                    },
                    {
                        "name": "苏利股份",
                        "scale": 3.8772E+9,
                        "id": "603585.SH"
                    },
                    {
                        "name": "广信股份",
                        "scale": 17413424099,
                        "id": "603599.SH"
                    },
                    {
                        "name": "再升科技",
                        "scale": 6863110636,
                        "id": "603601.SH"
                    },
                    {
                        "name": "珀莱雅",
                        "scale": 48524588469,
                        "id": "603605.SH"
                    },
                    {
                        "name": "拉芳家化",
                        "scale": 3045635606,
                        "id": "603630.SH"
                    },
                    {
                        "name": "海利尔",
                        "scale": 8819941756,
                        "id": "603639.SH"
                    },
                    {
                        "name": "彤程新材",
                        "scale": 22378395137,
                        "id": "603650.SH"
                    },
                    {
                        "name": "永冠新材",
                        "scale": 5670823273,
                        "id": "603681.SH"
                    },
                    {
                        "name": "晶华新材",
                        "scale": 1964764494,
                        "id": "603683.SH"
                    },
                    {
                        "name": "阿科力",
                        "scale": 4377950415,
                        "id": "603722.SH"
                    },
                    {
                        "name": "天安新材",
                        "scale": 1.56478224E+9,
                        "id": "603725.SH"
                    },
                    {
                        "name": "三棵树",
                        "scale": 3.549805493E+10,
                        "id": "603737.SH"
                    },
                    {
                        "name": "雅运股份",
                        "scale": 2.1068736E+9,
                        "id": "603790.SH"
                    },
                    {
                        "name": "丰山集团",
                        "scale": 2375009965,
                        "id": "603810.SH"
                    },
                    {
                        "name": "嘉澳环保",
                        "scale": 4505083785,
                        "id": "603822.SH"
                    },
                    {
                        "name": "百合花",
                        "scale": 5556863606,
                        "id": "603823.SH"
                    },
                    {
                        "name": "新化股份",
                        "scale": 6262457429,
                        "id": "603867.SH"
                    },
                    {
                        "name": "永悦科技",
                        "scale": 2450729081,
                        "id": "603879.SH"
                    },
                    {
                        "name": "苏博特",
                        "scale": 9.2205419E+9,
                        "id": "603916.SH"
                    },
                    {
                        "name": "建业股份",
                        "scale": 2085718618,
                        "id": "603948.SH"
                    },
                    {
                        "name": "雪龙集团",
                        "scale": 1.5160362E+9,
                        "id": "603949.SH"
                    },
                    {
                        "name": "醋化股份",
                        "scale": 4.8339072E+9,
                        "id": "603968.SH"
                    },
                    {
                        "name": "中农立华",
                        "scale": 2918138933,
                        "id": "603970.SH"
                    },
                    {
                        "name": "国泰集团",
                        "scale": 5223953096,
                        "id": "603977.SH"
                    },
                    {
                        "name": "吉华集团",
                        "scale": 3.738E+9,
                        "id": "603980.SH"
                    },
                    {
                        "name": "丸美股份",
                        "scale": 1.93809E+9,
                        "id": "603983.SH"
                    },
                    {
                        "name": "山东玻纤",
                        "scale": 2895177811,
                        "id": "605006.SH"
                    },
                    {
                        "name": "永和股份",
                        "scale": 3.9388E+9,
                        "id": "605020.SH"
                    },
                    {
                        "name": "西大门",
                        "scale": 7.0770707E+8,
                        "id": "605155.SH"
                    },
                    {
                        "name": "宏柏新材",
                        "scale": 4805470827,
                        "id": "605366.SH"
                    },
                    {
                        "name": "晨光新材",
                        "scale": 3713992329,
                        "id": "605399.SH"
                    },
                    {
                        "name": "圣泉集团",
                        "scale": 1.323935813E+10,
                        "id": "605589.SH"
                    },
                    {
                        "name": "容百科技",
                        "scale": 33846583318,
                        "id": "688005.SH"
                    },
                    {
                        "name": "奥福环保",
                        "scale": 1321536764,
                        "id": "688021.SH"
                    },
                    {
                        "name": "凯赛生物",
                        "scale": 19022030141,
                        "id": "688065.SH"
                    },
                    {
                        "name": "金宏气体",
                        "scale": 5768190792,
                        "id": "688106.SH"
                    },
                    {
                        "name": "天奈科技",
                        "scale": 25061244384,
                        "id": "688116.SH"
                    },
                    {
                        "name": "东来技术",
                        "scale": 630118655,
                        "id": "688129.SH"
                    },
                    {
                        "name": "泰坦科技",
                        "scale": 6921063083,
                        "id": "688133.SH"
                    },
                    {
                        "name": "芳源股份",
                        "scale": 8.28695016E+9,
                        "id": "688148.SH"
                    },
                    {
                        "name": "松井股份",
                        "scale": 4080207642,
                        "id": "688157.SH"
                    },
                    {
                        "name": "阿拉丁",
                        "scale": 3552299289,
                        "id": "688179.SH"
                    },
                    {
                        "name": "卓越新能",
                        "scale": 2.7684E+9,
                        "id": "688196.SH"
                    },
                    {
                        "name": "久日新材",
                        "scale": 3922639684,
                        "id": "688199.SH"
                    },
                    {
                        "name": "中触媒",
                        "scale": 1281177661,
                        "id": "688267.SH"
                    },
                    {
                        "name": "华特气体",
                        "scale": 3213591828,
                        "id": "688268.SH"
                    },
                    {
                        "name": "凯立新材",
                        "scale": 5287626365,
                        "id": "688269.SH"
                    },
                    {
                        "name": "富淼科技",
                        "scale": 1210846513,
                        "id": "688350.SH"
                    },
                    {
                        "name": "建龙微纳",
                        "scale": 3445466269,
                        "id": "688357.SH"
                    },
                    {
                        "name": "三孚新科",
                        "scale": 2834872437,
                        "id": "688359.SH"
                    },
                    {
                        "name": "赛特新材",
                        "scale": 1.210733E+9,
                        "id": "688398.SH"
                    },
                    {
                        "name": "瑞联新材",
                        "scale": 5447978414,
                        "id": "688550.SH"
                    },
                    {
                        "name": "杭华股份",
                        "scale": 1.40621458E+9,
                        "id": "688571.SH"
                    },
                    {
                        "name": "上纬新材",
                        "scale": 894999531,
                        "id": "688585.SH"
                    },
                    {
                        "name": "呈和科技",
                        "scale": 3.71747758E+9,
                        "id": "688625.SH"
                    },
                    {
                        "name": "华恒生物",
                        "scale": 8761453983,
                        "id": "688639.SH"
                    },
                    {
                        "name": "元琛科技",
                        "scale": 1128745134,
                        "id": "688659.SH"
                    },
                    {
                        "name": "振华新材",
                        "scale": 4747707571,
                        "id": "688707.SH"
                    },
                    {
                        "name": "唯赛勃",
                        "scale": 1043231076,
                        "id": "688718.SH"
                    },
                    {
                        "name": "壹石通",
                        "scale": 2.88993667E+9,
                        "id": "688733.SH"
                    },
                    {
                        "name": "厦钨新能",
                        "scale": 11968836292,
                        "id": "688778.SH"
                    },
                    {
                        "name": "长远锂科",
                        "scale": 18853089716,
                        "id": "688779.SH"
                    },
                    {
                        "name": "颖泰生物",
                        "scale": 6.7168692E+9,
                        "id": "833819.BJ"
                    }
                ],
                "name": "化学制品",
                "scale": 3239208414547,
                "id": "220300"
            },
            {
                "children": [
                    {
                        "name": "东方盛虹",
                        "scale": 112316923977,
                        "id": "000301.SZ"
                    },
                    {
                        "name": "吉林化纤",
                        "scale": 10359584328,
                        "id": "000420.SZ"
                    },
                    {
                        "name": "恒天海龙",
                        "scale": 2790648772,
                        "id": "000677.SZ"
                    },
                    {
                        "name": "恒逸石化",
                        "scale": 35231074969,
                        "id": "000703.SZ"
                    },
                    {
                        "name": "美达股份",
                        "scale": 2788577209,
                        "id": "000782.SZ"
                    },
                    {
                        "name": "华西股份",
                        "scale": 6005535102,
                        "id": "000936.SZ"
                    },
                    {
                        "name": "新乡化纤",
                        "scale": 5009666939,
                        "id": "000949.SZ"
                    },
                    {
                        "name": "华峰化学",
                        "scale": 15992837333,
                        "id": "002064.SZ"
                    },
                    {
                        "name": "澳洋健康",
                        "scale": 3286075864,
                        "id": "002172.SZ"
                    },
                    {
                        "name": "海 利 得",
                        "scale": 6725018613,
                        "id": "002206.SZ"
                    },
                    {
                        "name": "泰和新材",
                        "scale": 7552520368,
                        "id": "002254.SZ"
                    },
                    {
                        "name": "*ST尤夫",
                        "scale": 3762827138,
                        "id": "002427.SZ"
                    },
                    {
                        "name": "荣盛石化",
                        "scale": 154916967188,
                        "id": "002493.SZ"
                    },
                    {
                        "name": "优彩资源",
                        "scale": 1184168806,
                        "id": "002998.SZ"
                    },
                    {
                        "name": "光威复材",
                        "scale": 37467944504,
                        "id": "300699.SZ"
                    },
                    {
                        "name": "中简科技",
                        "scale": 1.91164779E+10,
                        "id": "300777.SZ"
                    },
                    {
                        "name": "蒙泰高新",
                        "scale": 7.779504E+8,
                        "id": "300876.SZ"
                    },
                    {
                        "name": "皖维高新",
                        "scale": 18103410105,
                        "id": "600063.SH"
                    },
                    {
                        "name": "恒力石化",
                        "scale": 149510479455,
                        "id": "600346.SH"
                    },
                    {
                        "name": "江南高纤",
                        "scale": 3861826811,
                        "id": "600527.SH"
                    },
                    {
                        "name": "神马股份",
                        "scale": 6804717241,
                        "id": "600810.SH"
                    },
                    {
                        "name": "南京化纤",
                        "scale": 1868364651,
                        "id": "600889.SH"
                    },
                    {
                        "name": "桐昆股份",
                        "scale": 36142990385,
                        "id": "601233.SH"
                    },
                    {
                        "name": "新凤鸣",
                        "scale": 15840680751,
                        "id": "603225.SH"
                    },
                    {
                        "name": "苏州龙杰",
                        "scale": 2.14802028E+9,
                        "id": "603332.SH"
                    },
                    {
                        "name": "聚合顺",
                        "scale": 2673372846,
                        "id": "605166.SH"
                    },
                    {
                        "name": "同益中",
                        "scale": 7.5263378E+8,
                        "id": "688722.SH"
                    },
                    {
                        "name": "吉林碳谷",
                        "scale": 5429247151,
                        "id": "836077.BJ"
                    }
                ],
                "name": "化学纤维",
                "scale": 668420542866,
                "id": "220400"
            },
            {
                "children": [
                    {
                        "name": "国风新材",
                        "scale": 6360563549,
                        "id": "000859.SZ"
                    },
                    {
                        "name": "佛塑科技",
                        "scale": 4875695839,
                        "id": "000973.SZ"
                    },
                    {
                        "name": "沧州明珠",
                        "scale": 8635158372,
                        "id": "002108.SZ"
                    },
                    {
                        "name": "大东南",
                        "scale": 6405146561,
                        "id": "002263.SZ"
                    },
                    {
                        "name": "普利特",
                        "scale": 1.149368774E+10,
                        "id": "002324.SZ"
                    },
                    {
                        "name": "双象股份",
                        "scale": 2.42729145E+9,
                        "id": "002395.SZ"
                    },
                    {
                        "name": "国恩股份",
                        "scale": 4851736031,
                        "id": "002768.SZ"
                    },
                    {
                        "name": "纳尔股份",
                        "scale": 2398859399,
                        "id": "002825.SZ"
                    },
                    {
                        "name": "道恩股份",
                        "scale": 9.46726033E+9,
                        "id": "002838.SZ"
                    },
                    {
                        "name": "沃特股份",
                        "scale": 4610143041,
                        "id": "002886.SZ"
                    },
                    {
                        "name": "华峰超纤",
                        "scale": 6433692701,
                        "id": "300180.SZ"
                    },
                    {
                        "name": "安利股份",
                        "scale": 2782128624,
                        "id": "300218.SZ"
                    },
                    {
                        "name": "银禧科技",
                        "scale": 2.47533489E+9,
                        "id": "300221.SZ"
                    },
                    {
                        "name": "永利股份",
                        "scale": 2569229302,
                        "id": "300230.SZ"
                    },
                    {
                        "name": "裕兴股份",
                        "scale": 3982031861,
                        "id": "300305.SZ"
                    },
                    {
                        "name": "同大股份",
                        "scale": 1488302777,
                        "id": "300321.SZ"
                    },
                    {
                        "name": "杭州高新",
                        "scale": 1.36438115E+9,
                        "id": "300478.SZ"
                    },
                    {
                        "name": "同益股份",
                        "scale": 1614151411,
                        "id": "300538.SZ"
                    },
                    {
                        "name": "横河精密",
                        "scale": 1876583557,
                        "id": "300539.SZ"
                    },
                    {
                        "name": "美联新材",
                        "scale": 8900272394,
                        "id": "300586.SZ"
                    },
                    {
                        "name": "南京聚隆",
                        "scale": 1463647031,
                        "id": "300644.SZ"
                    },
                    {
                        "name": "国立科技",
                        "scale": 1.5953994E+9,
                        "id": "300716.SZ"
                    },
                    {
                        "name": "华信新材",
                        "scale": 1503356184,
                        "id": "300717.SZ"
                    },
                    {
                        "name": "宝丽迪",
                        "scale": 944060393,
                        "id": "300905.SZ"
                    },
                    {
                        "name": "润阳科技",
                        "scale": 1088710255,
                        "id": "300920.SZ"
                    },
                    {
                        "name": "祥源新材",
                        "scale": 1333965997,
                        "id": "300980.SZ"
                    },
                    {
                        "name": "奇德新材",
                        "scale": 7.477868E+8,
                        "id": "300995.SZ"
                    },
                    {
                        "name": "江苏博云",
                        "scale": 1394468209,
                        "id": "301003.SZ"
                    },
                    {
                        "name": "宁波色母",
                        "scale": 1704313779,
                        "id": "301019.SZ"
                    },
                    {
                        "name": "金发科技",
                        "scale": 26148003005,
                        "id": "600143.SH"
                    },
                    {
                        "name": "东材科技",
                        "scale": 11468022725,
                        "id": "601208.SH"
                    },
                    {
                        "name": "天龙股份",
                        "scale": 3172243663,
                        "id": "603266.SH"
                    },
                    {
                        "name": "艾艾精工",
                        "scale": 1490981212,
                        "id": "603580.SH"
                    },
                    {
                        "name": "茶花股份",
                        "scale": 1.8644322E+9,
                        "id": "603615.SH"
                    },
                    {
                        "name": "至正股份",
                        "scale": 3052953518,
                        "id": "603991.SH"
                    },
                    {
                        "name": "长鸿高科",
                        "scale": 3.65202576E+9,
                        "id": "605008.SH"
                    },
                    {
                        "name": "福莱新材",
                        "scale": 6.63375E+8,
                        "id": "605488.SH"
                    },
                    {
                        "name": "英科再生",
                        "scale": 3853798343,
                        "id": "688087.SH"
                    },
                    {
                        "name": "XD会通股",
                        "scale": 2676780259,
                        "id": "688219.SH"
                    },
                    {
                        "name": "瑞华泰",
                        "scale": 2979097118,
                        "id": "688323.SH"
                    },
                    {
                        "name": "聚石化学",
                        "scale": 1274051973,
                        "id": "688669.SH"
                    },
                    {
                        "name": "禾昌聚合",
                        "scale": 463253498,
                        "id": "832089.BJ"
                    },
                    {
                        "name": "方大股份",
                        "scale": 337295709,
                        "id": "838163.BJ"
                    }
                ],
                "name": "塑料",
                "scale": 1.6988367301E+11,
                "id": "220500"
            },
            {
                "children": [
                    {
                        "name": "贵州轮胎",
                        "scale": 5066485917,
                        "id": "000589.SZ"
                    },
                    {
                        "name": "青岛双星",
                        "scale": 3422159275,
                        "id": "000599.SZ"
                    },
                    {
                        "name": "联科科技",
                        "scale": 1.28519464E+9,
                        "id": "001207.SZ"
                    },
                    {
                        "name": "黑猫股份",
                        "scale": 14096653049,
                        "id": "002068.SZ"
                    },
                    {
                        "name": "三 力 士",
                        "scale": 2708312275,
                        "id": "002224.SZ"
                    },
                    {
                        "name": "双箭股份",
                        "scale": 2150999038,
                        "id": "002381.SZ"
                    },
                    {
                        "name": "龙星化工",
                        "scale": 2805504912,
                        "id": "002442.SZ"
                    },
                    {
                        "name": "永东股份",
                        "scale": 2874232431,
                        "id": "002753.SZ"
                    },
                    {
                        "name": "森麒麟",
                        "scale": 10678704275,
                        "id": "002984.SZ"
                    },
                    {
                        "name": "阳谷华泰",
                        "scale": 4655834865,
                        "id": "300121.SZ"
                    },
                    {
                        "name": "海达股份",
                        "scale": 6431250249,
                        "id": "300320.SZ"
                    },
                    {
                        "name": "天铁股份",
                        "scale": 1.322567607E+10,
                        "id": "300587.SZ"
                    },
                    {
                        "name": "科创新源",
                        "scale": 2697213817,
                        "id": "300731.SZ"
                    },
                    {
                        "name": "震安科技",
                        "scale": 12755693758,
                        "id": "300767.SZ"
                    },
                    {
                        "name": "S*ST佳通",
                        "scale": 2.5041E+9,
                        "id": "600182.SH"
                    },
                    {
                        "name": "风神股份",
                        "scale": 2.96391768E+9,
                        "id": "600469.SH"
                    },
                    {
                        "name": "赛轮轮胎",
                        "scale": 32298893704,
                        "id": "601058.SH"
                    },
                    {
                        "name": "三角轮胎",
                        "scale": 9.528E+9,
                        "id": "601163.SH"
                    },
                    {
                        "name": "通用股份",
                        "scale": 5.22723124E+9,
                        "id": "601500.SH"
                    },
                    {
                        "name": "玲珑轮胎",
                        "scale": 35028860621,
                        "id": "601966.SH"
                    },
                    {
                        "name": "三维股份",
                        "scale": 15900977397,
                        "id": "603033.SH"
                    },
                    {
                        "name": "确成股份",
                        "scale": 2803111615,
                        "id": "605183.SH"
                    },
                    {
                        "name": "利通科技",
                        "scale": 316440059,
                        "id": "832225.BJ"
                    },
                    {
                        "name": "通易航天",
                        "scale": 424848497,
                        "id": "871642.BJ"
                    }
                ],
                "name": "橡胶",
                "scale": 191850295384,
                "id": "220600"
            }
        ],
        "name": "化工",
        "scale": 5320645763807,
        "id": "220000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "中信特钢",
                        "scale": 26643744113,
                        "id": "000708.SZ"
                    },
                    {
                        "name": "河钢股份",
                        "scale": 27497751837,
                        "id": "000709.SZ"
                    },
                    {
                        "name": "韶钢松山",
                        "scale": 8240668706,
                        "id": "000717.SZ"
                    },
                    {
                        "name": "本钢板材",
                        "scale": 12830403507,
                        "id": "000761.SZ"
                    },
                    {
                        "name": "新兴铸管",
                        "scale": 16519844981,
                        "id": "000778.SZ"
                    },
                    {
                        "name": "太钢不锈",
                        "scale": 28708727373,
                        "id": "000825.SZ"
                    },
                    {
                        "name": "鞍钢股份",
                        "scale": 23823758157,
                        "id": "000898.SZ"
                    },
                    {
                        "name": "华菱钢铁",
                        "scale": 26531257566,
                        "id": "000932.SZ"
                    },
                    {
                        "name": "首钢股份",
                        "scale": 25266918748,
                        "id": "000959.SZ"
                    },
                    {
                        "name": "沙钢股份",
                        "scale": 9842202103,
                        "id": "002075.SZ"
                    },
                    {
                        "name": "三钢闽光",
                        "scale": 13630763883,
                        "id": "002110.SZ"
                    },
                    {
                        "name": "久立特材",
                        "scale": 17674257787,
                        "id": "002318.SZ"
                    },
                    {
                        "name": "金洲管道",
                        "scale": 3742982925,
                        "id": "002443.SZ"
                    },
                    {
                        "name": "常宝股份",
                        "scale": 3.11339253E+9,
                        "id": "002478.SZ"
                    },
                    {
                        "name": "永兴材料",
                        "scale": 41833955433,
                        "id": "002756.SZ"
                    },
                    {
                        "name": "盛德鑫泰",
                        "scale": 6.28E+8,
                        "id": "300881.SZ"
                    },
                    {
                        "name": "包钢股份",
                        "scale": 69373093376,
                        "id": "600010.SH"
                    },
                    {
                        "name": "宝钢股份",
                        "scale": 117488883511,
                        "id": "600019.SH"
                    },
                    {
                        "name": "山东钢铁",
                        "scale": 17623944882,
                        "id": "600022.SH"
                    },
                    {
                        "name": "西宁特钢",
                        "scale": 3908742262,
                        "id": "600117.SH"
                    },
                    {
                        "name": "杭钢股份",
                        "scale": 15906560581,
                        "id": "600126.SH"
                    },
                    {
                        "name": "凌钢股份",
                        "scale": 6.93073501E+9,
                        "id": "600231.SH"
                    },
                    {
                        "name": "南钢股份",
                        "scale": 13662259658,
                        "id": "600282.SH"
                    },
                    {
                        "name": "酒钢宏兴",
                        "scale": 11274043363,
                        "id": "600307.SH"
                    },
                    {
                        "name": "抚顺特钢",
                        "scale": 3.2855186E+10,
                        "id": "600399.SH"
                    },
                    {
                        "name": "方大特钢",
                        "scale": 14703580521,
                        "id": "600507.SH"
                    },
                    {
                        "name": "安阳钢铁",
                        "scale": 6951259754,
                        "id": "600569.SH"
                    },
                    {
                        "name": "八一钢铁",
                        "scale": 7143304074,
                        "id": "600581.SH"
                    },
                    {
                        "name": "新钢股份",
                        "scale": 14859447763,
                        "id": "600782.SH"
                    },
                    {
                        "name": "马钢股份",
                        "scale": 18500028677,
                        "id": "600808.SH"
                    },
                    {
                        "name": "柳钢股份",
                        "scale": 9687358296,
                        "id": "601003.SH"
                    },
                    {
                        "name": "重庆钢铁",
                        "scale": 14665831367,
                        "id": "601005.SH"
                    },
                    {
                        "name": "友发集团",
                        "scale": 3.9119882E+9,
                        "id": "601686.SH"
                    },
                    {
                        "name": "武进不锈",
                        "scale": 2889471294,
                        "id": "603878.SH"
                    },
                    {
                        "name": "甬金股份",
                        "scale": 6681726329,
                        "id": "603995.SH"
                    },
                    {
                        "name": "广大特材",
                        "scale": 5.0944597E+9,
                        "id": "688186.SH"
                    }
                ],
                "name": "钢铁",
                "scale": 680640534267,
                "id": "230100"
            }
        ],
        "name": "钢铁",
        "scale": 680640534267,
        "id": "230000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "合金投资",
                        "scale": 3308019935,
                        "id": "000633.SZ"
                    },
                    {
                        "name": "英洛华",
                        "scale": 9126157029,
                        "id": "000795.SZ"
                    },
                    {
                        "name": "东方钽业",
                        "scale": 4725708963,
                        "id": "000962.SZ"
                    },
                    {
                        "name": "安泰科技",
                        "scale": 10339339712,
                        "id": "000969.SZ"
                    },
                    {
                        "name": "中科三环",
                        "scale": 21822277625,
                        "id": "000970.SZ"
                    },
                    {
                        "name": "中旗新材",
                        "scale": 1.07186027E+9,
                        "id": "001212.SZ"
                    },
                    {
                        "name": "华瓷股份",
                        "scale": 913646817,
                        "id": "001216.SZ"
                    },
                    {
                        "name": "长江材料",
                        "scale": 6.3822135E+8,
                        "id": "001296.SZ"
                    },
                    {
                        "name": "横店东磁",
                        "scale": 37183838521,
                        "id": "002056.SZ"
                    },
                    {
                        "name": "中钢天源",
                        "scale": 9043795845,
                        "id": "002057.SZ"
                    },
                    {
                        "name": "沃尔核材",
                        "scale": 8198616802,
                        "id": "002130.SZ"
                    },
                    {
                        "name": "云海金属",
                        "scale": 1.362329149E+10,
                        "id": "002182.SZ"
                    },
                    {
                        "name": "格林美",
                        "scale": 46301782951,
                        "id": "002340.SZ"
                    },
                    {
                        "name": "银河磁体",
                        "scale": 4277846771,
                        "id": "300127.SZ"
                    },
                    {
                        "name": "正海磁材",
                        "scale": 1.322897888E+10,
                        "id": "300224.SZ"
                    },
                    {
                        "name": "菲利华",
                        "scale": 26549447656,
                        "id": "300395.SZ"
                    },
                    {
                        "name": "光智科技",
                        "scale": 2.41593465E+9,
                        "id": "300489.SZ"
                    },
                    {
                        "name": "金力永磁",
                        "scale": 29936724365,
                        "id": "300748.SZ"
                    },
                    {
                        "name": "铂科新材",
                        "scale": 4771614766,
                        "id": "300811.SZ"
                    },
                    {
                        "name": "龙磁科技",
                        "scale": 2436276052,
                        "id": "300835.SZ"
                    },
                    {
                        "name": "图南股份",
                        "scale": 8255826394,
                        "id": "300855.SZ"
                    },
                    {
                        "name": "屹通新材",
                        "scale": 1.103595E+9,
                        "id": "300930.SZ"
                    },
                    {
                        "name": "中洲特材",
                        "scale": 1496802889,
                        "id": "300963.SZ"
                    },
                    {
                        "name": "力量钻石",
                        "scale": 7.06291794E+9,
                        "id": "301071.SZ"
                    },
                    {
                        "name": "喜悦智行",
                        "scale": 7.2605E+8,
                        "id": "301198.SZ"
                    },
                    {
                        "name": "东睦股份",
                        "scale": 6404224326,
                        "id": "600114.SH"
                    },
                    {
                        "name": "有研新材",
                        "scale": 15034787176,
                        "id": "600206.SH"
                    },
                    {
                        "name": "天通股份",
                        "scale": 14121336394,
                        "id": "600330.SH"
                    },
                    {
                        "name": "宁波韵升",
                        "scale": 14065197113,
                        "id": "600366.SH"
                    },
                    {
                        "name": "方大炭素",
                        "scale": 26984329909,
                        "id": "600516.SH"
                    },
                    {
                        "name": "*ST丰华",
                        "scale": 1461594917,
                        "id": "600615.SH"
                    },
                    {
                        "name": "北矿科技",
                        "scale": 2595178454,
                        "id": "600980.SH"
                    },
                    {
                        "name": "福达合金",
                        "scale": 2.2555918E+9,
                        "id": "603045.SH"
                    },
                    {
                        "name": "合盛硅业",
                        "scale": 1.281308E+11,
                        "id": "603260.SH"
                    },
                    {
                        "name": "索通发展",
                        "scale": 13891532843,
                        "id": "603612.SH"
                    },
                    {
                        "name": "石英股份",
                        "scale": 4.969935312E+10,
                        "id": "603688.SH"
                    },
                    {
                        "name": "坤彩科技",
                        "scale": 2.89692E+10,
                        "id": "603826.SH"
                    },
                    {
                        "name": "深圳新星",
                        "scale": 4.72265758E+9,
                        "id": "603978.SH"
                    },
                    {
                        "name": "大地熊",
                        "scale": 3.8298252E+9,
                        "id": "688077.SH"
                    },
                    {
                        "name": "西部超导",
                        "scale": 50460369543,
                        "id": "688122.SH"
                    },
                    {
                        "name": "云路股份",
                        "scale": 2486942089,
                        "id": "688190.SH"
                    },
                    {
                        "name": "联瑞新材",
                        "scale": 5119896938,
                        "id": "688300.SH"
                    },
                    {
                        "name": "金博股份",
                        "scale": 23344075658,
                        "id": "688598.SH"
                    },
                    {
                        "name": "悦安新材",
                        "scale": 1103713574,
                        "id": "688786.SH"
                    },
                    {
                        "name": "贝特瑞",
                        "scale": 46846891735,
                        "id": "835185.BJ"
                    },
                    {
                        "name": "秉扬科技",
                        "scale": 413728971,
                        "id": "836675.BJ"
                    }
                ],
                "name": "金属非金属新材料",
                "scale": 710499800013,
                "id": "240200"
            },
            {
                "children": [
                    {
                        "name": "中金岭南",
                        "scale": 16743029417,
                        "id": "000060.SZ"
                    },
                    {
                        "name": "兴业矿业",
                        "scale": 10873272324,
                        "id": "000426.SZ"
                    },
                    {
                        "name": "盛达资源",
                        "scale": 7136373794,
                        "id": "000603.SZ"
                    },
                    {
                        "name": "焦作万方",
                        "scale": 7607164925,
                        "id": "000612.SZ"
                    },
                    {
                        "name": "铜陵有色",
                        "scale": 3.284234513E+10,
                        "id": "000630.SZ"
                    },
                    {
                        "name": "国城矿业",
                        "scale": 21381342516,
                        "id": "000688.SZ"
                    },
                    {
                        "name": "锌业股份",
                        "scale": 4.97683679E+9,
                        "id": "000751.SZ"
                    },
                    {
                        "name": "中色股份",
                        "scale": 9649712561,
                        "id": "000758.SZ"
                    },
                    {
                        "name": "云铝股份",
                        "scale": 32703799424,
                        "id": "000807.SZ"
                    },
                    {
                        "name": "云南铜业",
                        "scale": 20157217052,
                        "id": "000878.SZ"
                    },
                    {
                        "name": "神火股份",
                        "scale": 37689364619,
                        "id": "000933.SZ"
                    },
                    {
                        "name": "罗平锌电",
                        "scale": 2519214511,
                        "id": "002114.SZ"
                    },
                    {
                        "name": "常铝股份",
                        "scale": 4413948428,
                        "id": "002160.SZ"
                    },
                    {
                        "name": "楚江新材",
                        "scale": 13253686372,
                        "id": "002171.SZ"
                    },
                    {
                        "name": "海亮股份",
                        "scale": 22606332389,
                        "id": "002203.SZ"
                    },
                    {
                        "name": "精艺股份",
                        "scale": 1911447306,
                        "id": "002295.SZ"
                    },
                    {
                        "name": "宏创控股",
                        "scale": 4122464314,
                        "id": "002379.SZ"
                    },
                    {
                        "name": "利源精制",
                        "scale": 7877428356,
                        "id": "002501.SZ"
                    },
                    {
                        "name": "亚太科技",
                        "scale": 5764180688,
                        "id": "002540.SZ"
                    },
                    {
                        "name": "闽发铝业",
                        "scale": 4526855354,
                        "id": "002578.SZ"
                    },
                    {
                        "name": "华锋股份",
                        "scale": 1.944421E+9,
                        "id": "002806.SZ"
                    },
                    {
                        "name": "和胜股份",
                        "scale": 5746100699,
                        "id": "002824.SZ"
                    },
                    {
                        "name": "豪美新材",
                        "scale": 1356773873,
                        "id": "002988.SZ"
                    },
                    {
                        "name": "顺博合金",
                        "scale": 2410175548,
                        "id": "002996.SZ"
                    },
                    {
                        "name": "鑫铂股份",
                        "scale": 2820036584,
                        "id": "003038.SZ"
                    },
                    {
                        "name": "宜安科技",
                        "scale": 6848231805,
                        "id": "300328.SZ"
                    },
                    {
                        "name": "银邦股份",
                        "scale": 9798083587,
                        "id": "300337.SZ"
                    },
                    {
                        "name": "电工合金",
                        "scale": 1644442527,
                        "id": "300697.SZ"
                    },
                    {
                        "name": "锐新科技",
                        "scale": 1549214172,
                        "id": "300828.SZ"
                    },
                    {
                        "name": "志特新材",
                        "scale": 2520235188,
                        "id": "300986.SZ"
                    },
                    {
                        "name": "南山铝业",
                        "scale": 43858267178,
                        "id": "600219.SH"
                    },
                    {
                        "name": "鑫科材料",
                        "scale": 5251836822,
                        "id": "600255.SH"
                    },
                    {
                        "name": "宏达股份",
                        "scale": 6.46176E+9,
                        "id": "600331.SH"
                    },
                    {
                        "name": "西藏珠峰",
                        "scale": 27517726057,
                        "id": "600338.SH"
                    },
                    {
                        "name": "江西铜业",
                        "scale": 36005542477,
                        "id": "600362.SH"
                    },
                    {
                        "name": "鹏欣资源",
                        "scale": 7751297192,
                        "id": "600490.SH"
                    },
                    {
                        "name": "驰宏锌锗",
                        "scale": 28918536106,
                        "id": "600497.SH"
                    },
                    {
                        "name": "豫光金铅",
                        "scale": 5952724782,
                        "id": "600531.SH"
                    },
                    {
                        "name": "中孚实业",
                        "scale": 15885914862,
                        "id": "600595.SH"
                    },
                    {
                        "name": "宁波富邦",
                        "scale": 1385620992,
                        "id": "600768.SH"
                    },
                    {
                        "name": "新疆众和",
                        "scale": 1.353740689E+10,
                        "id": "600888.SH"
                    },
                    {
                        "name": "株冶集团",
                        "scale": 4573060114,
                        "id": "600961.SH"
                    },
                    {
                        "name": "华钰矿业",
                        "scale": 7591323402,
                        "id": "601020.SH"
                    },
                    {
                        "name": "博威合金",
                        "scale": 1.525737284E+10,
                        "id": "601137.SH"
                    },
                    {
                        "name": "西部矿业",
                        "scale": 2.699939E+10,
                        "id": "601168.SH"
                    },
                    {
                        "name": "白银有色",
                        "scale": 21547893827,
                        "id": "601212.SH"
                    },
                    {
                        "name": "怡球资源",
                        "scale": 8570388721,
                        "id": "601388.SH"
                    },
                    {
                        "name": "中国铝业",
                        "scale": 60946774541,
                        "id": "601600.SH"
                    },
                    {
                        "name": "金田股份",
                        "scale": 5015946492,
                        "id": "601609.SH"
                    },
                    {
                        "name": "明泰铝业",
                        "scale": 28366241981,
                        "id": "601677.SH"
                    },
                    {
                        "name": "华峰铝业",
                        "scale": 5.892116E+9,
                        "id": "601702.SH"
                    },
                    {
                        "name": "龙宇燃油",
                        "scale": 3167230298,
                        "id": "603003.SH"
                    },
                    {
                        "name": "海星股份",
                        "scale": 5.64512E+9,
                        "id": "603115.SH"
                    },
                    {
                        "name": "众源新材",
                        "scale": 4.815524E+9,
                        "id": "603527.SH"
                    },
                    {
                        "name": "鼎胜新材",
                        "scale": 30301474318,
                        "id": "603876.SH"
                    },
                    {
                        "name": "永茂泰",
                        "scale": 2.86605297E+9,
                        "id": "605208.SH"
                    },
                    {
                        "name": "有研粉材",
                        "scale": 2120024875,
                        "id": "688456.SH"
                    }
                ],
                "name": "工业金属",
                "scale": 7.3159629899E+11,
                "id": "240300"
            },
            {
                "children": [
                    {
                        "name": "银泰黄金",
                        "scale": 30728051202,
                        "id": "000975.SZ"
                    },
                    {
                        "name": "湖南黄金",
                        "scale": 16128749057,
                        "id": "002155.SZ"
                    },
                    {
                        "name": "恒邦股份",
                        "scale": 9331574057,
                        "id": "002237.SZ"
                    },
                    {
                        "name": "*ST荣华",
                        "scale": 1.058304E+9,
                        "id": "600311.SH"
                    },
                    {
                        "name": "中金黄金",
                        "scale": 3.241457279E+10,
                        "id": "600489.SH"
                    },
                    {
                        "name": "山东黄金",
                        "scale": 68168401524,
                        "id": "600547.SH"
                    },
                    {
                        "name": "*ST园城",
                        "scale": 2328893549,
                        "id": "600766.SH"
                    },
                    {
                        "name": "赤峰黄金",
                        "scale": 3.300515525E+10,
                        "id": "600988.SH"
                    },
                    {
                        "name": "西部黄金",
                        "scale": 9.15204E+9,
                        "id": "601069.SH"
                    },
                    {
                        "name": "紫金矿业",
                        "scale": 188346124272,
                        "id": "601899.SH"
                    }
                ],
                "name": "黄金",
                "scale": 390661865701,
                "id": "240400"
            },
            {
                "children": [
                    {
                        "name": "中钨高新",
                        "scale": 15636958095,
                        "id": "000657.SZ"
                    },
                    {
                        "name": "五矿稀土",
                        "scale": 2.838692711E+10,
                        "id": "000831.SZ"
                    },
                    {
                        "name": "锡业股份",
                        "scale": 26116350331,
                        "id": "000960.SZ"
                    },
                    {
                        "name": "西部材料",
                        "scale": 7346496074,
                        "id": "002149.SZ"
                    },
                    {
                        "name": "东方锆业",
                        "scale": 5067709225,
                        "id": "002167.SZ"
                    },
                    {
                        "name": "章源钨业",
                        "scale": 7863140264,
                        "id": "002378.SZ"
                    },
                    {
                        "name": "云南锗业",
                        "scale": 7902143468,
                        "id": "002428.SZ"
                    },
                    {
                        "name": "赣锋锂业",
                        "scale": 110709159751,
                        "id": "002460.SZ"
                    },
                    {
                        "name": "天齐锂业",
                        "scale": 1.6965158803E+11,
                        "id": "002466.SZ"
                    },
                    {
                        "name": "金贵银业",
                        "scale": 5.87779637E+9,
                        "id": "002716.SZ"
                    },
                    {
                        "name": "中矿资源",
                        "scale": 39167101661,
                        "id": "002738.SZ"
                    },
                    {
                        "name": "翔鹭钨业",
                        "scale": 2130161174,
                        "id": "002842.SZ"
                    },
                    {
                        "name": "寒锐钴业",
                        "scale": 14857403377,
                        "id": "300618.SZ"
                    },
                    {
                        "name": "浩通科技",
                        "scale": 2040307955,
                        "id": "301026.SZ"
                    },
                    {
                        "name": "北方稀土",
                        "scale": 1.19891178E+11,
                        "id": "600111.SH"
                    },
                    {
                        "name": "广晟有色",
                        "scale": 15244033718,
                        "id": "600259.SH"
                    },
                    {
                        "name": "盛和资源",
                        "scale": 35039003134,
                        "id": "600392.SH"
                    },
                    {
                        "name": "宝钛股份",
                        "scale": 26292097971,
                        "id": "600456.SH"
                    },
                    {
                        "name": "贵研铂业",
                        "scale": 10048900529,
                        "id": "600459.SH"
                    },
                    {
                        "name": "厦门钨业",
                        "scale": 39552079606,
                        "id": "600549.SH"
                    },
                    {
                        "name": "盛屯矿业",
                        "scale": 2.189262397E+10,
                        "id": "600711.SH"
                    },
                    {
                        "name": "金钼股份",
                        "scale": 27716531796,
                        "id": "601958.SH"
                    },
                    {
                        "name": "吉翔股份",
                        "scale": 10181335006,
                        "id": "603399.SH"
                    },
                    {
                        "name": "三祥新材",
                        "scale": 5248271991,
                        "id": "603663.SH"
                    },
                    {
                        "name": "华友钴业",
                        "scale": 129823712087,
                        "id": "603799.SH"
                    },
                    {
                        "name": "洛阳钼业",
                        "scale": 9.59091185E+10,
                        "id": "603993.SH"
                    },
                    {
                        "name": "博迁新材",
                        "scale": 9.7501179E+9,
                        "id": "605376.SH"
                    }
                ],
                "name": "稀有金属",
                "scale": 989342247093,
                "id": "240500"
            }
        ],
        "name": "有色金属",
        "scale": 2822100211797,
        "id": "240000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "*ST盈方",
                        "scale": 1354093956,
                        "id": "000670.SZ"
                    },
                    {
                        "name": "紫光国微",
                        "scale": 141398979742,
                        "id": "002049.SZ"
                    },
                    {
                        "name": "大港股份",
                        "scale": 10689224675,
                        "id": "002077.SZ"
                    },
                    {
                        "name": "苏州固锝",
                        "scale": 13607355352,
                        "id": "002079.SZ"
                    },
                    {
                        "name": "康强电子",
                        "scale": 6045432575,
                        "id": "002119.SZ"
                    },
                    {
                        "name": "通富微电",
                        "scale": 30683626495,
                        "id": "002156.SZ"
                    },
                    {
                        "name": "华天科技",
                        "scale": 34215241172,
                        "id": "002185.SZ"
                    },
                    {
                        "name": "北方华创",
                        "scale": 160426768771,
                        "id": "002371.SZ"
                    },
                    {
                        "name": "雅克科技",
                        "scale": 21946217268,
                        "id": "002409.SZ"
                    },
                    {
                        "name": "中晶科技",
                        "scale": 3.05627894E+9,
                        "id": "003026.SZ"
                    },
                    {
                        "name": "台基股份",
                        "scale": 4818144027,
                        "id": "300046.SZ"
                    },
                    {
                        "name": "欧比特",
                        "scale": 5756552656,
                        "id": "300053.SZ"
                    },
                    {
                        "name": "国民技术",
                        "scale": 10723070915,
                        "id": "300077.SZ"
                    },
                    {
                        "name": "晓程科技",
                        "scale": 2260745883,
                        "id": "300139.SZ"
                    },
                    {
                        "name": "北京君正",
                        "scale": 37520700053,
                        "id": "300223.SZ"
                    },
                    {
                        "name": "中颖电子",
                        "scale": 15652930486,
                        "id": "300327.SZ"
                    },
                    {
                        "name": "南大光电",
                        "scale": 18874677365,
                        "id": "300346.SZ"
                    },
                    {
                        "name": "扬杰科技",
                        "scale": 33345420646,
                        "id": "300373.SZ"
                    },
                    {
                        "name": "赛微电子",
                        "scale": 1.069186861E+10,
                        "id": "300456.SZ"
                    },
                    {
                        "name": "全志科技",
                        "scale": 14312958871,
                        "id": "300458.SZ"
                    },
                    {
                        "name": "润欣科技",
                        "scale": 3448701921,
                        "id": "300493.SZ"
                    },
                    {
                        "name": "富瀚微",
                        "scale": 16093103672,
                        "id": "300613.SZ"
                    },
                    {
                        "name": "捷捷微电",
                        "scale": 15363749363,
                        "id": "300623.SZ"
                    },
                    {
                        "name": "圣邦股份",
                        "scale": 5.995957323E+10,
                        "id": "300661.SZ"
                    },
                    {
                        "name": "江丰电子",
                        "scale": 15390737188,
                        "id": "300666.SZ"
                    },
                    {
                        "name": "富满微",
                        "scale": 12778029614,
                        "id": "300671.SZ"
                    },
                    {
                        "name": "国科微",
                        "scale": 12373991014,
                        "id": "300672.SZ"
                    },
                    {
                        "name": "阿石创",
                        "scale": 2624762746,
                        "id": "300706.SZ"
                    },
                    {
                        "name": "卓胜微",
                        "scale": 43770428634,
                        "id": "300782.SZ"
                    },
                    {
                        "name": "派瑞股份",
                        "scale": 2894557726,
                        "id": "300831.SZ"
                    },
                    {
                        "name": "帝科股份",
                        "scale": 5377384421,
                        "id": "300842.SZ"
                    },
                    {
                        "name": "雷电微力",
                        "scale": 3604500092,
                        "id": "301050.SZ"
                    },
                    {
                        "name": "上海贝岭",
                        "scale": 16275606011,
                        "id": "600171.SH"
                    },
                    {
                        "name": "大唐电信",
                        "scale": 6171987692,
                        "id": "600198.SH"
                    },
                    {
                        "name": "华微电子",
                        "scale": 8354569145,
                        "id": "600360.SH"
                    },
                    {
                        "name": "士兰微",
                        "scale": 59390633758,
                        "id": "600460.SH"
                    },
                    {
                        "name": "长电科技",
                        "scale": 5.1607037E+10,
                        "id": "600584.SH"
                    },
                    {
                        "name": "太极实业",
                        "scale": 15964921549,
                        "id": "600667.SH"
                    },
                    {
                        "name": "晶方科技",
                        "scale": 18715123802,
                        "id": "603005.SH"
                    },
                    {
                        "name": "博通集成",
                        "scale": 5391230781,
                        "id": "603068.SH"
                    },
                    {
                        "name": "汇顶科技",
                        "scale": 28684110421,
                        "id": "603160.SH"
                    },
                    {
                        "name": "斯达半导",
                        "scale": 37144584091,
                        "id": "603290.SH"
                    },
                    {
                        "name": "韦尔股份",
                        "scale": 119577959015,
                        "id": "603501.SH"
                    },
                    {
                        "name": "瑞芯微",
                        "scale": 19160597053,
                        "id": "603893.SH"
                    },
                    {
                        "name": "睿能科技",
                        "scale": 2531513656,
                        "id": "603933.SH"
                    },
                    {
                        "name": "兆易创新",
                        "scale": 83988670053,
                        "id": "603986.SH"
                    },
                    {
                        "name": "新洁能",
                        "scale": 17644925088,
                        "id": "605111.SH"
                    },
                    {
                        "name": "立昂微",
                        "scale": 31560243269,
                        "id": "605358.SH"
                    },
                    {
                        "name": "睿创微纳",
                        "scale": 2.360357685E+10,
                        "id": "688002.SH"
                    },
                    {
                        "name": "澜起科技",
                        "scale": 67565947128,
                        "id": "688008.SH"
                    },
                    {
                        "name": "乐鑫科技",
                        "scale": 8873831886,
                        "id": "688018.SH"
                    },
                    {
                        "name": "安集科技",
                        "scale": 19759330796,
                        "id": "688019.SH"
                    },
                    {
                        "name": "炬芯科技",
                        "scale": 1107409453,
                        "id": "688049.SH"
                    },
                    {
                        "name": "盛美上海",
                        "scale": 4521231013,
                        "id": "688082.SH"
                    },
                    {
                        "name": "晶晨股份",
                        "scale": 4.00718664E+10,
                        "id": "688099.SH"
                    },
                    {
                        "name": "安路科技-U",
                        "scale": 3149008602,
                        "id": "688107.SH"
                    },
                    {
                        "name": "东芯股份",
                        "scale": 3304274772,
                        "id": "688110.SH"
                    },
                    {
                        "name": "聚辰股份",
                        "scale": 8452791259,
                        "id": "688123.SH"
                    },
                    {
                        "name": "沪硅产业-U",
                        "scale": 2.96581078E+10,
                        "id": "688126.SH"
                    },
                    {
                        "name": "利扬芯片",
                        "scale": 3105066042,
                        "id": "688135.SH"
                    },
                    {
                        "name": "清溢光电",
                        "scale": 1.816934E+9,
                        "id": "688138.SH"
                    },
                    {
                        "name": "炬光科技",
                        "scale": 3323328514,
                        "id": "688167.SH"
                    },
                    {
                        "name": "希荻微",
                        "scale": 1126305506,
                        "id": "688173.SH"
                    },
                    {
                        "name": "概伦电子",
                        "scale": 1732495951,
                        "id": "688206.SH"
                    },
                    {
                        "name": "气派科技",
                        "scale": 1576117365,
                        "id": "688216.SH"
                    },
                    {
                        "name": "翱捷科技-U",
                        "scale": 2622967085,
                        "id": "688220.SH"
                    },
                    {
                        "name": "芯导科技",
                        "scale": 1456825597,
                        "id": "688230.SH"
                    },
                    {
                        "name": "神工股份",
                        "scale": 4875618369,
                        "id": "688233.SH"
                    },
                    {
                        "name": "天岳先进",
                        "scale": 3409111655,
                        "id": "688234.SH"
                    },
                    {
                        "name": "寒武纪-U",
                        "scale": 16383858884,
                        "id": "688256.SH"
                    },
                    {
                        "name": "创耀科技",
                        "scale": 1450902754,
                        "id": "688259.SH"
                    },
                    {
                        "name": "东微半导",
                        "scale": 3991397196,
                        "id": "688261.SH"
                    },
                    {
                        "name": "国芯科技",
                        "scale": 3061335917,
                        "id": "688262.SH"
                    },
                    {
                        "name": "臻镭科技",
                        "scale": 2157858005,
                        "id": "688270.SH"
                    },
                    {
                        "name": "敏芯股份",
                        "scale": 2189916573,
                        "id": "688286.SH"
                    },
                    {
                        "name": "晶丰明源",
                        "scale": 2434807533,
                        "id": "688368.SH"
                    },
                    {
                        "name": "复旦微电",
                        "scale": 1.998072602E+10,
                        "id": "688385.SH"
                    },
                    {
                        "name": "华润微",
                        "scale": 25032976326,
                        "id": "688396.SH"
                    },
                    {
                        "name": "芯朋微",
                        "scale": 5149199825,
                        "id": "688508.SH"
                    },
                    {
                        "name": "芯原股份-U",
                        "scale": 12921532307,
                        "id": "688521.SH"
                    },
                    {
                        "name": "思瑞浦",
                        "scale": 23698442778,
                        "id": "688536.SH"
                    },
                    {
                        "name": "力合微",
                        "scale": 2391786847,
                        "id": "688589.SH"
                    },
                    {
                        "name": "芯海科技",
                        "scale": 4059483585,
                        "id": "688595.SH"
                    },
                    {
                        "name": "力芯微",
                        "scale": 4.035792E+9,
                        "id": "688601.SH"
                    },
                    {
                        "name": "恒玄科技",
                        "scale": 12249562437,
                        "id": "688608.SH"
                    },
                    {
                        "name": "和林微纳",
                        "scale": 2.19675E+9,
                        "id": "688661.SH"
                    },
                    {
                        "name": "银河微电",
                        "scale": 1.17618195E+9,
                        "id": "688689.SH"
                    },
                    {
                        "name": "明微电子",
                        "scale": 4197070944,
                        "id": "688699.SH"
                    },
                    {
                        "name": "宏微科技",
                        "scale": 2120076096,
                        "id": "688711.SH"
                    },
                    {
                        "name": "格科微",
                        "scale": 3654122732,
                        "id": "688728.SH"
                    },
                    {
                        "name": "普冉股份",
                        "scale": 2051625403,
                        "id": "688766.SH"
                    },
                    {
                        "name": "艾为电子",
                        "scale": 4.052928E+9,
                        "id": "688798.SH"
                    },
                    {
                        "name": "中芯国际",
                        "scale": 8.279175473E+10,
                        "id": "688981.SH"
                    }
                ],
                "name": "半导体",
                "scale": 1771765755348,
                "id": "270100"
            },
            {
                "children": [
                    {
                        "name": "华金资本",
                        "scale": 3978306059,
                        "id": "000532.SZ"
                    },
                    {
                        "name": "风华高科",
                        "scale": 16633431202,
                        "id": "000636.SZ"
                    },
                    {
                        "name": "厦门信达",
                        "scale": 2.61013482E+9,
                        "id": "000701.SZ"
                    },
                    {
                        "name": "振华科技",
                        "scale": 64664290601,
                        "id": "000733.SZ"
                    },
                    {
                        "name": "超声电子",
                        "scale": 5917115287,
                        "id": "000823.SZ"
                    },
                    {
                        "name": "天津普林",
                        "scale": 2.56421308E+9,
                        "id": "002134.SZ"
                    },
                    {
                        "name": "顺络电子",
                        "scale": 20439043922,
                        "id": "002138.SZ"
                    },
                    {
                        "name": "东晶电子",
                        "scale": 2249407434,
                        "id": "002199.SZ"
                    },
                    {
                        "name": "福晶科技",
                        "scale": 7.38402932E+9,
                        "id": "002222.SZ"
                    },
                    {
                        "name": "超华科技",
                        "scale": 5151485735,
                        "id": "002288.SZ"
                    },
                    {
                        "name": "东山精密",
                        "scale": 38260377357,
                        "id": "002384.SZ"
                    },
                    {
                        "name": "兴森科技",
                        "scale": 18766258032,
                        "id": "002436.SZ"
                    },
                    {
                        "name": "沪电股份",
                        "scale": 2.487106799E+10,
                        "id": "002463.SZ"
                    },
                    {
                        "name": "江海股份",
                        "scale": 20246096519,
                        "id": "002484.SZ"
                    },
                    {
                        "name": "中京电子",
                        "scale": 7088869108,
                        "id": "002579.SZ"
                    },
                    {
                        "name": "金安国纪",
                        "scale": 7137068281,
                        "id": "002636.SZ"
                    },
                    {
                        "name": "崇达技术",
                        "scale": 5.78221132E+9,
                        "id": "002815.SZ"
                    },
                    {
                        "name": "奥士康",
                        "scale": 8193830909,
                        "id": "002913.SZ"
                    },
                    {
                        "name": "深南电路",
                        "scale": 45383170781,
                        "id": "002916.SZ"
                    },
                    {
                        "name": "鹏鼎控股",
                        "scale": 73450012979,
                        "id": "002938.SZ"
                    },
                    {
                        "name": "三环集团",
                        "scale": 5.273666163E+10,
                        "id": "300408.SZ"
                    },
                    {
                        "name": "惠伦晶体",
                        "scale": 3791667771,
                        "id": "300460.SZ"
                    },
                    {
                        "name": "胜宏科技",
                        "scale": 15045585675,
                        "id": "300476.SZ"
                    },
                    {
                        "name": "弘信电子",
                        "scale": 7104213547,
                        "id": "300657.SZ"
                    },
                    {
                        "name": "宏达电子",
                        "scale": 11887427149,
                        "id": "300726.SZ"
                    },
                    {
                        "name": "明阳电路",
                        "scale": 4836929968,
                        "id": "300739.SZ"
                    },
                    {
                        "name": "中富电路",
                        "scale": 1.0444896E+9,
                        "id": "300814.SZ"
                    },
                    {
                        "name": "四会富仕",
                        "scale": 1595030725,
                        "id": "300852.SZ"
                    },
                    {
                        "name": "科翔股份",
                        "scale": 2632875739,
                        "id": "300903.SZ"
                    },
                    {
                        "name": "中英科技",
                        "scale": 8.0947695E+8,
                        "id": "300936.SZ"
                    },
                    {
                        "name": "本川智能",
                        "scale": 952884269,
                        "id": "300964.SZ"
                    },
                    {
                        "name": "生益科技",
                        "scale": 39415581844,
                        "id": "600183.SH"
                    },
                    {
                        "name": "铜峰电子",
                        "scale": 4543174998,
                        "id": "600237.SH"
                    },
                    {
                        "name": "法拉电子",
                        "scale": 4.26375E+10,
                        "id": "600563.SH"
                    },
                    {
                        "name": "*ST方科",
                        "scale": 5575023658,
                        "id": "600601.SH"
                    },
                    {
                        "name": "华正新材",
                        "scale": 4105440443,
                        "id": "603186.SH"
                    },
                    {
                        "name": "景旺电子",
                        "scale": 21349875315,
                        "id": "603228.SH"
                    },
                    {
                        "name": "依顿电子",
                        "scale": 7308599913,
                        "id": "603328.SH"
                    },
                    {
                        "name": "骏亚科技",
                        "scale": 4238930054,
                        "id": "603386.SH"
                    },
                    {
                        "name": "泰晶科技",
                        "scale": 8263851883,
                        "id": "603738.SH"
                    },
                    {
                        "name": "世运电路",
                        "scale": 9472717688,
                        "id": "603920.SH"
                    },
                    {
                        "name": "博敏电子",
                        "scale": 8.00755956E+9,
                        "id": "603936.SH"
                    },
                    {
                        "name": "艾华集团",
                        "scale": 11174736168,
                        "id": "603989.SH"
                    },
                    {
                        "name": "澳弘电子",
                        "scale": 915138614,
                        "id": "605058.SH"
                    },
                    {
                        "name": "协和电子",
                        "scale": 1.0815498E+9,
                        "id": "605258.SH"
                    },
                    {
                        "name": "生益电子",
                        "scale": 3740281826,
                        "id": "688183.SH"
                    },
                    {
                        "name": "南亚新材",
                        "scale": 2683453865,
                        "id": "688519.SH"
                    },
                    {
                        "name": "迅捷兴",
                        "scale": 997487394,
                        "id": "688655.SH"
                    }
                ],
                "name": "元件",
                "scale": 658718566782,
                "id": "270200"
            },
            {
                "children": [
                    {
                        "name": "深纺织Ａ",
                        "scale": 3546489548,
                        "id": "000045.SZ"
                    },
                    {
                        "name": "深天马Ａ",
                        "scale": 24280406979,
                        "id": "000050.SZ"
                    },
                    {
                        "name": "TCL科技",
                        "scale": 59840207712,
                        "id": "000100.SZ"
                    },
                    {
                        "name": "东旭光电",
                        "scale": 10068824787,
                        "id": "000413.SZ"
                    },
                    {
                        "name": "华映科技",
                        "scale": 6659028864,
                        "id": "000536.SZ"
                    },
                    {
                        "name": "佛山照明",
                        "scale": 7501157455,
                        "id": "000541.SZ"
                    },
                    {
                        "name": "京东方Ａ",
                        "scale": 144055225055,
                        "id": "000725.SZ"
                    },
                    {
                        "name": "冠捷科技",
                        "scale": 7966787614,
                        "id": "000727.SZ"
                    },
                    {
                        "name": "ST德豪",
                        "scale": 2797108091,
                        "id": "002005.SZ"
                    },
                    {
                        "name": "联创电子",
                        "scale": 18799496516,
                        "id": "002036.SZ"
                    },
                    {
                        "name": "*ST雪莱",
                        "scale": 1825468689,
                        "id": "002076.SZ"
                    },
                    {
                        "name": "莱宝高科",
                        "scale": 6442815651,
                        "id": "002106.SZ"
                    },
                    {
                        "name": "中光学",
                        "scale": 4139342191,
                        "id": "002189.SZ"
                    },
                    {
                        "name": "合力泰",
                        "scale": 9887540136,
                        "id": "002217.SZ"
                    },
                    {
                        "name": "水晶光电",
                        "scale": 18840159707,
                        "id": "002273.SZ"
                    },
                    {
                        "name": "宇顺电子",
                        "scale": 2002630186,
                        "id": "002289.SZ"
                    },
                    {
                        "name": "维信诺",
                        "scale": 9735306624,
                        "id": "002387.SZ"
                    },
                    {
                        "name": "国星光电",
                        "scale": 5695695339,
                        "id": "002449.SZ"
                    },
                    {
                        "name": "欧菲光",
                        "scale": 18318537702,
                        "id": "002456.SZ"
                    },
                    {
                        "name": "奥拓电子",
                        "scale": 2760754778,
                        "id": "002587.SZ"
                    },
                    {
                        "name": "木林森",
                        "scale": 10344444715,
                        "id": "002745.SZ"
                    },
                    {
                        "name": "恒久科技",
                        "scale": 1391544262,
                        "id": "002808.SZ"
                    },
                    {
                        "name": "视源股份",
                        "scale": 31206398716,
                        "id": "002841.SZ"
                    },
                    {
                        "name": "同兴达",
                        "scale": 3760516122,
                        "id": "002845.SZ"
                    },
                    {
                        "name": "三利谱",
                        "scale": 8120204864,
                        "id": "002876.SZ"
                    },
                    {
                        "name": "亚世光电",
                        "scale": 2079697769,
                        "id": "002952.SZ"
                    },
                    {
                        "name": "鸿合科技",
                        "scale": 4157001008,
                        "id": "002955.SZ"
                    },
                    {
                        "name": "五方光电",
                        "scale": 1.97254171E+9,
                        "id": "002962.SZ"
                    },
                    {
                        "name": "芯瑞达",
                        "scale": 1149377001,
                        "id": "002983.SZ"
                    },
                    {
                        "name": "宝明科技",
                        "scale": 2413092591,
                        "id": "002992.SZ"
                    },
                    {
                        "name": "日久光电",
                        "scale": 1955355765,
                        "id": "003015.SZ"
                    },
                    {
                        "name": "宸展光电",
                        "scale": 2.63866304E+9,
                        "id": "003019.SZ"
                    },
                    {
                        "name": "金龙机电",
                        "scale": 5.35713128E+9,
                        "id": "300032.SZ"
                    },
                    {
                        "name": "GQY视讯",
                        "scale": 1937413413,
                        "id": "300076.SZ"
                    },
                    {
                        "name": "长信科技",
                        "scale": 18710971482,
                        "id": "300088.SZ"
                    },
                    {
                        "name": "乾照光电",
                        "scale": 5464862701,
                        "id": "300102.SZ"
                    },
                    {
                        "name": "经纬辉开",
                        "scale": 3141700109,
                        "id": "300120.SZ"
                    },
                    {
                        "name": "锦富技术",
                        "scale": 4276918259,
                        "id": "300128.SZ"
                    },
                    {
                        "name": "雷曼光电",
                        "scale": 2166476892,
                        "id": "300162.SZ"
                    },
                    {
                        "name": "鸿利智汇",
                        "scale": 6123847734,
                        "id": "300219.SZ"
                    },
                    {
                        "name": "洲明科技",
                        "scale": 5955744134,
                        "id": "300232.SZ"
                    },
                    {
                        "name": "瑞丰光电",
                        "scale": 3391602796,
                        "id": "300241.SZ"
                    },
                    {
                        "name": "利亚德",
                        "scale": 14264492131,
                        "id": "300296.SZ"
                    },
                    {
                        "name": "*ST长方",
                        "scale": 1.57231645E+9,
                        "id": "300301.SZ"
                    },
                    {
                        "name": "聚飞光电",
                        "scale": 6380899757,
                        "id": "300303.SZ"
                    },
                    {
                        "name": "麦捷科技",
                        "scale": 7815126165,
                        "id": "300319.SZ"
                    },
                    {
                        "name": "华灿光电",
                        "scale": 7099272045,
                        "id": "300323.SZ"
                    },
                    {
                        "name": "苏大维格",
                        "scale": 4290719428,
                        "id": "300331.SZ"
                    },
                    {
                        "name": "艾比森",
                        "scale": 2094062408,
                        "id": "300389.SZ"
                    },
                    {
                        "name": "联得装备",
                        "scale": 2395200714,
                        "id": "300545.SZ"
                    },
                    {
                        "name": "激智科技",
                        "scale": 4242331054,
                        "id": "300566.SZ"
                    },
                    {
                        "name": "英飞特",
                        "scale": 3348744447,
                        "id": "300582.SZ"
                    },
                    {
                        "name": "三雄极光",
                        "scale": 1729848633,
                        "id": "300625.SZ"
                    },
                    {
                        "name": "光莆股份",
                        "scale": 2402742902,
                        "id": "300632.SZ"
                    },
                    {
                        "name": "太龙股份",
                        "scale": 2444307205,
                        "id": "300650.SZ"
                    },
                    {
                        "name": "联合光电",
                        "scale": 3671611547,
                        "id": "300691.SZ"
                    },
                    {
                        "name": "森霸传感",
                        "scale": 2517083089,
                        "id": "300701.SZ"
                    },
                    {
                        "name": "聚灿光电",
                        "scale": 4909873901,
                        "id": "300708.SZ"
                    },
                    {
                        "name": "隆利科技",
                        "scale": 3489994853,
                        "id": "300752.SZ"
                    },
                    {
                        "name": "宇瞳光学",
                        "scale": 3262932003,
                        "id": "300790.SZ"
                    },
                    {
                        "name": "久量股份",
                        "scale": 6.94896E+8,
                        "id": "300808.SZ"
                    },
                    {
                        "name": "爱克股份",
                        "scale": 1344118105,
                        "id": "300889.SZ"
                    },
                    {
                        "name": "汇创达",
                        "scale": 1.55785724E+9,
                        "id": "300909.SZ"
                    },
                    {
                        "name": "秋田微",
                        "scale": 2.767464E+9,
                        "id": "300939.SZ"
                    },
                    {
                        "name": "南极光",
                        "scale": 1.92545238E+9,
                        "id": "300940.SZ"
                    },
                    {
                        "name": "崧盛股份",
                        "scale": 1535512509,
                        "id": "301002.SZ"
                    },
                    {
                        "name": "阳光照明",
                        "scale": 5106921264,
                        "id": "600261.SH"
                    },
                    {
                        "name": "联创光电",
                        "scale": 13890674623,
                        "id": "600363.SH"
                    },
                    {
                        "name": "凯盛科技",
                        "scale": 8700638794,
                        "id": "600552.SH"
                    },
                    {
                        "name": "飞乐音响",
                        "scale": 4680774979,
                        "id": "600651.SH"
                    },
                    {
                        "name": "*ST瑞德",
                        "scale": 1378363478,
                        "id": "600666.SH"
                    },
                    {
                        "name": "三安光电",
                        "scale": 95516711814,
                        "id": "600703.SH"
                    },
                    {
                        "name": "彩虹股份",
                        "scale": 11359837309,
                        "id": "600707.SH"
                    },
                    {
                        "name": "永新光学",
                        "scale": 12625598295,
                        "id": "603297.SH"
                    },
                    {
                        "name": "得邦照明",
                        "scale": 6982468578,
                        "id": "603303.SH"
                    },
                    {
                        "name": "欧普照明",
                        "scale": 12414405493,
                        "id": "603515.SH"
                    },
                    {
                        "name": "华体科技",
                        "scale": 1778142197,
                        "id": "603679.SH"
                    },
                    {
                        "name": "晨丰科技",
                        "scale": 1793106934,
                        "id": "603685.SH"
                    },
                    {
                        "name": "沃格光电",
                        "scale": 2708539998,
                        "id": "603773.SH"
                    },
                    {
                        "name": "力鼎光电",
                        "scale": 619843292,
                        "id": "605118.SH"
                    },
                    {
                        "name": "伟时电子",
                        "scale": 1192353124,
                        "id": "605218.SH"
                    },
                    {
                        "name": "立达信",
                        "scale": 1.03196035E+9,
                        "id": "605365.SH"
                    },
                    {
                        "name": "光峰科技",
                        "scale": 13054040103,
                        "id": "688007.SH"
                    },
                    {
                        "name": "福光股份",
                        "scale": 3.82775333E+9,
                        "id": "688010.SH"
                    },
                    {
                        "name": "龙腾光电",
                        "scale": 9826667015,
                        "id": "688055.SH"
                    },
                    {
                        "name": "美迪凯",
                        "scale": 2080534447,
                        "id": "688079.SH"
                    },
                    {
                        "name": "蓝特光学",
                        "scale": 4192488078,
                        "id": "688127.SH"
                    },
                    {
                        "name": "八亿时空",
                        "scale": 3542752167,
                        "id": "688181.SH"
                    },
                    {
                        "name": "腾景科技",
                        "scale": 2609126327,
                        "id": "688195.SH"
                    },
                    {
                        "name": "长阳科技",
                        "scale": 4654451923,
                        "id": "688299.SH"
                    },
                    {
                        "name": "和辉光电-U",
                        "scale": 15443224536,
                        "id": "688538.SH"
                    }
                ],
                "name": "光学光电子",
                "scale": 821646727401,
                "id": "270300"
            },
            {
                "children": [
                    {
                        "name": "深圳华强",
                        "scale": 13349386854,
                        "id": "000062.SZ"
                    },
                    {
                        "name": "华工科技",
                        "scale": 23406115952,
                        "id": "000988.SZ"
                    },
                    {
                        "name": "大族激光",
                        "scale": 34703961911,
                        "id": "002008.SZ"
                    },
                    {
                        "name": "贤丰控股",
                        "scale": 6671780332,
                        "id": "002141.SZ"
                    },
                    {
                        "name": "远 望 谷",
                        "scale": 5072819209,
                        "id": "002161.SZ"
                    },
                    {
                        "name": "大立科技",
                        "scale": 7631442198,
                        "id": "002214.SZ"
                    },
                    {
                        "name": "新亚制程",
                        "scale": 3344475306,
                        "id": "002388.SZ"
                    },
                    {
                        "name": "高德红外",
                        "scale": 34187510692,
                        "id": "002414.SZ"
                    },
                    {
                        "name": "海洋王",
                        "scale": 5038094192,
                        "id": "002724.SZ"
                    },
                    {
                        "name": "好利科技",
                        "scale": 5809102093,
                        "id": "002729.SZ"
                    },
                    {
                        "name": "金溢科技",
                        "scale": 3.45275658E+9,
                        "id": "002869.SZ"
                    },
                    {
                        "name": "力源信息",
                        "scale": 5909561379,
                        "id": "300184.SZ"
                    },
                    {
                        "name": "金运激光",
                        "scale": 2044801972,
                        "id": "300220.SZ"
                    },
                    {
                        "name": "科恒股份",
                        "scale": 2847162258,
                        "id": "300340.SZ"
                    },
                    {
                        "name": "天华超净",
                        "scale": 33471351484,
                        "id": "300390.SZ"
                    },
                    {
                        "name": "久之洋",
                        "scale": 5.2884E+9,
                        "id": "300516.SZ"
                    },
                    {
                        "name": "民德电子",
                        "scale": 3789996927,
                        "id": "300656.SZ"
                    },
                    {
                        "name": "百邦科技",
                        "scale": 1139694142,
                        "id": "300736.SZ"
                    },
                    {
                        "name": "锐科激光",
                        "scale": 14540278687,
                        "id": "300747.SZ"
                    },
                    {
                        "name": "安克创新",
                        "scale": 10340909539,
                        "id": "300866.SZ"
                    },
                    {
                        "name": "杰美特",
                        "scale": 1.28951887E+9,
                        "id": "300868.SZ"
                    },
                    {
                        "name": "商络电子",
                        "scale": 2.75446794E+9,
                        "id": "300975.SZ"
                    },
                    {
                        "name": "英诺激光",
                        "scale": 2712679673,
                        "id": "301021.SZ"
                    },
                    {
                        "name": "金百泽",
                        "scale": 1087461832,
                        "id": "301041.SZ"
                    },
                    {
                        "name": "鸿富瀚",
                        "scale": 1.12755E+9,
                        "id": "301086.SZ"
                    },
                    {
                        "name": "雅创电子",
                        "scale": 1580404061,
                        "id": "301099.SZ"
                    },
                    {
                        "name": "凤凰光学",
                        "scale": 6219967208,
                        "id": "600071.SH"
                    },
                    {
                        "name": "诺德股份",
                        "scale": 15708555872,
                        "id": "600110.SH"
                    },
                    {
                        "name": "维科技术",
                        "scale": 4386382517,
                        "id": "600152.SH"
                    },
                    {
                        "name": "大恒科技",
                        "scale": 6.74856E+9,
                        "id": "600288.SH"
                    },
                    {
                        "name": "旭光电子",
                        "scale": 6.3723984E+9,
                        "id": "600353.SH"
                    },
                    {
                        "name": "海航科技",
                        "scale": 6716023426,
                        "id": "600751.SH"
                    },
                    {
                        "name": "杉杉股份",
                        "scale": 48990604131,
                        "id": "600884.SH"
                    },
                    {
                        "name": "东尼电子",
                        "scale": 11772436034,
                        "id": "603595.SH"
                    },
                    {
                        "name": "格林达",
                        "scale": 2535280621,
                        "id": "603931.SH"
                    },
                    {
                        "name": "方邦股份",
                        "scale": 4.6168E+9,
                        "id": "688020.SH"
                    },
                    {
                        "name": "杰普特",
                        "scale": 3373321794,
                        "id": "688025.SH"
                    },
                    {
                        "name": "世华科技",
                        "scale": 1286477226,
                        "id": "688093.SH"
                    },
                    {
                        "name": "国力股份",
                        "scale": 1238493435,
                        "id": "688103.SH"
                    },
                    {
                        "name": "富吉瑞",
                        "scale": 4.79332E+8,
                        "id": "688272.SH"
                    },
                    {
                        "name": "富信科技",
                        "scale": 2265614322,
                        "id": "688662.SH"
                    },
                    {
                        "name": "晶赛科技",
                        "scale": 388610208,
                        "id": "871981.BJ"
                    }
                ],
                "name": "其他电子",
                "scale": 355690541277,
                "id": "270400"
            },
            {
                "children": [
                    {
                        "name": "深华发Ａ",
                        "scale": 1786290755,
                        "id": "000020.SZ"
                    },
                    {
                        "name": "深科技",
                        "scale": 21262982669,
                        "id": "000021.SZ"
                    },
                    {
                        "name": "德赛电池",
                        "scale": 1.33519903E+10,
                        "id": "000049.SZ"
                    },
                    {
                        "name": "国光电器",
                        "scale": 6.06381063E+9,
                        "id": "002045.SZ"
                    },
                    {
                        "name": "得润电子",
                        "scale": 7519854041,
                        "id": "002055.SZ"
                    },
                    {
                        "name": "拓邦股份",
                        "scale": 15875393776,
                        "id": "002139.SZ"
                    },
                    {
                        "name": "大华股份",
                        "scale": 29878685156,
                        "id": "002236.SZ"
                    },
                    {
                        "name": "歌尔股份",
                        "scale": 107545905012,
                        "id": "002241.SZ"
                    },
                    {
                        "name": "漫步者",
                        "scale": 5119207376,
                        "id": "002351.SZ"
                    },
                    {
                        "name": "卓翼科技",
                        "scale": 3357392521,
                        "id": "002369.SZ"
                    },
                    {
                        "name": "和而泰",
                        "scale": 16637300553,
                        "id": "002402.SZ"
                    },
                    {
                        "name": "海康威视",
                        "scale": 306559205462,
                        "id": "002415.SZ"
                    },
                    {
                        "name": "立讯精密",
                        "scale": 261479578224,
                        "id": "002475.SZ"
                    },
                    {
                        "name": "春兴精工",
                        "scale": 7036757875,
                        "id": "002547.SZ"
                    },
                    {
                        "name": "领益智造",
                        "scale": 40024025161,
                        "id": "002600.SZ"
                    },
                    {
                        "name": "安洁科技",
                        "scale": 6895949129,
                        "id": "002635.SZ"
                    },
                    {
                        "name": "共达电声",
                        "scale": 5272345283,
                        "id": "002655.SZ"
                    },
                    {
                        "name": "茂硕电源",
                        "scale": 2493638857,
                        "id": "002660.SZ"
                    },
                    {
                        "name": "奋达科技",
                        "scale": 5123952582,
                        "id": "002681.SZ"
                    },
                    {
                        "name": "可立克",
                        "scale": 10222935765,
                        "id": "002782.SZ"
                    },
                    {
                        "name": "捷荣技术",
                        "scale": 2161291195,
                        "id": "002855.SZ"
                    },
                    {
                        "name": "洁美科技",
                        "scale": 10727602104,
                        "id": "002859.SZ"
                    },
                    {
                        "name": "瀛通通讯",
                        "scale": 1278997691,
                        "id": "002861.SZ"
                    },
                    {
                        "name": "传艺科技",
                        "scale": 4649420942,
                        "id": "002866.SZ"
                    },
                    {
                        "name": "美格智能",
                        "scale": 6755900102,
                        "id": "002881.SZ"
                    },
                    {
                        "name": "京泉华",
                        "scale": 4158344016,
                        "id": "002885.SZ"
                    },
                    {
                        "name": "惠威科技",
                        "scale": 1005316051,
                        "id": "002888.SZ"
                    },
                    {
                        "name": "伊戈尔",
                        "scale": 5325935987,
                        "id": "002922.SZ"
                    },
                    {
                        "name": "盈趣科技",
                        "scale": 16341089928,
                        "id": "002925.SZ"
                    },
                    {
                        "name": "兴瑞科技",
                        "scale": 6462841307,
                        "id": "002937.SZ"
                    },
                    {
                        "name": "恒铭达",
                        "scale": 3470343011,
                        "id": "002947.SZ"
                    },
                    {
                        "name": "瑞玛精密",
                        "scale": 8.6716635E+8,
                        "id": "002976.SZ"
                    },
                    {
                        "name": "朝阳科技",
                        "scale": 6.1968E+8,
                        "id": "002981.SZ"
                    },
                    {
                        "name": "奥海科技",
                        "scale": 2.739996E+9,
                        "id": "002993.SZ"
                    },
                    {
                        "name": "振邦智能",
                        "scale": 1332069124,
                        "id": "003028.SZ"
                    },
                    {
                        "name": "创世纪",
                        "scale": 14813648628,
                        "id": "300083.SZ"
                    },
                    {
                        "name": "长盈精密",
                        "scale": 15217595456,
                        "id": "300115.SZ"
                    },
                    {
                        "name": "英唐智控",
                        "scale": 6551506385,
                        "id": "300131.SZ"
                    },
                    {
                        "name": "信维通信",
                        "scale": 1.501357584E+10,
                        "id": "300136.SZ"
                    },
                    {
                        "name": "欣旺达",
                        "scale": 46898521409,
                        "id": "300207.SZ"
                    },
                    {
                        "name": "光韵达",
                        "scale": 3224349284,
                        "id": "300227.SZ"
                    },
                    {
                        "name": "*ST星星",
                        "scale": 2806407537,
                        "id": "300256.SZ"
                    },
                    {
                        "name": "和晶科技",
                        "scale": 2861888702,
                        "id": "300279.SZ"
                    },
                    {
                        "name": "硕贝德",
                        "scale": 4925254813,
                        "id": "300322.SZ"
                    },
                    {
                        "name": "蓝思科技",
                        "scale": 57145821823,
                        "id": "300433.SZ"
                    },
                    {
                        "name": "朗科智能",
                        "scale": 2449290307,
                        "id": "300543.SZ"
                    },
                    {
                        "name": "飞荣达",
                        "scale": 5824595815,
                        "id": "300602.SZ"
                    },
                    {
                        "name": "超频三",
                        "scale": 4894083737,
                        "id": "300647.SZ"
                    },
                    {
                        "name": "电连技术",
                        "scale": 18881121945,
                        "id": "300679.SZ"
                    },
                    {
                        "name": "中石科技",
                        "scale": 2774826317,
                        "id": "300684.SZ"
                    },
                    {
                        "name": "智动力",
                        "scale": 2.52004938E+9,
                        "id": "300686.SZ"
                    },
                    {
                        "name": "精研科技",
                        "scale": 5562496777,
                        "id": "300709.SZ"
                    },
                    {
                        "name": "光弘科技",
                        "scale": 1.050396868E+10,
                        "id": "300735.SZ"
                    },
                    {
                        "name": "海能实业",
                        "scale": 1906882842,
                        "id": "300787.SZ"
                    },
                    {
                        "name": "佳禾智能",
                        "scale": 2896870093,
                        "id": "300793.SZ"
                    },
                    {
                        "name": "贝仕达克",
                        "scale": 7.487502E+8,
                        "id": "300822.SZ"
                    },
                    {
                        "name": "胜蓝股份",
                        "scale": 1190975935,
                        "id": "300843.SZ"
                    },
                    {
                        "name": "协创数据",
                        "scale": 3058722916,
                        "id": "300857.SZ"
                    },
                    {
                        "name": "朗特智能",
                        "scale": 1417259244,
                        "id": "300916.SZ"
                    },
                    {
                        "name": "博硕科技",
                        "scale": 3.00219E+9,
                        "id": "300951.SZ"
                    },
                    {
                        "name": "英力股份",
                        "scale": 1020371278,
                        "id": "300956.SZ"
                    },
                    {
                        "name": "格林精密",
                        "scale": 1720869935,
                        "id": "300968.SZ"
                    },
                    {
                        "name": "达瑞电子",
                        "scale": 1993285706,
                        "id": "300976.SZ"
                    },
                    {
                        "name": "创益通",
                        "scale": 9.9829152E+8,
                        "id": "300991.SZ"
                    },
                    {
                        "name": "天禄科技",
                        "scale": 5.921384E+8,
                        "id": "301045.SZ"
                    },
                    {
                        "name": "显盈科技",
                        "scale": 5.72824E+8,
                        "id": "301067.SZ"
                    },
                    {
                        "name": "万祥科技",
                        "scale": 9.326331E+8,
                        "id": "301180.SZ"
                    },
                    {
                        "name": "超达装备",
                        "scale": 6.64664E+8,
                        "id": "301186.SZ"
                    },
                    {
                        "name": "奥尼电子",
                        "scale": 1.0299E+9,
                        "id": "301189.SZ"
                    },
                    {
                        "name": "福日电子",
                        "scale": 4.27088317E+9,
                        "id": "600203.SH"
                    },
                    {
                        "name": "科力远",
                        "scale": 15328430703,
                        "id": "600478.SH"
                    },
                    {
                        "name": "闻泰科技",
                        "scale": 68029786639,
                        "id": "600745.SH"
                    },
                    {
                        "name": "工业富联",
                        "scale": 191406926444,
                        "id": "601138.SH"
                    },
                    {
                        "name": "环旭电子",
                        "scale": 39547764083,
                        "id": "601231.SH"
                    },
                    {
                        "name": "福蓉科技",
                        "scale": 1.0660585E+10,
                        "id": "603327.SH"
                    },
                    {
                        "name": "易德龙",
                        "scale": 5669992008,
                        "id": "603380.SH"
                    },
                    {
                        "name": "利通电子",
                        "scale": 3.80744E+9,
                        "id": "603629.SH"
                    },
                    {
                        "name": "徕木股份",
                        "scale": 3815497376,
                        "id": "603633.SH"
                    },
                    {
                        "name": "春秋电子",
                        "scale": 4882113736,
                        "id": "603890.SH"
                    },
                    {
                        "name": "传音控股",
                        "scale": 29169974208,
                        "id": "688036.SH"
                    },
                    {
                        "name": "统联精密",
                        "scale": 629732106,
                        "id": "688210.SH"
                    },
                    {
                        "name": "昀冢科技",
                        "scale": 1334323688,
                        "id": "688260.SH"
                    },
                    {
                        "name": "福立旺",
                        "scale": 2368942153,
                        "id": "688678.SH"
                    },
                    {
                        "name": "莱尔科技",
                        "scale": 1.43595375E+9,
                        "id": "688683.SH"
                    },
                    {
                        "name": "瑞可达",
                        "scale": 9.29951568E+9,
                        "id": "688800.SH"
                    },
                    {
                        "name": "同惠电子",
                        "scale": 739817578,
                        "id": "833509.BJ"
                    },
                    {
                        "name": "德瑞锂电",
                        "scale": 668839042,
                        "id": "833523.BJ"
                    },
                    {
                        "name": "长虹能源",
                        "scale": 1762025893,
                        "id": "836239.BJ"
                    },
                    {
                        "name": "智新电子",
                        "scale": 441299705,
                        "id": "837212.BJ"
                    }
                ],
                "name": "电子制造",
                "scale": 1583288669901,
                "id": "270500"
            }
        ],
        "name": "电子",
        "scale": 5191110260709,
        "id": "270000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "江铃汽车",
                        "scale": 8544272877,
                        "id": "000550.SZ"
                    },
                    {
                        "name": "海马汽车",
                        "scale": 9.82008824E+9,
                        "id": "000572.SZ"
                    },
                    {
                        "name": "长安汽车",
                        "scale": 129579318862,
                        "id": "000625.SZ"
                    },
                    {
                        "name": "一汽解放",
                        "scale": 12042262285,
                        "id": "000800.SZ"
                    },
                    {
                        "name": "安凯客车",
                        "scale": 4128643216,
                        "id": "000868.SZ"
                    },
                    {
                        "name": "中国铁物",
                        "scale": 10611177628,
                        "id": "000927.SZ"
                    },
                    {
                        "name": "中国重汽",
                        "scale": 13756625414,
                        "id": "000951.SZ"
                    },
                    {
                        "name": "中通客车",
                        "scale": 9954857085,
                        "id": "000957.SZ"
                    },
                    {
                        "name": "比亚迪",
                        "scale": 363325022926,
                        "id": "002594.SZ"
                    },
                    {
                        "name": "中集车辆",
                        "scale": 6867989892,
                        "id": "301039.SZ"
                    },
                    {
                        "name": "东风汽车",
                        "scale": 1.372E+10,
                        "id": "600006.SH"
                    },
                    {
                        "name": "宇通客车",
                        "scale": 18110022844,
                        "id": "600066.SH"
                    },
                    {
                        "name": "上汽集团",
                        "scale": 191491931772,
                        "id": "600104.SH"
                    },
                    {
                        "name": "福田汽车",
                        "scale": 17950274288,
                        "id": "600166.SH"
                    },
                    {
                        "name": "亚星客车",
                        "scale": 1.947E+9,
                        "id": "600213.SH"
                    },
                    {
                        "name": "ST曙光",
                        "scale": 2499735581,
                        "id": "600303.SH"
                    },
                    {
                        "name": "江淮汽车",
                        "scale": 36995318766,
                        "id": "600418.SH"
                    },
                    {
                        "name": "金龙汽车",
                        "scale": 4742267319,
                        "id": "600686.SH"
                    },
                    {
                        "name": "北汽蓝谷",
                        "scale": 3.075024107E+10,
                        "id": "600733.SH"
                    },
                    {
                        "name": "赛力斯",
                        "scale": 66239716465,
                        "id": "601127.SH"
                    },
                    {
                        "name": "广汽集团",
                        "scale": 108222216728,
                        "id": "601238.SH"
                    },
                    {
                        "name": "长城汽车",
                        "scale": 193429417301,
                        "id": "601633.SH"
                    },
                    {
                        "name": "力帆科技",
                        "scale": 1.1612322E+10,
                        "id": "601777.SH"
                    }
                ],
                "name": "汽车整车",
                "scale": 1266340722559,
                "id": "280100"
            },
            {
                "children": [
                    {
                        "name": "富奥股份",
                        "scale": 9756596418,
                        "id": "000030.SZ"
                    },
                    {
                        "name": "潍柴动力",
                        "scale": 60395159691,
                        "id": "000338.SZ"
                    },
                    {
                        "name": "万向钱潮",
                        "scale": 16655877625,
                        "id": "000559.SZ"
                    },
                    {
                        "name": "威孚高科",
                        "scale": 15636115937,
                        "id": "000581.SZ"
                    },
                    {
                        "name": "恒立实业",
                        "scale": 2.1899139E+9,
                        "id": "000622.SZ"
                    },
                    {
                        "name": "襄阳轴承",
                        "scale": 3116167984,
                        "id": "000678.SZ"
                    },
                    {
                        "name": "模塑科技",
                        "scale": 5.21831607E+9,
                        "id": "000700.SZ"
                    },
                    {
                        "name": "浩物股份",
                        "scale": 2535389996,
                        "id": "000757.SZ"
                    },
                    {
                        "name": "中鼎股份",
                        "scale": 25594719872,
                        "id": "000887.SZ"
                    },
                    {
                        "name": "云内动力",
                        "scale": 6129190665,
                        "id": "000903.SZ"
                    },
                    {
                        "name": "ST众泰",
                        "scale": 1.920778337E+10,
                        "id": "000980.SZ"
                    },
                    {
                        "name": "宗申动力",
                        "scale": 6048954473,
                        "id": "001696.SZ"
                    },
                    {
                        "name": "宁波华翔",
                        "scale": 10714749343,
                        "id": "002048.SZ"
                    },
                    {
                        "name": "万丰奥威",
                        "scale": 13996029939,
                        "id": "002085.SZ"
                    },
                    {
                        "name": "广东鸿图",
                        "scale": 16976626399,
                        "id": "002101.SZ"
                    },
                    {
                        "name": "银轮股份",
                        "scale": 11129762638,
                        "id": "002126.SZ"
                    },
                    {
                        "name": "大为股份",
                        "scale": 3.5226E+9,
                        "id": "002213.SZ"
                    },
                    {
                        "name": "奥特佳",
                        "scale": 10313440932,
                        "id": "002239.SZ"
                    },
                    {
                        "name": "西仪股份",
                        "scale": 4670180082,
                        "id": "002265.SZ"
                    },
                    {
                        "name": "天润工业",
                        "scale": 6827914586,
                        "id": "002283.SZ"
                    },
                    {
                        "name": "亚太股份",
                        "scale": 7244330873,
                        "id": "002284.SZ"
                    },
                    {
                        "name": "新朋股份",
                        "scale": 4120037512,
                        "id": "002328.SZ"
                    },
                    {
                        "name": "兴民智通",
                        "scale": 3.33269991E+9,
                        "id": "002355.SZ"
                    },
                    {
                        "name": "隆基机械",
                        "scale": 2943567822,
                        "id": "002363.SZ"
                    },
                    {
                        "name": "远东传动",
                        "scale": 2927329923,
                        "id": "002406.SZ"
                    },
                    {
                        "name": "万里扬",
                        "scale": 12736376873,
                        "id": "002434.SZ"
                    },
                    {
                        "name": "中原内配",
                        "scale": 3.46658451E+9,
                        "id": "002448.SZ"
                    },
                    {
                        "name": "松芝股份",
                        "scale": 6222984004,
                        "id": "002454.SZ"
                    },
                    {
                        "name": "双环传动",
                        "scale": 21593771488,
                        "id": "002472.SZ"
                    },
                    {
                        "name": "金固股份",
                        "scale": 7.23482397E+9,
                        "id": "002488.SZ"
                    },
                    {
                        "name": "天汽模",
                        "scale": 4246923574,
                        "id": "002510.SZ"
                    },
                    {
                        "name": "旷达科技",
                        "scale": 5736924785,
                        "id": "002516.SZ"
                    },
                    {
                        "name": "飞龙股份",
                        "scale": 4183570926,
                        "id": "002536.SZ"
                    },
                    {
                        "name": "南方精工",
                        "scale": 4158722068,
                        "id": "002553.SZ"
                    },
                    {
                        "name": "万安科技",
                        "scale": 4309537425,
                        "id": "002590.SZ"
                    },
                    {
                        "name": "ST八菱",
                        "scale": 1311610691,
                        "id": "002592.SZ"
                    },
                    {
                        "name": "光启技术",
                        "scale": 2.58963326E+10,
                        "id": "002625.SZ"
                    },
                    {
                        "name": "京威股份",
                        "scale": 5819926668,
                        "id": "002662.SZ"
                    },
                    {
                        "name": "浙江世宝",
                        "scale": 5088137758,
                        "id": "002703.SZ"
                    },
                    {
                        "name": "光洋股份",
                        "scale": 3745689133,
                        "id": "002708.SZ"
                    },
                    {
                        "name": "登云股份",
                        "scale": 2.49228E+9,
                        "id": "002715.SZ"
                    },
                    {
                        "name": "跃岭股份",
                        "scale": 2196235832,
                        "id": "002725.SZ"
                    },
                    {
                        "name": "蓝黛科技",
                        "scale": 4.77096415E+9,
                        "id": "002765.SZ"
                    },
                    {
                        "name": "路畅科技",
                        "scale": 4124620266,
                        "id": "002813.SZ"
                    },
                    {
                        "name": "今飞凯达",
                        "scale": 3145015494,
                        "id": "002863.SZ"
                    },
                    {
                        "name": "钧达股份",
                        "scale": 24424791466,
                        "id": "002865.SZ"
                    },
                    {
                        "name": "香山股份",
                        "scale": 2925071867,
                        "id": "002870.SZ"
                    },
                    {
                        "name": "华阳集团",
                        "scale": 23346621095,
                        "id": "002906.SZ"
                    },
                    {
                        "name": "联诚精密",
                        "scale": 1360064735,
                        "id": "002921.SZ"
                    },
                    {
                        "name": "瑞鹄模具",
                        "scale": 3.25038E+9,
                        "id": "002997.SZ"
                    },
                    {
                        "name": "征和工业",
                        "scale": 9.562124E+8,
                        "id": "003033.SZ"
                    },
                    {
                        "name": "双林股份",
                        "scale": 3883774447,
                        "id": "300100.SZ"
                    },
                    {
                        "name": "精锻科技",
                        "scale": 6381881615,
                        "id": "300258.SZ"
                    },
                    {
                        "name": "云意电气",
                        "scale": 4757249336,
                        "id": "300304.SZ"
                    },
                    {
                        "name": "鹏翎股份",
                        "scale": 2.36900682E+9,
                        "id": "300375.SZ"
                    },
                    {
                        "name": "立中集团",
                        "scale": 17246872551,
                        "id": "300428.SZ"
                    },
                    {
                        "name": "富临精工",
                        "scale": 20628988938,
                        "id": "300432.SZ"
                    },
                    {
                        "name": "德尔股份",
                        "scale": 2988760511,
                        "id": "300473.SZ"
                    },
                    {
                        "name": "苏奥传感",
                        "scale": 4505467364,
                        "id": "300507.SZ"
                    },
                    {
                        "name": "川环科技",
                        "scale": 3270415034,
                        "id": "300547.SZ"
                    },
                    {
                        "name": "贝斯特",
                        "scale": 4155959585,
                        "id": "300580.SZ"
                    },
                    {
                        "name": "奥联电子",
                        "scale": 2.6848E+9,
                        "id": "300585.SZ"
                    },
                    {
                        "name": "美力科技",
                        "scale": 1653425296,
                        "id": "300611.SZ"
                    },
                    {
                        "name": "万通智控",
                        "scale": 4306329305,
                        "id": "300643.SZ"
                    },
                    {
                        "name": "雷迪克",
                        "scale": 2652852855,
                        "id": "300652.SZ"
                    },
                    {
                        "name": "隆盛科技",
                        "scale": 3865479782,
                        "id": "300680.SZ"
                    },
                    {
                        "name": "英搏尔",
                        "scale": 5.74377543E+9,
                        "id": "300681.SZ"
                    },
                    {
                        "name": "蠡湖股份",
                        "scale": 2379071025,
                        "id": "300694.SZ"
                    },
                    {
                        "name": "兆丰股份",
                        "scale": 3697574227,
                        "id": "300695.SZ"
                    },
                    {
                        "name": "威唐工业",
                        "scale": 2.83959348E+9,
                        "id": "300707.SZ"
                    },
                    {
                        "name": "西菱动力",
                        "scale": 2882625549,
                        "id": "300733.SZ"
                    },
                    {
                        "name": "越博动力",
                        "scale": 1680958849,
                        "id": "300742.SZ"
                    },
                    {
                        "name": "艾可蓝",
                        "scale": 1204768748,
                        "id": "300816.SZ"
                    },
                    {
                        "name": "卡倍亿",
                        "scale": 1.6346304E+9,
                        "id": "300863.SZ"
                    },
                    {
                        "name": "松原股份",
                        "scale": 1.825875E+9,
                        "id": "300893.SZ"
                    },
                    {
                        "name": "凯龙高科",
                        "scale": 1.09081203E+9,
                        "id": "300912.SZ"
                    },
                    {
                        "name": "博俊科技",
                        "scale": 984422348,
                        "id": "300926.SZ"
                    },
                    {
                        "name": "华安鑫创",
                        "scale": 3106934975,
                        "id": "300928.SZ"
                    },
                    {
                        "name": "恒帅股份",
                        "scale": 2.0872E+9,
                        "id": "300969.SZ"
                    },
                    {
                        "name": "东箭科技",
                        "scale": 3239490903,
                        "id": "300978.SZ"
                    },
                    {
                        "name": "宁波方正",
                        "scale": 1049575775,
                        "id": "300998.SZ"
                    },
                    {
                        "name": "肇民科技",
                        "scale": 1196169345,
                        "id": "301000.SZ"
                    },
                    {
                        "name": "超捷股份",
                        "scale": 1044929517,
                        "id": "301005.SZ"
                    },
                    {
                        "name": "德迈仕",
                        "scale": 2.01910836E+9,
                        "id": "301007.SZ"
                    },
                    {
                        "name": "密封科技",
                        "scale": 1734810574,
                        "id": "301020.SZ"
                    },
                    {
                        "name": "海泰科",
                        "scale": 1120163938,
                        "id": "301022.SZ"
                    },
                    {
                        "name": "中熔电气",
                        "scale": 7127218905,
                        "id": "301031.SZ"
                    },
                    {
                        "name": "中捷精工",
                        "scale": 835448297,
                        "id": "301072.SZ"
                    },
                    {
                        "name": "正强股份",
                        "scale": 6.572E+8,
                        "id": "301119.SZ"
                    },
                    {
                        "name": "金钟股份",
                        "scale": 7.693497E+8,
                        "id": "301133.SZ"
                    },
                    {
                        "name": "东风科技",
                        "scale": 3.7972116E+9,
                        "id": "600081.SH"
                    },
                    {
                        "name": "长春一东",
                        "scale": 2102934447,
                        "id": "600148.SH"
                    },
                    {
                        "name": "东安动力",
                        "scale": 3.5302912E+9,
                        "id": "600178.SH"
                    },
                    {
                        "name": "凌云股份",
                        "scale": 7237615181,
                        "id": "600480.SH"
                    },
                    {
                        "name": "贵航股份",
                        "scale": 10004144791,
                        "id": "600523.SH"
                    },
                    {
                        "name": "金杯汽车",
                        "scale": 5692795758,
                        "id": "600609.SH"
                    },
                    {
                        "name": "申达股份",
                        "scale": 3468825656,
                        "id": "600626.SH"
                    },
                    {
                        "name": "福耀玻璃",
                        "scale": 78196586401,
                        "id": "600660.SH"
                    },
                    {
                        "name": "交运股份",
                        "scale": 4.21682107E+9,
                        "id": "600676.SH"
                    },
                    {
                        "name": "湖南天雁",
                        "scale": 3628870127,
                        "id": "600698.SH"
                    },
                    {
                        "name": "均胜电子",
                        "scale": 24912821003,
                        "id": "600699.SH"
                    },
                    {
                        "name": "华域汽车",
                        "scale": 64410150993,
                        "id": "600741.SH"
                    },
                    {
                        "name": "一汽富维",
                        "scale": 6771572245,
                        "id": "600742.SH"
                    },
                    {
                        "name": "爱柯迪",
                        "scale": 16325611995,
                        "id": "600933.SH"
                    },
                    {
                        "name": "渤海汽车",
                        "scale": 3887608469,
                        "id": "600960.SH"
                    },
                    {
                        "name": "英利汽车",
                        "scale": 1188276325,
                        "id": "601279.SH"
                    },
                    {
                        "name": "骆驼股份",
                        "scale": 13714078119,
                        "id": "601311.SH"
                    },
                    {
                        "name": "拓普集团",
                        "scale": 87943316446,
                        "id": "601689.SH"
                    },
                    {
                        "name": "郑煤机",
                        "scale": 23749201748,
                        "id": "601717.SH"
                    },
                    {
                        "name": "星宇股份",
                        "scale": 43706094313,
                        "id": "601799.SH"
                    },
                    {
                        "name": "联明股份",
                        "scale": 1891674041,
                        "id": "603006.SH"
                    },
                    {
                        "name": "北特科技",
                        "scale": 2754649016,
                        "id": "603009.SH"
                    },
                    {
                        "name": "亚普股份",
                        "scale": 8350059725,
                        "id": "603013.SH"
                    },
                    {
                        "name": "威帝股份",
                        "scale": 2816019833,
                        "id": "603023.SH"
                    },
                    {
                        "name": "常熟汽饰",
                        "scale": 6878559887,
                        "id": "603035.SH"
                    },
                    {
                        "name": "凯众股份",
                        "scale": 1877734165,
                        "id": "603037.SH"
                    },
                    {
                        "name": "新坐标",
                        "scale": 2726678368,
                        "id": "603040.SH"
                    },
                    {
                        "name": "浙江黎明",
                        "scale": 7.299936E+8,
                        "id": "603048.SH"
                    },
                    {
                        "name": "天成自控",
                        "scale": 4.99063885E+9,
                        "id": "603085.SH"
                    },
                    {
                        "name": "正裕工业",
                        "scale": 1962448254,
                        "id": "603089.SH"
                    },
                    {
                        "name": "神驰机电",
                        "scale": 1.26233016E+9,
                        "id": "603109.SH"
                    },
                    {
                        "name": "华培动力",
                        "scale": 2.53391355E+9,
                        "id": "603121.SH"
                    },
                    {
                        "name": "腾龙股份",
                        "scale": 4402469775,
                        "id": "603158.SH"
                    },
                    {
                        "name": "科华控股",
                        "scale": 1.72753E+9,
                        "id": "603161.SH"
                    },
                    {
                        "name": "福达股份",
                        "scale": 5117972516,
                        "id": "603166.SH"
                    },
                    {
                        "name": "圣龙股份",
                        "scale": 3.0733091E+9,
                        "id": "603178.SH"
                    },
                    {
                        "name": "新泉股份",
                        "scale": 15822694998,
                        "id": "603179.SH"
                    },
                    {
                        "name": "保隆科技",
                        "scale": 1.231343621E+10,
                        "id": "603197.SH"
                    },
                    {
                        "name": "浙江仙通",
                        "scale": 4.6996992E+9,
                        "id": "603239.SH"
                    },
                    {
                        "name": "日盈电子",
                        "scale": 2.16843112E+9,
                        "id": "603286.SH"
                    },
                    {
                        "name": "旭升股份",
                        "scale": 23557296663,
                        "id": "603305.SH"
                    },
                    {
                        "name": "华懋科技",
                        "scale": 10147001283,
                        "id": "603306.SH"
                    },
                    {
                        "name": "湘油泵",
                        "scale": 4127120543,
                        "id": "603319.SH"
                    },
                    {
                        "name": "迪生力",
                        "scale": 3506504274,
                        "id": "603335.SH"
                    },
                    {
                        "name": "文灿股份",
                        "scale": 2.162232511E+10,
                        "id": "603348.SH"
                    },
                    {
                        "name": "华达科技",
                        "scale": 8.2495616E+9,
                        "id": "603358.SH"
                    },
                    {
                        "name": "通达电气",
                        "scale": 1077051098,
                        "id": "603390.SH"
                    },
                    {
                        "name": "金麒麟",
                        "scale": 3107436563,
                        "id": "603586.SH"
                    },
                    {
                        "name": "伯特利",
                        "scale": 3.926102246E+10,
                        "id": "603596.SH"
                    },
                    {
                        "name": "朗博科技",
                        "scale": 2.09456E+9,
                        "id": "603655.SH"
                    },
                    {
                        "name": "德宏股份",
                        "scale": 2997821004,
                        "id": "603701.SH"
                    },
                    {
                        "name": "岱美股份",
                        "scale": 14747650859,
                        "id": "603730.SH"
                    },
                    {
                        "name": "秦安股份",
                        "scale": 4576653221,
                        "id": "603758.SH"
                    },
                    {
                        "name": "中马传动",
                        "scale": 2737278545,
                        "id": "603767.SH"
                    },
                    {
                        "name": "常青股份",
                        "scale": 5.71812E+9,
                        "id": "603768.SH"
                    },
                    {
                        "name": "科博达",
                        "scale": 2.436075E+9,
                        "id": "603786.SH"
                    },
                    {
                        "name": "宁波高发",
                        "scale": 2913229788,
                        "id": "603788.SH"
                    },
                    {
                        "name": "豪能股份",
                        "scale": 5254724355,
                        "id": "603809.SH"
                    },
                    {
                        "name": "合力科技",
                        "scale": 6.057184E+9,
                        "id": "603917.SH"
                    },
                    {
                        "name": "金鸿顺",
                        "scale": 3.41504E+9,
                        "id": "603922.SH"
                    },
                    {
                        "name": "铁流股份",
                        "scale": 2355444125,
                        "id": "603926.SH"
                    },
                    {
                        "name": "长源东谷",
                        "scale": 1287450285,
                        "id": "603950.SH"
                    },
                    {
                        "name": "泉峰汽车",
                        "scale": 2402026468,
                        "id": "603982.SH"
                    },
                    {
                        "name": "继峰股份",
                        "scale": 14515881299,
                        "id": "603997.SH"
                    },
                    {
                        "name": "合兴股份",
                        "scale": 967940803,
                        "id": "605005.SH"
                    },
                    {
                        "name": "长华股份",
                        "scale": 6.318688E+8,
                        "id": "605018.SH"
                    },
                    {
                        "name": "明新旭腾",
                        "scale": 1.6046E+9,
                        "id": "605068.SH"
                    },
                    {
                        "name": "冠盛股份",
                        "scale": 1.52143804E+9,
                        "id": "605088.SH"
                    },
                    {
                        "name": "上海沿浦",
                        "scale": 2.2298166E+9,
                        "id": "605128.SH"
                    },
                    {
                        "name": "嵘泰股份",
                        "scale": 1.2916E+9,
                        "id": "605133.SH"
                    },
                    {
                        "name": "神通科技",
                        "scale": 9.7048385E+8,
                        "id": "605228.SH"
                    },
                    {
                        "name": "天普股份",
                        "scale": 5.43024E+8,
                        "id": "605255.SH"
                    },
                    {
                        "name": "无锡振华",
                        "scale": 1.0346E+9,
                        "id": "605319.SH"
                    },
                    {
                        "name": "沪光股份",
                        "scale": 1.7901277E+9,
                        "id": "605333.SH"
                    },
                    {
                        "name": "精进电动-UW",
                        "scale": 1296978939,
                        "id": "688280.SH"
                    },
                    {
                        "name": "泛亚微透",
                        "scale": 2638189464,
                        "id": "688386.SH"
                    },
                    {
                        "name": "上声电子",
                        "scale": 2.85326496E+9,
                        "id": "688533.SH"
                    },
                    {
                        "name": "菱电电控",
                        "scale": 3703714652,
                        "id": "688667.SH"
                    },
                    {
                        "name": "中自科技",
                        "scale": 695196217,
                        "id": "688737.SH"
                    },
                    {
                        "name": "安徽凤凰",
                        "scale": 187641608,
                        "id": "832000.BJ"
                    },
                    {
                        "name": "同心传动",
                        "scale": 248111618,
                        "id": "833454.BJ"
                    },
                    {
                        "name": "华阳变速",
                        "scale": 288808201,
                        "id": "839946.BJ"
                    },
                    {
                        "name": "大地电气",
                        "scale": 2.7294732E+8,
                        "id": "870436.BJ"
                    }
                ],
                "name": "汽车零部件",
                "scale": 1306770482122,
                "id": "280200"
            },
            {
                "children": [
                    {
                        "name": "特  力Ａ",
                        "scale": 8436878314,
                        "id": "000025.SZ"
                    },
                    {
                        "name": "漳州发展",
                        "scale": 4223709362,
                        "id": "000753.SZ"
                    },
                    {
                        "name": "中国中期",
                        "scale": 2.3805E+9,
                        "id": "000996.SZ"
                    },
                    {
                        "name": "阿尔特",
                        "scale": 6390912813,
                        "id": "300825.SZ"
                    },
                    {
                        "name": "深城交",
                        "scale": 1296599977,
                        "id": "301091.SZ"
                    },
                    {
                        "name": "光庭信息",
                        "scale": 1530683959,
                        "id": "301221.SZ"
                    },
                    {
                        "name": "广汇汽车",
                        "scale": 20926967453,
                        "id": "600297.SH"
                    },
                    {
                        "name": "大东方",
                        "scale": 4149615939,
                        "id": "600327.SH"
                    },
                    {
                        "name": "国机汽车",
                        "scale": 1.023558416E+10,
                        "id": "600335.SH"
                    },
                    {
                        "name": "申华控股",
                        "scale": 4457210926,
                        "id": "600653.SH"
                    },
                    {
                        "name": "庞大集团",
                        "scale": 13295392591,
                        "id": "601258.SH"
                    },
                    {
                        "name": "XD中国汽",
                        "scale": 14573051916,
                        "id": "601965.SH"
                    },
                    {
                        "name": "东方时尚",
                        "scale": 4439809098,
                        "id": "603377.SH"
                    },
                    {
                        "name": "建邦科技",
                        "scale": 268735842,
                        "id": "837242.BJ"
                    },
                    {
                        "name": "德众汽车",
                        "scale": 333462522,
                        "id": "838030.BJ"
                    }
                ],
                "name": "汽车服务",
                "scale": 96939114872,
                "id": "280300"
            },
            {
                "children": [
                    {
                        "name": "深中华A",
                        "scale": 1399772257,
                        "id": "000017.SZ"
                    },
                    {
                        "name": "钱江摩托",
                        "scale": 1.02952672E+10,
                        "id": "000913.SZ"
                    },
                    {
                        "name": "信隆健康",
                        "scale": 2.77849E+9,
                        "id": "002105.SZ"
                    },
                    {
                        "name": "久祺股份",
                        "scale": 1.6635232E+9,
                        "id": "300994.SZ"
                    },
                    {
                        "name": "林海股份",
                        "scale": 1.9457856E+9,
                        "id": "600099.SH"
                    },
                    {
                        "name": "上海凤凰",
                        "scale": 2768326091,
                        "id": "600679.SH"
                    },
                    {
                        "name": "声光电科",
                        "scale": 10056274798,
                        "id": "600877.SH"
                    },
                    {
                        "name": "春风动力",
                        "scale": 2.171319447E+10,
                        "id": "603129.SH"
                    },
                    {
                        "name": "爱玛科技",
                        "scale": 8212055545,
                        "id": "603529.SH"
                    },
                    {
                        "name": "隆鑫通用",
                        "scale": 10123961321,
                        "id": "603766.SH"
                    },
                    {
                        "name": "永安行",
                        "scale": 3439188108,
                        "id": "603776.SH"
                    },
                    {
                        "name": "新日股份",
                        "scale": 3.84744E+9,
                        "id": "603787.SH"
                    },
                    {
                        "name": "九号公司-WD",
                        "scale": 29006391648,
                        "id": "689009.SH"
                    }
                ],
                "name": "其他交运设备",
                "scale": 107249670238,
                "id": "280400"
            }
        ],
        "name": "汽车",
        "scale": 2777299989791,
        "id": "280000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "美的集团",
                        "scale": 3.6411128248E+11,
                        "id": "000333.SZ"
                    },
                    {
                        "name": "长虹华意",
                        "scale": 4.42507667E+9,
                        "id": "000404.SZ"
                    },
                    {
                        "name": "长虹美菱",
                        "scale": 3949897729,
                        "id": "000521.SZ"
                    },
                    {
                        "name": "格力电器",
                        "scale": 172597552261,
                        "id": "000651.SZ"
                    },
                    {
                        "name": "海信家电",
                        "scale": 13154266494,
                        "id": "000921.SZ"
                    },
                    {
                        "name": "盾安环境",
                        "scale": 16646903875,
                        "id": "002011.SZ"
                    },
                    {
                        "name": "苏 泊 尔",
                        "scale": 3.65963869E+10,
                        "id": "002032.SZ"
                    },
                    {
                        "name": "华帝股份",
                        "scale": 4545480497,
                        "id": "002035.SZ"
                    },
                    {
                        "name": "三花智控",
                        "scale": 103323011045,
                        "id": "002050.SZ"
                    },
                    {
                        "name": "九阳股份",
                        "scale": 12426410235,
                        "id": "002242.SZ"
                    },
                    {
                        "name": "禾盛新材",
                        "scale": 1731792368,
                        "id": "002290.SZ"
                    },
                    {
                        "name": "爱仕达",
                        "scale": 2732012534,
                        "id": "002403.SZ"
                    },
                    {
                        "name": "康盛股份",
                        "scale": 4100706398,
                        "id": "002418.SZ"
                    },
                    {
                        "name": "老板电器",
                        "scale": 2.510208597E+10,
                        "id": "002508.SZ"
                    },
                    {
                        "name": "万和电气",
                        "scale": 5709096561,
                        "id": "002543.SZ"
                    },
                    {
                        "name": "奥佳华",
                        "scale": 3552901563,
                        "id": "002614.SZ"
                    },
                    {
                        "name": "ST奥马",
                        "scale": 5843360597,
                        "id": "002668.SZ"
                    },
                    {
                        "name": "顺威股份",
                        "scale": 3016652654,
                        "id": "002676.SZ"
                    },
                    {
                        "name": "浙江美大",
                        "scale": 5510710695,
                        "id": "002677.SZ"
                    },
                    {
                        "name": "新宝股份",
                        "scale": 17060134994,
                        "id": "002705.SZ"
                    },
                    {
                        "name": "小崧股份",
                        "scale": 4459553146,
                        "id": "002723.SZ"
                    },
                    {
                        "name": "天际股份",
                        "scale": 9.7391143E+9,
                        "id": "002759.SZ"
                    },
                    {
                        "name": "星帅尔",
                        "scale": 3394240358,
                        "id": "002860.SZ"
                    },
                    {
                        "name": "小熊电器",
                        "scale": 3.82096249E+9,
                        "id": "002959.SZ"
                    },
                    {
                        "name": "彩虹集团",
                        "scale": 916236219,
                        "id": "003023.SZ"
                    },
                    {
                        "name": "秀强股份",
                        "scale": 5351419659,
                        "id": "300160.SZ"
                    },
                    {
                        "name": "东方电热",
                        "scale": 8257386852,
                        "id": "300217.SZ"
                    },
                    {
                        "name": "融捷健康",
                        "scale": 2699005052,
                        "id": "300247.SZ"
                    },
                    {
                        "name": "依米康",
                        "scale": 3.06348916E+9,
                        "id": "300249.SZ"
                    },
                    {
                        "name": "开能健康",
                        "scale": 2400966765,
                        "id": "300272.SZ"
                    },
                    {
                        "name": "天银机电",
                        "scale": 4295680495,
                        "id": "300342.SZ"
                    },
                    {
                        "name": "汉宇集团",
                        "scale": 4834064796,
                        "id": "300403.SZ"
                    },
                    {
                        "name": "香农芯创",
                        "scale": 8.925E+9,
                        "id": "300475.SZ"
                    },
                    {
                        "name": "北鼎股份",
                        "scale": 1637084426,
                        "id": "300824.SZ"
                    },
                    {
                        "name": "火星人",
                        "scale": 3.592125E+9,
                        "id": "300894.SZ"
                    },
                    {
                        "name": "亿田智能",
                        "scale": 2588545078,
                        "id": "300911.SZ"
                    },
                    {
                        "name": "宏昌科技",
                        "scale": 6.7771E+8,
                        "id": "301008.SZ"
                    },
                    {
                        "name": "澳柯玛",
                        "scale": 5220051335,
                        "id": "600336.SH"
                    },
                    {
                        "name": "海立股份",
                        "scale": 5832757345,
                        "id": "600619.SH"
                    },
                    {
                        "name": "海尔智家",
                        "scale": 149386526847,
                        "id": "600690.SH"
                    },
                    {
                        "name": "春兰股份",
                        "scale": 2872605715,
                        "id": "600854.SH"
                    },
                    {
                        "name": "惠而浦",
                        "scale": 5.64865543E+9,
                        "id": "600983.SH"
                    },
                    {
                        "name": "东贝集团",
                        "scale": 1.5596292E+9,
                        "id": "601956.SH"
                    },
                    {
                        "name": "华翔股份",
                        "scale": 2636983218,
                        "id": "603112.SH"
                    },
                    {
                        "name": "富佳股份",
                        "scale": 7.7695E+8,
                        "id": "603219.SH"
                    },
                    {
                        "name": "金海高科",
                        "scale": 3.0576E+9,
                        "id": "603311.SH"
                    },
                    {
                        "name": "莱克电气",
                        "scale": 1.900653377E+10,
                        "id": "603355.SH"
                    },
                    {
                        "name": "日出东方",
                        "scale": 7.368E+9,
                        "id": "603366.SH"
                    },
                    {
                        "name": "立霸股份",
                        "scale": 3747232695,
                        "id": "603519.SH"
                    },
                    {
                        "name": "奥普家居",
                        "scale": 1.11862156E+9,
                        "id": "603551.SH"
                    },
                    {
                        "name": "三星新材",
                        "scale": 2429409221,
                        "id": "603578.SH"
                    },
                    {
                        "name": "荣泰健康",
                        "scale": 3269969627,
                        "id": "603579.SH"
                    },
                    {
                        "name": "春光科技",
                        "scale": 2.216256E+9,
                        "id": "603657.SH"
                    },
                    {
                        "name": "奇精机械",
                        "scale": 2396022287,
                        "id": "603677.SH"
                    },
                    {
                        "name": "朗迪集团",
                        "scale": 2.77548544E+9,
                        "id": "603726.SH"
                    },
                    {
                        "name": "飞科电器",
                        "scale": 3.65904E+10,
                        "id": "603868.SH"
                    },
                    {
                        "name": "德业股份",
                        "scale": 28620889318,
                        "id": "605117.SH"
                    },
                    {
                        "name": "帅丰电器",
                        "scale": 1101327936,
                        "id": "605336.SH"
                    },
                    {
                        "name": "德昌股份",
                        "scale": 2.0181E+9,
                        "id": "605555.SH"
                    },
                    {
                        "name": "倍轻松",
                        "scale": 1040144911,
                        "id": "688793.SH"
                    }
                ],
                "name": "白色家电",
                "scale": 1167478458171,
                "id": "330100"
            },
            {
                "children": [
                    {
                        "name": "深康佳Ａ",
                        "scale": 8733261421,
                        "id": "000016.SZ"
                    },
                    {
                        "name": "四川九洲",
                        "scale": 7435804316,
                        "id": "000801.SZ"
                    },
                    {
                        "name": "创维数字",
                        "scale": 21846339286,
                        "id": "000810.SZ"
                    },
                    {
                        "name": "*ST同洲",
                        "scale": 1842520444,
                        "id": "002052.SZ"
                    },
                    {
                        "name": "毅昌科技",
                        "scale": 2818802358,
                        "id": "002420.SZ"
                    },
                    {
                        "name": "兆驰股份",
                        "scale": 18254983725,
                        "id": "002429.SZ"
                    },
                    {
                        "name": "银河电子",
                        "scale": 5873680595,
                        "id": "002519.SZ"
                    },
                    {
                        "name": "高斯贝尔",
                        "scale": 1977547801,
                        "id": "002848.SZ"
                    },
                    {
                        "name": "海信视像",
                        "scale": 16061952026,
                        "id": "600060.SH"
                    },
                    {
                        "name": "四川长虹",
                        "scale": 13337230444,
                        "id": "600839.SH"
                    },
                    {
                        "name": "九联科技",
                        "scale": 3130970199,
                        "id": "688609.SH"
                    },
                    {
                        "name": "极米科技",
                        "scale": 16192749271,
                        "id": "688696.SH"
                    }
                ],
                "name": "视听器材",
                "scale": 117505841886,
                "id": "330200"
            }
        ],
        "name": "家用电器",
        "scale": 1284984300057,
        "id": "330000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "泸州老窖",
                        "scale": 329044883417,
                        "id": "000568.SZ"
                    },
                    {
                        "name": "古井贡酒",
                        "scale": 1.0227258E+11,
                        "id": "000596.SZ"
                    },
                    {
                        "name": "燕京啤酒",
                        "scale": 21255974199,
                        "id": "000729.SZ"
                    },
                    {
                        "name": "*ST西发",
                        "scale": 1.18691321E+9,
                        "id": "000752.SZ"
                    },
                    {
                        "name": "酒鬼酒",
                        "scale": 49688139622,
                        "id": "000799.SZ"
                    },
                    {
                        "name": "承德露露",
                        "scale": 8944821642,
                        "id": "000848.SZ"
                    },
                    {
                        "name": "五 粮 液",
                        "scale": 693623649891,
                        "id": "000858.SZ"
                    },
                    {
                        "name": "顺鑫农业",
                        "scale": 17780154726,
                        "id": "000860.SZ"
                    },
                    {
                        "name": "张  裕Ａ",
                        "scale": 13952988816,
                        "id": "000869.SZ"
                    },
                    {
                        "name": "兰州黄河",
                        "scale": 1.53247234E+9,
                        "id": "000929.SZ"
                    },
                    {
                        "name": "*ST皇台",
                        "scale": 3.2465664E+9,
                        "id": "000995.SZ"
                    },
                    {
                        "name": "洋河股份",
                        "scale": 2.6298927955E+11,
                        "id": "002304.SZ"
                    },
                    {
                        "name": "珠江啤酒",
                        "scale": 16777029878,
                        "id": "002461.SZ"
                    },
                    {
                        "name": "百润股份",
                        "scale": 18132827428,
                        "id": "002568.SZ"
                    },
                    {
                        "name": "天佑德酒",
                        "scale": 8207542438,
                        "id": "002646.SZ"
                    },
                    {
                        "name": "欢乐家",
                        "scale": 1.0746E+9,
                        "id": "300997.SZ"
                    },
                    {
                        "name": "古越龙山",
                        "scale": 8887538527,
                        "id": "600059.SH"
                    },
                    {
                        "name": "中葡股份",
                        "scale": 8090833176,
                        "id": "600084.SH"
                    },
                    {
                        "name": "重庆啤酒",
                        "scale": 5.707472338E+10,
                        "id": "600132.SH"
                    },
                    {
                        "name": "泉阳泉",
                        "scale": 4849734755,
                        "id": "600189.SH"
                    },
                    {
                        "name": "伊力特",
                        "scale": 13332832597,
                        "id": "600197.SH"
                    },
                    {
                        "name": "金种子酒",
                        "scale": 17536863328,
                        "id": "600199.SH"
                    },
                    {
                        "name": "海南椰岛",
                        "scale": 5776120508,
                        "id": "600238.SH"
                    },
                    {
                        "name": "维维股份",
                        "scale": 5417426303,
                        "id": "600300.SH"
                    },
                    {
                        "name": "ST通葡",
                        "scale": 1.62E+9,
                        "id": "600365.SH"
                    },
                    {
                        "name": "贵州茅台",
                        "scale": 2.4219493584E+12,
                        "id": "600519.SH"
                    },
                    {
                        "name": "莫高股份",
                        "scale": 1.8657072E+9,
                        "id": "600543.SH"
                    },
                    {
                        "name": "老白干酒",
                        "scale": 24576703091,
                        "id": "600559.SH"
                    },
                    {
                        "name": "惠泉啤酒",
                        "scale": 2.2575E+9,
                        "id": "600573.SH"
                    },
                    {
                        "name": "青岛啤酒",
                        "scale": 73178533203,
                        "id": "600600.SH"
                    },
                    {
                        "name": "金枫酒业",
                        "scale": 4361912274,
                        "id": "600616.SH"
                    },
                    {
                        "name": "舍得酒业",
                        "scale": 55514276485,
                        "id": "600702.SH"
                    },
                    {
                        "name": "水井坊",
                        "scale": 35298761847,
                        "id": "600779.SH"
                    },
                    {
                        "name": "山西汾酒",
                        "scale": 344941567742,
                        "id": "600809.SH"
                    },
                    {
                        "name": "会稽山",
                        "scale": 5.5754056E+9,
                        "id": "601579.SH"
                    },
                    {
                        "name": "养元饮品",
                        "scale": 25082083152,
                        "id": "603156.SH"
                    },
                    {
                        "name": "迎驾贡酒",
                        "scale": 4.4272E+10,
                        "id": "603198.SH"
                    },
                    {
                        "name": "今世缘",
                        "scale": 5.9099495E+10,
                        "id": "603369.SH"
                    },
                    {
                        "name": "口子窖",
                        "scale": 3.1548E+10,
                        "id": "603589.SH"
                    },
                    {
                        "name": "香飘飘",
                        "scale": 5043958424,
                        "id": "603711.SH"
                    },
                    {
                        "name": "威龙股份",
                        "scale": 2212781874,
                        "id": "603779.SH"
                    },
                    {
                        "name": "金徽酒",
                        "scale": 15415631309,
                        "id": "603919.SH"
                    },
                    {
                        "name": "李子园",
                        "scale": 2755617277,
                        "id": "605337.SH"
                    },
                    {
                        "name": "均瑶健康",
                        "scale": 2257958276,
                        "id": "605388.SH"
                    },
                    {
                        "name": "东鹏饮料",
                        "scale": 1.1865161E+10,
                        "id": "605499.SH"
                    }
                ],
                "name": "饮料制造",
                "scale": 4841368908285,
                "id": "340300"
            },
            {
                "children": [
                    {
                        "name": "西王食品",
                        "scale": 4479621104,
                        "id": "000639.SZ"
                    },
                    {
                        "name": "黑芝麻",
                        "scale": 2359191211,
                        "id": "000716.SZ"
                    },
                    {
                        "name": "双汇发展",
                        "scale": 39900476875,
                        "id": "000895.SZ"
                    },
                    {
                        "name": "千味央厨",
                        "scale": 1001597823,
                        "id": "001215.SZ"
                    },
                    {
                        "name": "青岛食品",
                        "scale": 6.528132E+8,
                        "id": "001219.SZ"
                    },
                    {
                        "name": "三全食品",
                        "scale": 10920888177,
                        "id": "002216.SZ"
                    },
                    {
                        "name": "皇氏集团",
                        "scale": 3758533562,
                        "id": "002329.SZ"
                    },
                    {
                        "name": "得利斯",
                        "scale": 3748919785,
                        "id": "002330.SZ"
                    },
                    {
                        "name": "双塔食品",
                        "scale": 8609050548,
                        "id": "002481.SZ"
                    },
                    {
                        "name": "佳隆股份",
                        "scale": 1941902936,
                        "id": "002495.SZ"
                    },
                    {
                        "name": "涪陵榨菜",
                        "scale": 27629119849,
                        "id": "002507.SZ"
                    },
                    {
                        "name": "金字火腿",
                        "scale": 3680691964,
                        "id": "002515.SZ"
                    },
                    {
                        "name": "洽洽食品",
                        "scale": 27215677816,
                        "id": "002557.SZ"
                    },
                    {
                        "name": "贝因美",
                        "scale": 5086749758,
                        "id": "002570.SZ"
                    },
                    {
                        "name": "好想你",
                        "scale": 2524235145,
                        "id": "002582.SZ"
                    },
                    {
                        "name": "金禾实业",
                        "scale": 2.606777466E+10,
                        "id": "002597.SZ"
                    },
                    {
                        "name": "加加食品",
                        "scale": 4.76912475E+9,
                        "id": "002650.SZ"
                    },
                    {
                        "name": "克明食品",
                        "scale": 4.01740089E+9,
                        "id": "002661.SZ"
                    },
                    {
                        "name": "煌上煌",
                        "scale": 5168254533,
                        "id": "002695.SZ"
                    },
                    {
                        "name": "海欣食品",
                        "scale": 2.12771405E+9,
                        "id": "002702.SZ"
                    },
                    {
                        "name": "麦趣尔",
                        "scale": 1691221051,
                        "id": "002719.SZ"
                    },
                    {
                        "name": "龙大美食",
                        "scale": 1.035116314E+10,
                        "id": "002726.SZ"
                    },
                    {
                        "name": "燕塘乳业",
                        "scale": 2884381065,
                        "id": "002732.SZ"
                    },
                    {
                        "name": "桂发祥",
                        "scale": 1672802076,
                        "id": "002820.SZ"
                    },
                    {
                        "name": "华统股份",
                        "scale": 9290312802,
                        "id": "002840.SZ"
                    },
                    {
                        "name": "盐津铺子",
                        "scale": 1.054805392E+10,
                        "id": "002847.SZ"
                    },
                    {
                        "name": "庄园牧场",
                        "scale": 1852600919,
                        "id": "002910.SZ"
                    },
                    {
                        "name": "新乳业",
                        "scale": 9496040635,
                        "id": "002946.SZ"
                    },
                    {
                        "name": "西麦食品",
                        "scale": 3.18062948E+9,
                        "id": "002956.SZ"
                    },
                    {
                        "name": "甘源食品",
                        "scale": 2341801885,
                        "id": "002991.SZ"
                    },
                    {
                        "name": "劲仔食品",
                        "scale": 2291853903,
                        "id": "003000.SZ"
                    },
                    {
                        "name": "祖名股份",
                        "scale": 1.2244508E+9,
                        "id": "003030.SZ"
                    },
                    {
                        "name": "汤臣倍健",
                        "scale": 17856387785,
                        "id": "300146.SZ"
                    },
                    {
                        "name": "华宝股份",
                        "scale": 15212165605,
                        "id": "300741.SZ"
                    },
                    {
                        "name": "三只松鼠",
                        "scale": 8.32877E+9,
                        "id": "300783.SZ"
                    },
                    {
                        "name": "仙乐健康",
                        "scale": 1433685164,
                        "id": "300791.SZ"
                    },
                    {
                        "name": "科拓生物",
                        "scale": 1.49133751E+9,
                        "id": "300858.SZ"
                    },
                    {
                        "name": "品渥食品",
                        "scale": 7.870625E+8,
                        "id": "300892.SZ"
                    },
                    {
                        "name": "熊猫乳品",
                        "scale": 994164885,
                        "id": "300898.SZ"
                    },
                    {
                        "name": "仲景食品",
                        "scale": 1427614875,
                        "id": "300908.SZ"
                    },
                    {
                        "name": "海融科技",
                        "scale": 1.054368E+9,
                        "id": "300915.SZ"
                    },
                    {
                        "name": "立高食品",
                        "scale": 5825090237,
                        "id": "300973.SZ"
                    },
                    {
                        "name": "上海梅林",
                        "scale": 6864179735,
                        "id": "600073.SH"
                    },
                    {
                        "name": "莲花健康",
                        "scale": 4782690115,
                        "id": "600186.SH"
                    },
                    {
                        "name": "恒顺醋业",
                        "scale": 11724556014,
                        "id": "600305.SH"
                    },
                    {
                        "name": "青海春天",
                        "scale": 7355871085,
                        "id": "600381.SH"
                    },
                    {
                        "name": "天润乳业",
                        "scale": 3619331141,
                        "id": "600419.SH"
                    },
                    {
                        "name": "三元股份",
                        "scale": 7248177942,
                        "id": "600429.SH"
                    },
                    {
                        "name": "光明乳业",
                        "scale": 15701426061,
                        "id": "600597.SH"
                    },
                    {
                        "name": "星湖科技",
                        "scale": 4907087262,
                        "id": "600866.SH"
                    },
                    {
                        "name": "中炬高新",
                        "scale": 27943676301,
                        "id": "600872.SH"
                    },
                    {
                        "name": "妙可蓝多",
                        "scale": 15078324351,
                        "id": "600882.SH"
                    },
                    {
                        "name": "伊利股份",
                        "scale": 229909133127,
                        "id": "600887.SH"
                    },
                    {
                        "name": "爱普股份",
                        "scale": 4431900173,
                        "id": "603020.SH"
                    },
                    {
                        "name": "千禾味业",
                        "scale": 14895689689,
                        "id": "603027.SH"
                    },
                    {
                        "name": "广州酒家",
                        "scale": 13545310099,
                        "id": "603043.SH"
                    },
                    {
                        "name": "海天味业",
                        "scale": 370614026284,
                        "id": "603288.SH"
                    },
                    {
                        "name": "天味食品",
                        "scale": 19005378588,
                        "id": "603317.SH"
                    },
                    {
                        "name": "安井食品",
                        "scale": 36393711354,
                        "id": "603345.SH"
                    },
                    {
                        "name": "绝味食品",
                        "scale": 30632382879,
                        "id": "603517.SH"
                    },
                    {
                        "name": "惠发食品",
                        "scale": 1662817548,
                        "id": "603536.SH"
                    },
                    {
                        "name": "安记食品",
                        "scale": 2.086224E+9,
                        "id": "603696.SH"
                    },
                    {
                        "name": "有友食品",
                        "scale": 3450141595,
                        "id": "603697.SH"
                    },
                    {
                        "name": "良品铺子",
                        "scale": 5527543851,
                        "id": "603719.SH"
                    },
                    {
                        "name": "日辰股份",
                        "scale": 1166562819,
                        "id": "603755.SH"
                    },
                    {
                        "name": "来伊份",
                        "scale": 4466149979,
                        "id": "603777.SH"
                    },
                    {
                        "name": "桃李面包",
                        "scale": 19116643905,
                        "id": "603866.SH"
                    },
                    {
                        "name": "元祖股份",
                        "scale": 3.9984E+9,
                        "id": "603886.SH"
                    },
                    {
                        "name": "华康股份",
                        "scale": 4481934067,
                        "id": "605077.SH"
                    },
                    {
                        "name": "味知香",
                        "scale": 1.516595E+9,
                        "id": "605089.SH"
                    },
                    {
                        "name": "一鸣食品",
                        "scale": 6.7466E+8,
                        "id": "605179.SH"
                    },
                    {
                        "name": "佳禾食品",
                        "scale": 812972005,
                        "id": "605300.SH"
                    },
                    {
                        "name": "巴比食品",
                        "scale": 2452476991,
                        "id": "605338.SH"
                    },
                    {
                        "name": "南侨食品",
                        "scale": 1554416841,
                        "id": "605339.SH"
                    },
                    {
                        "name": "春雪食品",
                        "scale": 7.535E+8,
                        "id": "605567.SH"
                    },
                    {
                        "name": "嘉必优",
                        "scale": 2865109386,
                        "id": "688089.SH"
                    },
                    {
                        "name": "朱老六",
                        "scale": 263984512,
                        "id": "831726.BJ"
                    }
                ],
                "name": "食品加工",
                "scale": 1178398681572,
                "id": "340400"
            }
        ],
        "name": "食品饮料",
        "scale": 6019767589857,
        "id": "340000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "鲁  泰Ａ",
                        "scale": 4220017788,
                        "id": "000726.SZ"
                    },
                    {
                        "name": "华茂股份",
                        "scale": 3537684326,
                        "id": "000850.SZ"
                    },
                    {
                        "name": "欣龙控股",
                        "scale": 2457222392,
                        "id": "000955.SZ"
                    },
                    {
                        "name": "中银绒业",
                        "scale": 9248273205,
                        "id": "000982.SZ"
                    },
                    {
                        "name": "伟星股份",
                        "scale": 8937767825,
                        "id": "002003.SZ"
                    },
                    {
                        "name": "华孚时尚",
                        "scale": 6116547978,
                        "id": "002042.SZ"
                    },
                    {
                        "name": "孚日股份",
                        "scale": 4385908238,
                        "id": "002083.SZ"
                    },
                    {
                        "name": "新野纺织",
                        "scale": 2585574495,
                        "id": "002087.SZ"
                    },
                    {
                        "name": "浔兴股份",
                        "scale": 2.22318E+9,
                        "id": "002098.SZ"
                    },
                    {
                        "name": "宏达高科",
                        "scale": 1384512024,
                        "id": "002144.SZ"
                    },
                    {
                        "name": "如意集团",
                        "scale": 1.76389162E+9,
                        "id": "002193.SZ"
                    },
                    {
                        "name": "联发股份",
                        "scale": 2388059833,
                        "id": "002394.SZ"
                    },
                    {
                        "name": "嘉欣丝绸",
                        "scale": 3187581279,
                        "id": "002404.SZ"
                    },
                    {
                        "name": "兴业科技",
                        "scale": 3.61949915E+9,
                        "id": "002674.SZ"
                    },
                    {
                        "name": "开润股份",
                        "scale": 1.81205361E+9,
                        "id": "300577.SZ"
                    },
                    {
                        "name": "延江股份",
                        "scale": 1.58584326E+9,
                        "id": "300658.SZ"
                    },
                    {
                        "name": "聚杰微纤",
                        "scale": 6.418566E+8,
                        "id": "300819.SZ"
                    },
                    {
                        "name": "金春股份",
                        "scale": 9.6558215E+8,
                        "id": "300877.SZ"
                    },
                    {
                        "name": "稳健医疗",
                        "scale": 10036663744,
                        "id": "300888.SZ"
                    },
                    {
                        "name": "华升股份",
                        "scale": 1926110263,
                        "id": "600156.SH"
                    },
                    {
                        "name": "江苏阳光",
                        "scale": 5617522027,
                        "id": "600220.SH"
                    },
                    {
                        "name": "金鹰股份",
                        "scale": 2257607787,
                        "id": "600232.SH"
                    },
                    {
                        "name": "三房巷",
                        "scale": 3844876187,
                        "id": "600370.SH"
                    },
                    {
                        "name": "华纺股份",
                        "scale": 2160281441,
                        "id": "600448.SH"
                    },
                    {
                        "name": "凤竹纺织",
                        "scale": 1.564E+9,
                        "id": "600493.SH"
                    },
                    {
                        "name": "上海三毛",
                        "scale": 1284602967,
                        "id": "600689.SH"
                    },
                    {
                        "name": "航民股份",
                        "scale": 4759005426,
                        "id": "600987.SH"
                    },
                    {
                        "name": "百隆东方",
                        "scale": 8.04E+9,
                        "id": "601339.SH"
                    },
                    {
                        "name": "台华新材",
                        "scale": 12876911516,
                        "id": "603055.SH"
                    },
                    {
                        "name": "诺邦股份",
                        "scale": 1.9398506E+9,
                        "id": "603238.SH"
                    },
                    {
                        "name": "巨星农牧",
                        "scale": 14215832233,
                        "id": "603477.SH"
                    },
                    {
                        "name": "新澳股份",
                        "scale": 3188179997,
                        "id": "603889.SH"
                    },
                    {
                        "name": "迎丰股份",
                        "scale": 673831576,
                        "id": "605055.SH"
                    },
                    {
                        "name": "浙江自然",
                        "scale": 2067515164,
                        "id": "605080.SH"
                    },
                    {
                        "name": "华生科技",
                        "scale": 6.38365E+8,
                        "id": "605180.SH"
                    },
                    {
                        "name": "富春染织",
                        "scale": 8.08704E+8,
                        "id": "605189.SH"
                    }
                ],
                "name": "纺织制造",
                "scale": 138960915701,
                "id": "350100"
            },
            {
                "children": [
                    {
                        "name": "洪兴股份",
                        "scale": 564947915,
                        "id": "001209.SZ"
                    },
                    {
                        "name": "七 匹 狼",
                        "scale": 3886283327,
                        "id": "002029.SZ"
                    },
                    {
                        "name": "报 喜 鸟",
                        "scale": 4349736887,
                        "id": "002154.SZ"
                    },
                    {
                        "name": "美邦服饰",
                        "scale": 4.221E+9,
                        "id": "002269.SZ"
                    },
                    {
                        "name": "星期六",
                        "scale": 15107044482,
                        "id": "002291.SZ"
                    },
                    {
                        "name": "罗莱生活",
                        "scale": 9055115102,
                        "id": "002293.SZ"
                    },
                    {
                        "name": "富安娜",
                        "scale": 3727185934,
                        "id": "002327.SZ"
                    },
                    {
                        "name": "梦洁股份",
                        "scale": 2950718512,
                        "id": "002397.SZ"
                    },
                    {
                        "name": "*ST雪发",
                        "scale": 1.70816E+9,
                        "id": "002485.SZ"
                    },
                    {
                        "name": "嘉麟杰",
                        "scale": 2.62912E+9,
                        "id": "002486.SZ"
                    },
                    {
                        "name": "华斯股份",
                        "scale": 1310540897,
                        "id": "002494.SZ"
                    },
                    {
                        "name": "搜于特",
                        "scale": 3382964183,
                        "id": "002503.SZ"
                    },
                    {
                        "name": "森马服饰",
                        "scale": 10025616817,
                        "id": "002563.SZ"
                    },
                    {
                        "name": "ST步森",
                        "scale": 1007059274,
                        "id": "002569.SZ"
                    },
                    {
                        "name": "朗姿股份",
                        "scale": 7908320542,
                        "id": "002612.SZ"
                    },
                    {
                        "name": "棒杰股份",
                        "scale": 2053420623,
                        "id": "002634.SZ"
                    },
                    {
                        "name": "ST摩登",
                        "scale": 1606259107,
                        "id": "002656.SZ"
                    },
                    {
                        "name": "乔治白",
                        "scale": 1817858206,
                        "id": "002687.SZ"
                    },
                    {
                        "name": "金发拉比",
                        "scale": 1566354504,
                        "id": "002762.SZ"
                    },
                    {
                        "name": "汇洁股份",
                        "scale": 1848972754,
                        "id": "002763.SZ"
                    },
                    {
                        "name": "ST柏龙",
                        "scale": 1.42029124E+9,
                        "id": "002776.SZ"
                    },
                    {
                        "name": "三夫户外",
                        "scale": 1506426023,
                        "id": "002780.SZ"
                    },
                    {
                        "name": "比音勒芬",
                        "scale": 8913784521,
                        "id": "002832.SZ"
                    },
                    {
                        "name": "安奈儿",
                        "scale": 1075240643,
                        "id": "002875.SZ"
                    },
                    {
                        "name": "欣贺股份",
                        "scale": 1228995585,
                        "id": "003016.SZ"
                    },
                    {
                        "name": "真爱美家",
                        "scale": 6.2005944E+8,
                        "id": "003041.SZ"
                    },
                    {
                        "name": "探路者",
                        "scale": 6716136614,
                        "id": "300005.SZ"
                    },
                    {
                        "name": "*ST中潜",
                        "scale": 2959332678,
                        "id": "300526.SZ"
                    },
                    {
                        "name": "万里马",
                        "scale": 1282102625,
                        "id": "300591.SZ"
                    },
                    {
                        "name": "酷特智能",
                        "scale": 1436658108,
                        "id": "300840.SZ"
                    },
                    {
                        "name": "中胤时尚",
                        "scale": 1.17287952E+9,
                        "id": "300901.SZ"
                    },
                    {
                        "name": "南山智尚",
                        "scale": 1085359275,
                        "id": "300918.SZ"
                    },
                    {
                        "name": "恒辉安防",
                        "scale": 770958525,
                        "id": "300952.SZ"
                    },
                    {
                        "name": "华利集团",
                        "scale": 8.89511565E+9,
                        "id": "300979.SZ"
                    },
                    {
                        "name": "戎美股份",
                        "scale": 959212489,
                        "id": "301088.SZ"
                    },
                    {
                        "name": "美尔雅",
                        "scale": 2.3724E+9,
                        "id": "600107.SH"
                    },
                    {
                        "name": "浪莎股份",
                        "scale": 1419376785,
                        "id": "600137.SH"
                    },
                    {
                        "name": "海澜之家",
                        "scale": 19697402913,
                        "id": "600398.SH"
                    },
                    {
                        "name": "红豆股份",
                        "scale": 11892219912,
                        "id": "600400.SH"
                    },
                    {
                        "name": "龙头股份",
                        "scale": 2625644669,
                        "id": "600630.SH"
                    },
                    {
                        "name": "益民集团",
                        "scale": 3699635026,
                        "id": "600824.SH"
                    },
                    {
                        "name": "九牧王",
                        "scale": 4740756488,
                        "id": "601566.SH"
                    },
                    {
                        "name": "际华集团",
                        "scale": 14668042209,
                        "id": "601718.SH"
                    },
                    {
                        "name": "奥康国际",
                        "scale": 3.0314088E+9,
                        "id": "603001.SH"
                    },
                    {
                        "name": "红蜻蜓",
                        "scale": 3.22672448E+9,
                        "id": "603116.SH"
                    },
                    {
                        "name": "日播时尚",
                        "scale": 1.6096688E+9,
                        "id": "603196.SH"
                    },
                    {
                        "name": "水星家纺",
                        "scale": 3.7547136E+9,
                        "id": "603365.SH"
                    },
                    {
                        "name": "爱慕股份",
                        "scale": 957017016,
                        "id": "603511.SH"
                    },
                    {
                        "name": "锦泓集团",
                        "scale": 2257404153,
                        "id": "603518.SH"
                    },
                    {
                        "name": "贵人鸟",
                        "scale": 6050295628,
                        "id": "603555.SH"
                    },
                    {
                        "name": "ST起步",
                        "scale": 1758897545,
                        "id": "603557.SH"
                    },
                    {
                        "name": "健盛集团",
                        "scale": 3995635706,
                        "id": "603558.SH"
                    },
                    {
                        "name": "地素时尚",
                        "scale": 7199803476,
                        "id": "603587.SH"
                    },
                    {
                        "name": "天创时尚",
                        "scale": 1964187993,
                        "id": "603608.SH"
                    },
                    {
                        "name": "康隆达",
                        "scale": 8045401665,
                        "id": "603665.SH"
                    },
                    {
                        "name": "歌力思",
                        "scale": 3.41780005E+9,
                        "id": "603808.SH"
                    },
                    {
                        "name": "安正时尚",
                        "scale": 2756704296,
                        "id": "603839.SH"
                    },
                    {
                        "name": "太平鸟",
                        "scale": 9070645796,
                        "id": "603877.SH"
                    },
                    {
                        "name": "牧高笛",
                        "scale": 6.7650336E+9,
                        "id": "603908.SH"
                    },
                    {
                        "name": "哈森股份",
                        "scale": 1.456312E+9,
                        "id": "603958.SH"
                    },
                    {
                        "name": "众望布艺",
                        "scale": 5.61E+8,
                        "id": "605003.SH"
                    },
                    {
                        "name": "盛泰集团",
                        "scale": 6.55608E+8,
                        "id": "605138.SH"
                    }
                ],
                "name": "服装家纺",
                "scale": 250418972608,
                "id": "350200"
            }
        ],
        "name": "纺织服装",
        "scale": 389379888309,
        "id": "350000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "晨鸣纸业",
                        "scale": 9033691617,
                        "id": "000488.SZ"
                    },
                    {
                        "name": "美利云",
                        "scale": 6299083097,
                        "id": "000815.SZ"
                    },
                    {
                        "name": "依依股份",
                        "scale": 1938373795,
                        "id": "001206.SZ"
                    },
                    {
                        "name": "凯恩股份",
                        "scale": 2659264554,
                        "id": "002012.SZ"
                    },
                    {
                        "name": "景兴纸业",
                        "scale": 3834573082,
                        "id": "002067.SZ"
                    },
                    {
                        "name": "太阳纸业",
                        "scale": 31438370859,
                        "id": "002078.SZ"
                    },
                    {
                        "name": "安妮股份",
                        "scale": 2686549587,
                        "id": "002235.SZ"
                    },
                    {
                        "name": "中顺洁柔",
                        "scale": 14709730907,
                        "id": "002511.SZ"
                    },
                    {
                        "name": "齐峰新材",
                        "scale": 2207507205,
                        "id": "002521.SZ"
                    },
                    {
                        "name": "百亚股份",
                        "scale": 2355063054,
                        "id": "003006.SZ"
                    },
                    {
                        "name": "可靠股份",
                        "scale": 1238610557,
                        "id": "301009.SZ"
                    },
                    {
                        "name": "上海艾录",
                        "scale": 4.8088092E+8,
                        "id": "301062.SZ"
                    },
                    {
                        "name": "青山纸业",
                        "scale": 5810660874,
                        "id": "600103.SH"
                    },
                    {
                        "name": "民丰特纸",
                        "scale": 2.019975E+9,
                        "id": "600235.SH"
                    },
                    {
                        "name": "华泰股份",
                        "scale": 6806883073,
                        "id": "600308.SH"
                    },
                    {
                        "name": "恒丰纸业",
                        "scale": 2109043529,
                        "id": "600356.SH"
                    },
                    {
                        "name": "冠豪高新",
                        "scale": 5570205716,
                        "id": "600433.SH"
                    },
                    {
                        "name": "山鹰国际",
                        "scale": 12509844095,
                        "id": "600567.SH"
                    },
                    {
                        "name": "宜宾纸业",
                        "scale": 2444813308,
                        "id": "600793.SH"
                    },
                    {
                        "name": "岳阳林纸",
                        "scale": 9707792397,
                        "id": "600963.SH"
                    },
                    {
                        "name": "博汇纸业",
                        "scale": 9852542403,
                        "id": "600966.SH"
                    },
                    {
                        "name": "荣晟环保",
                        "scale": 3.98435156E+9,
                        "id": "603165.SH"
                    },
                    {
                        "name": "仙鹤股份",
                        "scale": 18708276418,
                        "id": "603733.SH"
                    },
                    {
                        "name": "松炀资源",
                        "scale": 1.9503145E+9,
                        "id": "603863.SH"
                    },
                    {
                        "name": "五洲特纸",
                        "scale": 1.37955876E+9,
                        "id": "605007.SH"
                    },
                    {
                        "name": "豪悦护理",
                        "scale": 2041263603,
                        "id": "605009.SH"
                    },
                    {
                        "name": "华旺科技",
                        "scale": 2.708348E+9,
                        "id": "605377.SH"
                    },
                    {
                        "name": "森林包装",
                        "scale": 8.04121E+8,
                        "id": "605500.SH"
                    }
                ],
                "name": "造纸",
                "scale": 1.6728969347E+11,
                "id": "360100"
            },
            {
                "children": [
                    {
                        "name": "珠海中富",
                        "scale": 4962811727,
                        "id": "000659.SZ"
                    },
                    {
                        "name": "滨海能源",
                        "scale": 2192824043,
                        "id": "000695.SZ"
                    },
                    {
                        "name": "陕西金叶",
                        "scale": 4893167626,
                        "id": "000812.SZ"
                    },
                    {
                        "name": "永新股份",
                        "scale": 4985277371,
                        "id": "002014.SZ"
                    },
                    {
                        "name": "东港股份",
                        "scale": 4353019345,
                        "id": "002117.SZ"
                    },
                    {
                        "name": "劲嘉股份",
                        "scale": 13864369535,
                        "id": "002191.SZ"
                    },
                    {
                        "name": "合兴包装",
                        "scale": 4234566782,
                        "id": "002228.SZ"
                    },
                    {
                        "name": "鸿博股份",
                        "scale": 3989563665,
                        "id": "002229.SZ"
                    },
                    {
                        "name": "力合科创",
                        "scale": 6283570504,
                        "id": "002243.SZ"
                    },
                    {
                        "name": "美盈森",
                        "scale": 3.41809915E+9,
                        "id": "002303.SZ"
                    },
                    {
                        "name": "浙江众成",
                        "scale": 5293090371,
                        "id": "002522.SZ"
                    },
                    {
                        "name": "顺灏股份",
                        "scale": 4610762541,
                        "id": "002565.SZ"
                    },
                    {
                        "name": "双星新材",
                        "scale": 21289731377,
                        "id": "002585.SZ"
                    },
                    {
                        "name": "盛通股份",
                        "scale": 2.08616239E+9,
                        "id": "002599.SZ"
                    },
                    {
                        "name": "奥瑞金",
                        "scale": 12418154885,
                        "id": "002701.SZ"
                    },
                    {
                        "name": "王子新材",
                        "scale": 3.23466502E+9,
                        "id": "002735.SZ"
                    },
                    {
                        "name": "昇兴股份",
                        "scale": 5052889881,
                        "id": "002752.SZ"
                    },
                    {
                        "name": "华源控股",
                        "scale": 1445944346,
                        "id": "002787.SZ"
                    },
                    {
                        "name": "环球印务",
                        "scale": 3.09954834E+9,
                        "id": "002799.SZ"
                    },
                    {
                        "name": "吉宏股份",
                        "scale": 3470996593,
                        "id": "002803.SZ"
                    },
                    {
                        "name": "裕同科技",
                        "scale": 14400536032,
                        "id": "002831.SZ"
                    },
                    {
                        "name": "新宏泽",
                        "scale": 1.70112E+9,
                        "id": "002836.SZ"
                    },
                    {
                        "name": "英联股份",
                        "scale": 1544349419,
                        "id": "002846.SZ"
                    },
                    {
                        "name": "金时科技",
                        "scale": 3.97305E+9,
                        "id": "002951.SZ"
                    },
                    {
                        "name": "嘉美包装",
                        "scale": 1816827473,
                        "id": "002969.SZ"
                    },
                    {
                        "name": "天元股份",
                        "scale": 8.8471737E+8,
                        "id": "003003.SZ"
                    },
                    {
                        "name": "金富科技",
                        "scale": 737847009,
                        "id": "003018.SZ"
                    },
                    {
                        "name": "万顺新材",
                        "scale": 6270358246,
                        "id": "300057.SZ"
                    },
                    {
                        "name": "海顺新材",
                        "scale": 1.97308502E+9,
                        "id": "300501.SZ"
                    },
                    {
                        "name": "锦盛新材",
                        "scale": 1.03357058E+9,
                        "id": "300849.SZ"
                    },
                    {
                        "name": "龙利得",
                        "scale": 1663760926,
                        "id": "300883.SZ"
                    },
                    {
                        "name": "嘉亨家化",
                        "scale": 1095973481,
                        "id": "300955.SZ"
                    },
                    {
                        "name": "康欣新材",
                        "scale": 3547525962,
                        "id": "600076.SH"
                    },
                    {
                        "name": "紫江企业",
                        "scale": 9388596818,
                        "id": "600210.SH"
                    },
                    {
                        "name": "上海易连",
                        "scale": 3910243125,
                        "id": "600836.SH"
                    },
                    {
                        "name": "东风股份",
                        "scale": 8256212478,
                        "id": "601515.SH"
                    },
                    {
                        "name": "宝钢包装",
                        "scale": 7820344238,
                        "id": "601968.SH"
                    },
                    {
                        "name": "新通联",
                        "scale": 2.176E+9,
                        "id": "603022.SH"
                    },
                    {
                        "name": "永吉股份",
                        "scale": 3503461984,
                        "id": "603058.SH"
                    },
                    {
                        "name": "集友股份",
                        "scale": 7043839795,
                        "id": "603429.SH"
                    },
                    {
                        "name": "翔港科技",
                        "scale": 1665550508,
                        "id": "603499.SH"
                    },
                    {
                        "name": "京华激光",
                        "scale": 2567071584,
                        "id": "603607.SH"
                    },
                    {
                        "name": "大胜达",
                        "scale": 4635262977,
                        "id": "603687.SH"
                    }
                ],
                "name": "包装印刷",
                "scale": 206788520517,
                "id": "360200"
            },
            {
                "children": [
                    {
                        "name": "飞亚达",
                        "scale": 3.74893712E+9,
                        "id": "000026.SZ"
                    },
                    {
                        "name": "*ST金洲",
                        "scale": 1965079197,
                        "id": "000587.SZ"
                    },
                    {
                        "name": "永安林业",
                        "scale": 2870012569,
                        "id": "000663.SZ"
                    },
                    {
                        "name": "大亚圣象",
                        "scale": 4.77640998E+9,
                        "id": "000910.SZ"
                    },
                    {
                        "name": "双枪科技",
                        "scale": 959386737,
                        "id": "001211.SZ"
                    },
                    {
                        "name": "海鸥住工",
                        "scale": 2583390336,
                        "id": "002084.SZ"
                    },
                    {
                        "name": "盛新锂能",
                        "scale": 39728258077,
                        "id": "002240.SZ"
                    },
                    {
                        "name": "齐心集团",
                        "scale": 5204186807,
                        "id": "002301.SZ"
                    },
                    {
                        "name": "潮宏基",
                        "scale": 4096154603,
                        "id": "002345.SZ"
                    },
                    {
                        "name": "高乐股份",
                        "scale": 2152680488,
                        "id": "002348.SZ"
                    },
                    {
                        "name": "赫美集团",
                        "scale": 6936536416,
                        "id": "002356.SZ"
                    },
                    {
                        "name": "浙江永强",
                        "scale": 6.52867271E+9,
                        "id": "002489.SZ"
                    },
                    {
                        "name": "德力股份",
                        "scale": 2449093803,
                        "id": "002571.SZ"
                    },
                    {
                        "name": "索菲亚",
                        "scale": 10832281119,
                        "id": "002572.SZ"
                    },
                    {
                        "name": "明牌珠宝",
                        "scale": 2.74032E+9,
                        "id": "002574.SZ"
                    },
                    {
                        "name": "群兴玩具",
                        "scale": 3.6677256E+9,
                        "id": "002575.SZ"
                    },
                    {
                        "name": "姚记科技",
                        "scale": 4792658327,
                        "id": "002605.SZ"
                    },
                    {
                        "name": "哈尔斯",
                        "scale": 1615507306,
                        "id": "002615.SZ"
                    },
                    {
                        "name": "德尔未来",
                        "scale": 4.28313879E+9,
                        "id": "002631.SZ"
                    },
                    {
                        "name": "珠江钢琴",
                        "scale": 7806053076,
                        "id": "002678.SZ"
                    },
                    {
                        "name": "金一文化",
                        "scale": 3494130192,
                        "id": "002721.SZ"
                    },
                    {
                        "name": "萃华珠宝",
                        "scale": 5248507424,
                        "id": "002731.SZ"
                    },
                    {
                        "name": "ST爱迪尔",
                        "scale": 1175401738,
                        "id": "002740.SZ"
                    },
                    {
                        "name": "瑞尔特",
                        "scale": 2330806252,
                        "id": "002790.SZ"
                    },
                    {
                        "name": "皮阿诺",
                        "scale": 1737182274,
                        "id": "002853.SZ"
                    },
                    {
                        "name": "实丰文化",
                        "scale": 1008633433,
                        "id": "002862.SZ"
                    },
                    {
                        "name": "周大生",
                        "scale": 14758328533,
                        "id": "002867.SZ"
                    },
                    {
                        "name": "英派斯",
                        "scale": 1515581055,
                        "id": "002899.SZ"
                    },
                    {
                        "name": "海象新材",
                        "scale": 1118664524,
                        "id": "003011.SZ"
                    },
                    {
                        "name": "海伦钢琴",
                        "scale": 1813242368,
                        "id": "300329.SZ"
                    },
                    {
                        "name": "尚品宅配",
                        "scale": 3003291047,
                        "id": "300616.SZ"
                    },
                    {
                        "name": "德艺文创",
                        "scale": 1.20841225E+9,
                        "id": "300640.SZ"
                    },
                    {
                        "name": "金陵体育",
                        "scale": 1841397167,
                        "id": "300651.SZ"
                    },
                    {
                        "name": "创源股份",
                        "scale": 1770181919,
                        "id": "300703.SZ"
                    },
                    {
                        "name": "乐歌股份",
                        "scale": 3234707011,
                        "id": "300729.SZ"
                    },
                    {
                        "name": "顶固集创",
                        "scale": 1217737047,
                        "id": "300749.SZ"
                    },
                    {
                        "name": "曼卡龙",
                        "scale": 1.31171283E+9,
                        "id": "300945.SZ"
                    },
                    {
                        "name": "玉马遮阳",
                        "scale": 1.02675078E+9,
                        "id": "300993.SZ"
                    },
                    {
                        "name": "嘉益股份",
                        "scale": 7.815E+8,
                        "id": "301004.SZ"
                    },
                    {
                        "name": "张小泉",
                        "scale": 575171268,
                        "id": "301055.SZ"
                    },
                    {
                        "name": "匠心家居",
                        "scale": 9.4752E+8,
                        "id": "301061.SZ"
                    },
                    {
                        "name": "雅艺科技",
                        "scale": 6.24575E+8,
                        "id": "301113.SZ"
                    },
                    {
                        "name": "家联科技",
                        "scale": 857232348,
                        "id": "301193.SZ"
                    },
                    {
                        "name": "乐凯胶片",
                        "scale": 3516226796,
                        "id": "600135.SH"
                    },
                    {
                        "name": "美克家居",
                        "scale": 4.88498166E+9,
                        "id": "600337.SH"
                    },
                    {
                        "name": "瑞贝卡",
                        "scale": 3090320251,
                        "id": "600439.SH"
                    },
                    {
                        "name": "狮头股份",
                        "scale": 1.5709E+9,
                        "id": "600539.SH"
                    },
                    {
                        "name": "老凤祥",
                        "scale": 11891611125,
                        "id": "600612.SH"
                    },
                    {
                        "name": "新华锦",
                        "scale": 2575547228,
                        "id": "600735.SH"
                    },
                    {
                        "name": "中国黄金",
                        "scale": 1.40176575E+10,
                        "id": "600916.SH"
                    },
                    {
                        "name": "丰林集团",
                        "scale": 3402499716,
                        "id": "601996.SH"
                    },
                    {
                        "name": "喜临门",
                        "scale": 1.144044725E+10,
                        "id": "603008.SH"
                    },
                    {
                        "name": "山东华鹏",
                        "scale": 1721320617,
                        "id": "603021.SH"
                    },
                    {
                        "name": "倍加洁",
                        "scale": 1.996E+9,
                        "id": "603059.SH"
                    },
                    {
                        "name": "金牌厨柜",
                        "scale": 3487707942,
                        "id": "603180.SH"
                    },
                    {
                        "name": "公牛集团",
                        "scale": 10653941012,
                        "id": "603195.SH"
                    },
                    {
                        "name": "江山欧派",
                        "scale": 5.38828468E+9,
                        "id": "603208.SH"
                    },
                    {
                        "name": "梦天家居",
                        "scale": 8.270784E+8,
                        "id": "603216.SH"
                    },
                    {
                        "name": "爱丽家居",
                        "scale": 5.337288E+8,
                        "id": "603221.SH"
                    },
                    {
                        "name": "菲林格尔",
                        "scale": 1912545723,
                        "id": "603226.SH"
                    },
                    {
                        "name": "内蒙新华",
                        "scale": 1.01991674E+9,
                        "id": "603230.SH"
                    },
                    {
                        "name": "松发股份",
                        "scale": 2242488528,
                        "id": "603268.SH"
                    },
                    {
                        "name": "梦百合",
                        "scale": 6003149112,
                        "id": "603313.SH"
                    },
                    {
                        "name": "我乐家居",
                        "scale": 2470464284,
                        "id": "603326.SH"
                    },
                    {
                        "name": "惠达卫浴",
                        "scale": 2.71739221E+9,
                        "id": "603385.SH"
                    },
                    {
                        "name": "亚振家居",
                        "scale": 1.51870656E+9,
                        "id": "603389.SH"
                    },
                    {
                        "name": "沐邦高科",
                        "scale": 15384289364,
                        "id": "603398.SH"
                    },
                    {
                        "name": "建霖家居",
                        "scale": 1322612416,
                        "id": "603408.SH"
                    },
                    {
                        "name": "永艺股份",
                        "scale": 2737739392,
                        "id": "603600.SH"
                    },
                    {
                        "name": "麒盛科技",
                        "scale": 2671305651,
                        "id": "603610.SH"
                    },
                    {
                        "name": "恒林股份",
                        "scale": 3871626143,
                        "id": "603661.SH"
                    },
                    {
                        "name": "中源家居",
                        "scale": 1.3736E+9,
                        "id": "603709.SH"
                    },
                    {
                        "name": "志邦家居",
                        "scale": 6284599338,
                        "id": "603801.SH"
                    },
                    {
                        "name": "顾家家居",
                        "scale": 37075526422,
                        "id": "603816.SH"
                    },
                    {
                        "name": "曲美家居",
                        "scale": 4933362141,
                        "id": "603818.SH"
                    },
                    {
                        "name": "欧派家居",
                        "scale": 72245421033,
                        "id": "603833.SH"
                    },
                    {
                        "name": "四通股份",
                        "scale": 1.73168128E+9,
                        "id": "603838.SH"
                    },
                    {
                        "name": "好太太",
                        "scale": 6.03505E+9,
                        "id": "603848.SH"
                    },
                    {
                        "name": "好莱客",
                        "scale": 3433388277,
                        "id": "603898.SH"
                    },
                    {
                        "name": "晨光股份",
                        "scale": 42126575952,
                        "id": "603899.SH"
                    },
                    {
                        "name": "松霖科技",
                        "scale": 6.70656E+8,
                        "id": "603992.SH"
                    },
                    {
                        "name": "王力安防",
                        "scale": 7.542132E+8,
                        "id": "605268.SH"
                    },
                    {
                        "name": "舒华体育",
                        "scale": 1105988532,
                        "id": "605299.SH"
                    },
                    {
                        "name": "龙竹科技",
                        "scale": 735801112,
                        "id": "831445.BJ"
                    }
                ],
                "name": "家用轻工",
                "scale": 475713501908,
                "id": "360300"
            },
            {
                "children": [
                    {
                        "name": "*ST易尚",
                        "scale": 1161263155,
                        "id": "002751.SZ"
                    },
                    {
                        "name": "可孚医疗",
                        "scale": 2088127616,
                        "id": "301087.SZ"
                    },
                    {
                        "name": "共创草坪",
                        "scale": 9.830068E+8,
                        "id": "605099.SH"
                    }
                ],
                "name": "其他轻工制造",
                "scale": 4232397571,
                "id": "360400"
            }
        ],
        "name": "轻工制造",
        "scale": 854024113466,
        "id": "360000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "丰原药业",
                        "scale": 2567572603,
                        "id": "000153.SZ"
                    },
                    {
                        "name": "丽珠集团",
                        "scale": 19466629157,
                        "id": "000513.SZ"
                    },
                    {
                        "name": "海南海药",
                        "scale": 5267563889,
                        "id": "000566.SZ"
                    },
                    {
                        "name": "东北制药",
                        "scale": 6897138464,
                        "id": "000597.SZ"
                    },
                    {
                        "name": "吉林敖东",
                        "scale": 16635283219,
                        "id": "000623.SZ"
                    },
                    {
                        "name": "普洛药业",
                        "scale": 22678110667,
                        "id": "000739.SZ"
                    },
                    {
                        "name": "新华制药",
                        "scale": 8879370852,
                        "id": "000756.SZ"
                    },
                    {
                        "name": "通化金马",
                        "scale": 4060587861,
                        "id": "000766.SZ"
                    },
                    {
                        "name": "北大医药",
                        "scale": 4338788454,
                        "id": "000788.SZ"
                    },
                    {
                        "name": "德展健康",
                        "scale": 7051751989,
                        "id": "000813.SZ"
                    },
                    {
                        "name": "景峰医药",
                        "scale": 2518879485,
                        "id": "000908.SZ"
                    },
                    {
                        "name": "华特达因",
                        "scale": 10551187192,
                        "id": "000915.SZ"
                    },
                    {
                        "name": "中 关 村",
                        "scale": 5036795879,
                        "id": "000931.SZ"
                    },
                    {
                        "name": "广济药业",
                        "scale": 2264654504,
                        "id": "000952.SZ"
                    },
                    {
                        "name": "华东医药",
                        "scale": 75376791155,
                        "id": "000963.SZ"
                    },
                    {
                        "name": "新 和 成",
                        "scale": 64633921539,
                        "id": "002001.SZ"
                    },
                    {
                        "name": "亿帆医药",
                        "scale": 10527489059,
                        "id": "002019.SZ"
                    },
                    {
                        "name": "京新药业",
                        "scale": 5960118973,
                        "id": "002020.SZ"
                    },
                    {
                        "name": "海翔药业",
                        "scale": 11166161865,
                        "id": "002099.SZ"
                    },
                    {
                        "name": "ST冠福",
                        "scale": 8003533202,
                        "id": "002102.SZ"
                    },
                    {
                        "name": "恩华药业",
                        "scale": 13191123242,
                        "id": "002262.SZ"
                    },
                    {
                        "name": "信立泰",
                        "scale": 28531254579,
                        "id": "002294.SZ"
                    },
                    {
                        "name": "仙琚制药",
                        "scale": 9027964447,
                        "id": "002332.SZ"
                    },
                    {
                        "name": "永安药业",
                        "scale": 2801781935,
                        "id": "002365.SZ"
                    },
                    {
                        "name": "亚太药业",
                        "scale": 2768496639,
                        "id": "002370.SZ"
                    },
                    {
                        "name": "力生制药",
                        "scale": 3935554177,
                        "id": "002393.SZ"
                    },
                    {
                        "name": "海普瑞",
                        "scale": 19144546156,
                        "id": "002399.SZ"
                    },
                    {
                        "name": "*ST必康",
                        "scale": 13484079479,
                        "id": "002411.SZ"
                    },
                    {
                        "name": "科伦药业",
                        "scale": 25703028045,
                        "id": "002422.SZ"
                    },
                    {
                        "name": "长江健康",
                        "scale": 6081944358,
                        "id": "002435.SZ"
                    },
                    {
                        "name": "誉衡药业",
                        "scale": 5.94260525E+9,
                        "id": "002437.SZ"
                    },
                    {
                        "name": "千红制药",
                        "scale": 5031467281,
                        "id": "002550.SZ"
                    },
                    {
                        "name": "金达威",
                        "scale": 1.299970574E+10,
                        "id": "002626.SZ"
                    },
                    {
                        "name": "海思科",
                        "scale": 8291262743,
                        "id": "002653.SZ"
                    },
                    {
                        "name": "东诚药业",
                        "scale": 10608981236,
                        "id": "002675.SZ"
                    },
                    {
                        "name": "奥赛康",
                        "scale": 8.23271978E+9,
                        "id": "002755.SZ"
                    },
                    {
                        "name": "康弘药业",
                        "scale": 9994943322,
                        "id": "002773.SZ"
                    },
                    {
                        "name": "罗欣药业",
                        "scale": 3592024035,
                        "id": "002793.SZ"
                    },
                    {
                        "name": "凯莱英",
                        "scale": 59294023167,
                        "id": "002821.SZ"
                    },
                    {
                        "name": "赛隆药业",
                        "scale": 1204751778,
                        "id": "002898.SZ"
                    },
                    {
                        "name": "哈三联",
                        "scale": 2271348784,
                        "id": "002900.SZ"
                    },
                    {
                        "name": "润都股份",
                        "scale": 3.13890021E+9,
                        "id": "002923.SZ"
                    },
                    {
                        "name": "昂利康",
                        "scale": 3275369211,
                        "id": "002940.SZ"
                    },
                    {
                        "name": "立方制药",
                        "scale": 1384128125,
                        "id": "003020.SZ"
                    },
                    {
                        "name": "莱美药业",
                        "scale": 3427284702,
                        "id": "300006.SZ"
                    },
                    {
                        "name": "北陆药业",
                        "scale": 3023727148,
                        "id": "300016.SZ"
                    },
                    {
                        "name": "康芝药业",
                        "scale": 2762104124,
                        "id": "300086.SZ"
                    },
                    {
                        "name": "华仁药业",
                        "scale": 6173343505,
                        "id": "300110.SZ"
                    },
                    {
                        "name": "振东制药",
                        "scale": 6140915915,
                        "id": "300158.SZ"
                    },
                    {
                        "name": "福安药业",
                        "scale": 3.54616583E+9,
                        "id": "300194.SZ"
                    },
                    {
                        "name": "翰宇药业",
                        "scale": 7908995254,
                        "id": "300199.SZ"
                    },
                    {
                        "name": "金城医药",
                        "scale": 11008675805,
                        "id": "300233.SZ"
                    },
                    {
                        "name": "仟源医药",
                        "scale": 1512937092,
                        "id": "300254.SZ"
                    },
                    {
                        "name": "尔康制药",
                        "scale": 4828594759,
                        "id": "300267.SZ"
                    },
                    {
                        "name": "博腾股份",
                        "scale": 29362062451,
                        "id": "300363.SZ"
                    },
                    {
                        "name": "花园生物",
                        "scale": 9716646159,
                        "id": "300401.SZ"
                    },
                    {
                        "name": "金石亚药",
                        "scale": 2854646745,
                        "id": "300434.SZ"
                    },
                    {
                        "name": "广生堂",
                        "scale": 4346802598,
                        "id": "300436.SZ"
                    },
                    {
                        "name": "山河药辅",
                        "scale": 2756228891,
                        "id": "300452.SZ"
                    },
                    {
                        "name": "富祥药业",
                        "scale": 6032282334,
                        "id": "300497.SZ"
                    },
                    {
                        "name": "贝达药业",
                        "scale": 21552334765,
                        "id": "300558.SZ"
                    },
                    {
                        "name": "兴齐眼药",
                        "scale": 7038792502,
                        "id": "300573.SZ"
                    },
                    {
                        "name": "赛托生物",
                        "scale": 2787131351,
                        "id": "300583.SZ"
                    },
                    {
                        "name": "海辰药业",
                        "scale": 1792626575,
                        "id": "300584.SZ"
                    },
                    {
                        "name": "普利制药",
                        "scale": 9463111182,
                        "id": "300630.SZ"
                    },
                    {
                        "name": "同和药业",
                        "scale": 3819629562,
                        "id": "300636.SZ"
                    },
                    {
                        "name": "天宇股份",
                        "scale": 5754452616,
                        "id": "300702.SZ"
                    },
                    {
                        "name": "九典制药",
                        "scale": 4.50706265E+9,
                        "id": "300705.SZ"
                    },
                    {
                        "name": "一品红",
                        "scale": 3.56016281E+9,
                        "id": "300723.SZ"
                    },
                    {
                        "name": "药石科技",
                        "scale": 13948507836,
                        "id": "300725.SZ"
                    },
                    {
                        "name": "新诺威",
                        "scale": 8.43024E+9,
                        "id": "300765.SZ"
                    },
                    {
                        "name": "共同药业",
                        "scale": 2097508759,
                        "id": "300966.SZ"
                    },
                    {
                        "name": "金三江",
                        "scale": 8.215479E+8,
                        "id": "301059.SZ"
                    },
                    {
                        "name": "星华反光",
                        "scale": 7.2E+8,
                        "id": "301077.SZ"
                    },
                    {
                        "name": "风光股份",
                        "scale": 1.104E+9,
                        "id": "301100.SZ"
                    },
                    {
                        "name": "佳先股份",
                        "scale": 532037474,
                        "id": "430489.BJ"
                    },
                    {
                        "name": "华润双鹤",
                        "scale": 20871599194,
                        "id": "600062.SH"
                    },
                    {
                        "name": "人福医药",
                        "scale": 29587706523,
                        "id": "600079.SH"
                    },
                    {
                        "name": "江苏吴中",
                        "scale": 5.44577151E+9,
                        "id": "600200.SH"
                    },
                    {
                        "name": "浙江医药",
                        "scale": 13559891584,
                        "id": "600216.SH"
                    },
                    {
                        "name": "圣济堂",
                        "scale": 3885665823,
                        "id": "600227.SH"
                    },
                    {
                        "name": "海正药业",
                        "scale": 12752487494,
                        "id": "600267.SH"
                    },
                    {
                        "name": "恒瑞医药",
                        "scale": 238829845139,
                        "id": "600276.SH"
                    },
                    {
                        "name": "健康元",
                        "scale": 20998633669,
                        "id": "600380.SH"
                    },
                    {
                        "name": "国药现代",
                        "scale": 9355807095,
                        "id": "600420.SH"
                    },
                    {
                        "name": "天药股份",
                        "scale": 4684193857,
                        "id": "600488.SH"
                    },
                    {
                        "name": "联环药业",
                        "scale": 2751798443,
                        "id": "600513.SH"
                    },
                    {
                        "name": "华海药业",
                        "scale": 31856018261,
                        "id": "600521.SH"
                    },
                    {
                        "name": "神奇制药",
                        "scale": 2736917074,
                        "id": "600613.SH"
                    },
                    {
                        "name": "哈药股份",
                        "scale": 7266096309,
                        "id": "600664.SH"
                    },
                    {
                        "name": "东阳光",
                        "scale": 31897933503,
                        "id": "600673.SH"
                    },
                    {
                        "name": "*ST辅仁",
                        "scale": 1242553897,
                        "id": "600781.SH"
                    },
                    {
                        "name": "鲁抗医药",
                        "scale": 5725516927,
                        "id": "600789.SH"
                    },
                    {
                        "name": "华北制药",
                        "scale": 10094681273,
                        "id": "600812.SH"
                    },
                    {
                        "name": "海欣股份",
                        "scale": 5507017581,
                        "id": "600851.SH"
                    },
                    {
                        "name": "圣达生物",
                        "scale": 2.32303416E+9,
                        "id": "603079.SH"
                    },
                    {
                        "name": "莎普爱思",
                        "scale": 2632354792,
                        "id": "603168.SH"
                    },
                    {
                        "name": "济民医疗",
                        "scale": 4961224892,
                        "id": "603222.SH"
                    },
                    {
                        "name": "奥翔药业",
                        "scale": 13189265225,
                        "id": "603229.SH"
                    },
                    {
                        "name": "威尔药业",
                        "scale": 2850715358,
                        "id": "603351.SH"
                    },
                    {
                        "name": "九洲药业",
                        "scale": 35711514855,
                        "id": "603456.SH"
                    },
                    {
                        "name": "司太立",
                        "scale": 7637836794,
                        "id": "603520.SH"
                    },
                    {
                        "name": "美诺华",
                        "scale": 6066491738,
                        "id": "603538.SH"
                    },
                    {
                        "name": "灵康药业",
                        "scale": 4572583808,
                        "id": "603669.SH"
                    },
                    {
                        "name": "卫信康",
                        "scale": 5.569876E+9,
                        "id": "603676.SH"
                    },
                    {
                        "name": "健友股份",
                        "scale": 30936281926,
                        "id": "603707.SH"
                    },
                    {
                        "name": "诚意药业",
                        "scale": 3434357472,
                        "id": "603811.SH"
                    },
                    {
                        "name": "美邦股份",
                        "scale": 7.03378E+8,
                        "id": "605033.SH"
                    },
                    {
                        "name": "奥锐特",
                        "scale": 1855175488,
                        "id": "605116.SH"
                    },
                    {
                        "name": "东亚药业",
                        "scale": 1188552929,
                        "id": "605177.SH"
                    },
                    {
                        "name": "国邦医药",
                        "scale": 3935009765,
                        "id": "605507.SH"
                    },
                    {
                        "name": "福莱蒽特",
                        "scale": 8.96846E+8,
                        "id": "605566.SH"
                    },
                    {
                        "name": "迈威生物-U",
                        "scale": 1584158352,
                        "id": "688062.SH"
                    },
                    {
                        "name": "上海谊众-U",
                        "scale": 3709282612,
                        "id": "688091.SH"
                    },
                    {
                        "name": "圣诺生物",
                        "scale": 1313533431,
                        "id": "688117.SH"
                    },
                    {
                        "name": "博瑞医药",
                        "scale": 4821465945,
                        "id": "688166.SH"
                    },
                    {
                        "name": "亚虹医药-U",
                        "scale": 1.286802E+9,
                        "id": "688176.SH"
                    },
                    {
                        "name": "南新制药",
                        "scale": 2.842E+9,
                        "id": "688189.SH"
                    },
                    {
                        "name": "迪哲医药-U",
                        "scale": 1134126835,
                        "id": "688192.SH"
                    },
                    {
                        "name": "前沿生物-U",
                        "scale": 2782084331,
                        "id": "688221.SH"
                    },
                    {
                        "name": "泽璟制药-U",
                        "scale": 5.17984147E+9,
                        "id": "688266.SH"
                    },
                    {
                        "name": "微芯生物",
                        "scale": 1.147553077E+10,
                        "id": "688321.SH"
                    },
                    {
                        "name": "键凯科技",
                        "scale": 8136770369,
                        "id": "688356.SH"
                    },
                    {
                        "name": "复旦张江",
                        "scale": 2726717295,
                        "id": "688505.SH"
                    },
                    {
                        "name": "苑东生物",
                        "scale": 3546608012,
                        "id": "688513.SH"
                    },
                    {
                        "name": "汇宇制药-W",
                        "scale": 1213819149,
                        "id": "688553.SH"
                    },
                    {
                        "name": "吉贝尔",
                        "scale": 1550927034,
                        "id": "688566.SH"
                    },
                    {
                        "name": "艾力斯-U",
                        "scale": 3864798015,
                        "id": "688578.SH"
                    },
                    {
                        "name": "悦康药业",
                        "scale": 3376641414,
                        "id": "688658.SH"
                    },
                    {
                        "name": "纳微科技",
                        "scale": 12970406188,
                        "id": "688690.SH"
                    },
                    {
                        "name": "博拓生物",
                        "scale": 1408541133,
                        "id": "688767.SH"
                    },
                    {
                        "name": "华纳药厂",
                        "scale": 1.83473221E+9,
                        "id": "688799.SH"
                    },
                    {
                        "name": "齐鲁华信",
                        "scale": 567513893,
                        "id": "830832.BJ"
                    },
                    {
                        "name": "森萱医药",
                        "scale": 3981048862,
                        "id": "830946.BJ"
                    }
                ],
                "name": "化学制药",
                "scale": 1415966876699,
                "id": "370100"
            },
            {
                "children": [
                    {
                        "name": "东阿阿胶",
                        "scale": 24336141392,
                        "id": "000423.SZ"
                    },
                    {
                        "name": "云南白药",
                        "scale": 46641530921,
                        "id": "000538.SZ"
                    },
                    {
                        "name": "启迪药业",
                        "scale": 2.13044842E+9,
                        "id": "000590.SZ"
                    },
                    {
                        "name": "仁和药业",
                        "scale": 8145887209,
                        "id": "000650.SZ"
                    },
                    {
                        "name": "华神科技",
                        "scale": 2933876285,
                        "id": "000790.SZ"
                    },
                    {
                        "name": "金陵药业",
                        "scale": 3759385576,
                        "id": "000919.SZ"
                    },
                    {
                        "name": "九 芝 堂",
                        "scale": 5908686978,
                        "id": "000989.SZ"
                    },
                    {
                        "name": "华润三九",
                        "scale": 36807231487,
                        "id": "000999.SZ"
                    },
                    {
                        "name": "沃华医药",
                        "scale": 3395006512,
                        "id": "002107.SZ"
                    },
                    {
                        "name": "紫鑫药业",
                        "scale": 3329764828,
                        "id": "002118.SZ"
                    },
                    {
                        "name": "嘉应制药",
                        "scale": 2908031429,
                        "id": "002198.SZ"
                    },
                    {
                        "name": "桂林三金",
                        "scale": 7318122199,
                        "id": "002275.SZ"
                    },
                    {
                        "name": "奇正藏药",
                        "scale": 12584907186,
                        "id": "002287.SZ"
                    },
                    {
                        "name": "众生药业",
                        "scale": 10820395697,
                        "id": "002317.SZ"
                    },
                    {
                        "name": "精华制药",
                        "scale": 10384407155,
                        "id": "002349.SZ"
                    },
                    {
                        "name": "信邦制药",
                        "scale": 8764419031,
                        "id": "002390.SZ"
                    },
                    {
                        "name": "汉森制药",
                        "scale": 2.843352E+9,
                        "id": "002412.SZ"
                    },
                    {
                        "name": "贵州百灵",
                        "scale": 6692140484,
                        "id": "002424.SZ"
                    },
                    {
                        "name": "太安堂",
                        "scale": 3104088056,
                        "id": "002433.SZ"
                    },
                    {
                        "name": "益盛药业",
                        "scale": 1804719454,
                        "id": "002566.SZ"
                    },
                    {
                        "name": "以岭药业",
                        "scale": 30726057536,
                        "id": "002603.SZ"
                    },
                    {
                        "name": "佛慈制药",
                        "scale": 4.41718305E+9,
                        "id": "002644.SZ"
                    },
                    {
                        "name": "特一药业",
                        "scale": 1.98785159E+9,
                        "id": "002728.SZ"
                    },
                    {
                        "name": "葵花药业",
                        "scale": 1.08624E+10,
                        "id": "002737.SZ"
                    },
                    {
                        "name": "龙津药业",
                        "scale": 4089243909,
                        "id": "002750.SZ"
                    },
                    {
                        "name": "黄山胶囊",
                        "scale": 2334816325,
                        "id": "002817.SZ"
                    },
                    {
                        "name": "易明医药",
                        "scale": 1875065871,
                        "id": "002826.SZ"
                    },
                    {
                        "name": "盘龙药业",
                        "scale": 1898444297,
                        "id": "002864.SZ"
                    },
                    {
                        "name": "新天药业",
                        "scale": 2430913894,
                        "id": "002873.SZ"
                    },
                    {
                        "name": "华森制药",
                        "scale": 3658949878,
                        "id": "002907.SZ"
                    },
                    {
                        "name": "红日药业",
                        "scale": 16467572511,
                        "id": "300026.SZ"
                    },
                    {
                        "name": "上海凯宝",
                        "scale": 5444406162,
                        "id": "300039.SZ"
                    },
                    {
                        "name": "*ST吉药",
                        "scale": 1017483844,
                        "id": "300108.SZ"
                    },
                    {
                        "name": "香雪制药",
                        "scale": 3696644071,
                        "id": "300147.SZ"
                    },
                    {
                        "name": "佐力药业",
                        "scale": 4667756274,
                        "id": "300181.SZ"
                    },
                    {
                        "name": "新光药业",
                        "scale": 1.866676E+9,
                        "id": "300519.SZ"
                    },
                    {
                        "name": "陇神戎发",
                        "scale": 2714097669,
                        "id": "300534.SZ"
                    },
                    {
                        "name": "维康药业",
                        "scale": 864621896,
                        "id": "300878.SZ"
                    },
                    {
                        "name": "金花股份",
                        "scale": 2911508223,
                        "id": "600080.SH"
                    },
                    {
                        "name": "同仁堂",
                        "scale": 67764345645,
                        "id": "600085.SH"
                    },
                    {
                        "name": "太极集团",
                        "scale": 15398029072,
                        "id": "600129.SH"
                    },
                    {
                        "name": "西藏药业",
                        "scale": 9.83817361E+9,
                        "id": "600211.SH"
                    },
                    {
                        "name": "太龙药业",
                        "scale": 3282629539,
                        "id": "600222.SH"
                    },
                    {
                        "name": "中恒集团",
                        "scale": 9559675369,
                        "id": "600252.SH"
                    },
                    {
                        "name": "羚锐制药",
                        "scale": 7148283408,
                        "id": "600285.SH"
                    },
                    {
                        "name": "达仁堂",
                        "scale": 12483049757,
                        "id": "600329.SH"
                    },
                    {
                        "name": "白云山",
                        "scale": 39196239658,
                        "id": "600332.SH"
                    },
                    {
                        "name": "亚宝药业",
                        "scale": 4781700143,
                        "id": "600351.SH"
                    },
                    {
                        "name": "昆药集团",
                        "scale": 8712790963,
                        "id": "600422.SH"
                    },
                    {
                        "name": "片仔癀",
                        "scale": 181001196172,
                        "id": "600436.SH"
                    },
                    {
                        "name": "千金药业",
                        "scale": 3908856473,
                        "id": "600479.SH"
                    },
                    {
                        "name": "ST康美",
                        "scale": 29131666145,
                        "id": "600518.SH"
                    },
                    {
                        "name": "天士力",
                        "scale": 15521896346,
                        "id": "600535.SH"
                    },
                    {
                        "name": "国发股份",
                        "scale": 2703953899,
                        "id": "600538.SH"
                    },
                    {
                        "name": "康缘药业",
                        "scale": 7995069564,
                        "id": "600557.SH"
                    },
                    {
                        "name": "济川药业",
                        "scale": 22366938015,
                        "id": "600566.SH"
                    },
                    {
                        "name": "康恩贝",
                        "scale": 10765840957,
                        "id": "600572.SH"
                    },
                    {
                        "name": "益佰制药",
                        "scale": 4.23681159E+9,
                        "id": "600594.SH"
                    },
                    {
                        "name": "ST目药",
                        "scale": 982284701,
                        "id": "600671.SH"
                    },
                    {
                        "name": "江中药业",
                        "scale": 1.009237208E+10,
                        "id": "600750.SH"
                    },
                    {
                        "name": "广誉远",
                        "scale": 1.487315084E+10,
                        "id": "600771.SH"
                    },
                    {
                        "name": "健民集团",
                        "scale": 6660658596,
                        "id": "600976.SH"
                    },
                    {
                        "name": "马应龙",
                        "scale": 9242994704,
                        "id": "600993.SH"
                    },
                    {
                        "name": "康惠制药",
                        "scale": 2.417096E+9,
                        "id": "603139.SH"
                    },
                    {
                        "name": "贵州三力",
                        "scale": 2038281715,
                        "id": "603439.SH"
                    },
                    {
                        "name": "珍宝岛",
                        "scale": 11039813298,
                        "id": "603567.SH"
                    },
                    {
                        "name": "步长制药",
                        "scale": 21404636438,
                        "id": "603858.SH"
                    },
                    {
                        "name": "寿仙谷",
                        "scale": 6933481399,
                        "id": "603896.SH"
                    },
                    {
                        "name": "大理药业",
                        "scale": 3.640429E+9,
                        "id": "603963.SH"
                    },
                    {
                        "name": "方盛制药",
                        "scale": 2662464264,
                        "id": "603998.SH"
                    },
                    {
                        "name": "葫芦娃",
                        "scale": 1610127972,
                        "id": "605199.SH"
                    }
                ],
                "name": "中药",
                "scale": 857939172631,
                "id": "370200"
            },
            {
                "children": [
                    {
                        "name": "派林生物",
                        "scale": 12443499033,
                        "id": "000403.SZ"
                    },
                    {
                        "name": "南华生物",
                        "scale": 4532722003,
                        "id": "000504.SZ"
                    },
                    {
                        "name": "四环生物",
                        "scale": 3232742076,
                        "id": "000518.SZ"
                    },
                    {
                        "name": "万泽股份",
                        "scale": 7051404223,
                        "id": "000534.SZ"
                    },
                    {
                        "name": "长春高新",
                        "scale": 87474314722,
                        "id": "000661.SZ"
                    },
                    {
                        "name": "华兰生物",
                        "scale": 32301320713,
                        "id": "002007.SZ"
                    },
                    {
                        "name": "双鹭药业",
                        "scale": 7994675522,
                        "id": "002038.SZ"
                    },
                    {
                        "name": "莱茵生物",
                        "scale": 5625261781,
                        "id": "002166.SZ"
                    },
                    {
                        "name": "上海莱士",
                        "scale": 29386173021,
                        "id": "002252.SZ"
                    },
                    {
                        "name": "未名医药",
                        "scale": 7214240898,
                        "id": "002581.SZ"
                    },
                    {
                        "name": "双成药业",
                        "scale": 2092174546,
                        "id": "002693.SZ"
                    },
                    {
                        "name": "卫光生物",
                        "scale": 5.776596E+9,
                        "id": "002880.SZ"
                    },
                    {
                        "name": "安科生物",
                        "scale": 11179906739,
                        "id": "300009.SZ"
                    },
                    {
                        "name": "智飞生物",
                        "scale": 9.071584806E+10,
                        "id": "300122.SZ"
                    },
                    {
                        "name": "沃森生物",
                        "scale": 68967490366,
                        "id": "300142.SZ"
                    },
                    {
                        "name": "舒泰神",
                        "scale": 5795850601,
                        "id": "300204.SZ"
                    },
                    {
                        "name": "东宝生物",
                        "scale": 4.3259812E+9,
                        "id": "300239.SZ"
                    },
                    {
                        "name": "常山药业",
                        "scale": 4170642606,
                        "id": "300255.SZ"
                    },
                    {
                        "name": "博雅生物",
                        "scale": 14545856566,
                        "id": "300294.SZ"
                    },
                    {
                        "name": "我武生物",
                        "scale": 22345724492,
                        "id": "300357.SZ"
                    },
                    {
                        "name": "溢多利",
                        "scale": 4670878048,
                        "id": "300381.SZ"
                    },
                    {
                        "name": "赛升药业",
                        "scale": 3211897667,
                        "id": "300485.SZ"
                    },
                    {
                        "name": "康泰生物",
                        "scale": 31283099509,
                        "id": "300601.SZ"
                    },
                    {
                        "name": "海特生物",
                        "scale": 5437624564,
                        "id": "300683.SZ"
                    },
                    {
                        "name": "康华生物",
                        "scale": 9.37961592E+9,
                        "id": "300841.SZ"
                    },
                    {
                        "name": "义翘神州",
                        "scale": 3.748415E+9,
                        "id": "301047.SZ"
                    },
                    {
                        "name": "百普赛斯",
                        "scale": 3.0254E+9,
                        "id": "301080.SZ"
                    },
                    {
                        "name": "天坛生物",
                        "scale": 34818215538,
                        "id": "600161.SH"
                    },
                    {
                        "name": "复星医药",
                        "scale": 88301167756,
                        "id": "600196.SH"
                    },
                    {
                        "name": "交大昂立",
                        "scale": 3.0966E+9,
                        "id": "600530.SH"
                    },
                    {
                        "name": "中源协和",
                        "scale": 9051352693,
                        "id": "600645.SH"
                    },
                    {
                        "name": "南京新百",
                        "scale": 1.152244612E+10,
                        "id": "600682.SH"
                    },
                    {
                        "name": "辽宁成大",
                        "scale": 20788756399,
                        "id": "600739.SH"
                    },
                    {
                        "name": "钱江生化",
                        "scale": 1859651228,
                        "id": "600796.SH"
                    },
                    {
                        "name": "通化东宝",
                        "scale": 19092841436,
                        "id": "600867.SH"
                    },
                    {
                        "name": "甘李药业",
                        "scale": 12082507639,
                        "id": "603087.SH"
                    },
                    {
                        "name": "康辰药业",
                        "scale": 4.1136E+9,
                        "id": "603590.SH"
                    },
                    {
                        "name": "诺唯赞",
                        "scale": 2552567446,
                        "id": "688105.SH"
                    },
                    {
                        "name": "科兴制药",
                        "scale": 1.66688892E+9,
                        "id": "688136.SH"
                    },
                    {
                        "name": "百奥泰",
                        "scale": 2.14334042E+9,
                        "id": "688177.SH"
                    },
                    {
                        "name": "君实生物-U",
                        "scale": 2.57233757E+10,
                        "id": "688180.SH"
                    },
                    {
                        "name": "康希诺",
                        "scale": 11158390069,
                        "id": "688185.SH"
                    },
                    {
                        "name": "百济神州-U",
                        "scale": 9.08476333E+9,
                        "id": "688235.SH"
                    },
                    {
                        "name": "百克生物",
                        "scale": 14689254131,
                        "id": "688276.SH"
                    },
                    {
                        "name": "特宝生物",
                        "scale": 5928607964,
                        "id": "688278.SH"
                    },
                    {
                        "name": "欧林生物",
                        "scale": 5363530313,
                        "id": "688319.SH"
                    },
                    {
                        "name": "三生国健",
                        "scale": 1340109794,
                        "id": "688336.SH"
                    },
                    {
                        "name": "华熙生物",
                        "scale": 14169391323,
                        "id": "688363.SH"
                    },
                    {
                        "name": "艾迪药业",
                        "scale": 2403347165,
                        "id": "688488.SH"
                    },
                    {
                        "name": "神州细胞-U",
                        "scale": 5037691285,
                        "id": "688520.SH"
                    },
                    {
                        "name": "金迪克",
                        "scale": 1428076479,
                        "id": "688670.SH"
                    },
                    {
                        "name": "凯因科技",
                        "scale": 2040853744,
                        "id": "688687.SH"
                    },
                    {
                        "name": "成大生物",
                        "scale": 2022586686,
                        "id": "688739.SH"
                    },
                    {
                        "name": "永顺生物",
                        "scale": 663622569,
                        "id": "839729.BJ"
                    }
                ],
                "name": "生物制品",
                "scale": 800072892023,
                "id": "370300"
            },
            {
                "children": [
                    {
                        "name": "国药一致",
                        "scale": 10781949885,
                        "id": "000028.SZ"
                    },
                    {
                        "name": "海王生物",
                        "scale": 9069350419,
                        "id": "000078.SZ"
                    },
                    {
                        "name": "英特集团",
                        "scale": 3101145989,
                        "id": "000411.SZ"
                    },
                    {
                        "name": "浙江震元",
                        "scale": 2.18846221E+9,
                        "id": "000705.SZ"
                    },
                    {
                        "name": "重药控股",
                        "scale": 8744614562,
                        "id": "000950.SZ"
                    },
                    {
                        "name": "嘉事堂",
                        "scale": 3314612118,
                        "id": "002462.SZ"
                    },
                    {
                        "name": "瑞康医药",
                        "scale": 5092487988,
                        "id": "002589.SZ"
                    },
                    {
                        "name": "一心堂",
                        "scale": 10087585052,
                        "id": "002727.SZ"
                    },
                    {
                        "name": "浙农股份",
                        "scale": 2403734324,
                        "id": "002758.SZ"
                    },
                    {
                        "name": "鹭燕医药",
                        "scale": 2927078703,
                        "id": "002788.SZ"
                    },
                    {
                        "name": "ST天圣",
                        "scale": 1.0429356E+9,
                        "id": "002872.SZ"
                    },
                    {
                        "name": "药易购",
                        "scale": 1.26041914E+9,
                        "id": "300937.SZ"
                    },
                    {
                        "name": "百洋医药",
                        "scale": 3.073015E+9,
                        "id": "301015.SZ"
                    },
                    {
                        "name": "漱玉平民",
                        "scale": 2.8733624E+9,
                        "id": "301017.SZ"
                    },
                    {
                        "name": "兰卫医学",
                        "scale": 1458153018,
                        "id": "301060.SZ"
                    },
                    {
                        "name": "多瑞医药",
                        "scale": 5.22E+8,
                        "id": "301075.SZ"
                    },
                    {
                        "name": "拓新药业",
                        "scale": 3217091419,
                        "id": "301089.SZ"
                    },
                    {
                        "name": "华兰股份",
                        "scale": 1072805905,
                        "id": "301093.SZ"
                    },
                    {
                        "name": "百诚医药",
                        "scale": 2276635006,
                        "id": "301096.SZ"
                    },
                    {
                        "name": "粤万年青",
                        "scale": 921707273,
                        "id": "301111.SZ"
                    },
                    {
                        "name": "优宁维",
                        "scale": 1280751645,
                        "id": "301166.SZ"
                    },
                    {
                        "name": "亨迪药业",
                        "scale": 1181219548,
                        "id": "301211.SZ"
                    },
                    {
                        "name": "诺思兰德",
                        "scale": 1.6493169E+9,
                        "id": "430047.BJ"
                    },
                    {
                        "name": "中国医药",
                        "scale": 20471361734,
                        "id": "600056.SH"
                    },
                    {
                        "name": "开开实业",
                        "scale": 1.5472E+9,
                        "id": "600272.SH"
                    },
                    {
                        "name": "国药股份",
                        "scale": 14248670418,
                        "id": "600511.SH"
                    },
                    {
                        "name": "南京医药",
                        "scale": 4937237297,
                        "id": "600713.SH"
                    },
                    {
                        "name": "人民同泰",
                        "scale": 3490929354,
                        "id": "600829.SH"
                    },
                    {
                        "name": "第一医药",
                        "scale": 2166168429,
                        "id": "600833.SH"
                    },
                    {
                        "name": "九州通",
                        "scale": 21380850322,
                        "id": "600998.SH"
                    },
                    {
                        "name": "上海医药",
                        "scale": 32968967024,
                        "id": "601607.SH"
                    },
                    {
                        "name": "大参林",
                        "scale": 28729038698,
                        "id": "603233.SH"
                    },
                    {
                        "name": "柳药集团",
                        "scale": 5931718893,
                        "id": "603368.SH"
                    },
                    {
                        "name": "塞力医疗",
                        "scale": 2657468154,
                        "id": "603716.SH"
                    },
                    {
                        "name": "老百姓",
                        "scale": 18751492964,
                        "id": "603883.SH"
                    },
                    {
                        "name": "益丰药房",
                        "scale": 34536383624,
                        "id": "603939.SH"
                    },
                    {
                        "name": "健之佳",
                        "scale": 2677470742,
                        "id": "605266.SH"
                    },
                    {
                        "name": "梓橦宫",
                        "scale": 592560008,
                        "id": "832566.BJ"
                    },
                    {
                        "name": "德源药业",
                        "scale": 764809994,
                        "id": "832735.BJ"
                    },
                    {
                        "name": "生物谷",
                        "scale": 818264716,
                        "id": "833266.BJ"
                    },
                    {
                        "name": "大唐药业",
                        "scale": 598889005,
                        "id": "836433.BJ"
                    },
                    {
                        "name": "三元基因",
                        "scale": 1048325059,
                        "id": "837344.BJ"
                    }
                ],
                "name": "医药商业",
                "scale": 277858240539,
                "id": "370400"
            },
            {
                "children": [
                    {
                        "name": "贝瑞基因",
                        "scale": 4070596091,
                        "id": "000710.SZ"
                    },
                    {
                        "name": "*ST 科华",
                        "scale": 6.11836239E+9,
                        "id": "002022.SZ"
                    },
                    {
                        "name": "达安基因",
                        "scale": 24803799877,
                        "id": "002030.SZ"
                    },
                    {
                        "name": "鱼跃医疗",
                        "scale": 26211751991,
                        "id": "002223.SZ"
                    },
                    {
                        "name": "蓝帆医疗",
                        "scale": 8810849458,
                        "id": "002382.SZ"
                    },
                    {
                        "name": "九安医疗",
                        "scale": 22793307477,
                        "id": "002432.SZ"
                    },
                    {
                        "name": "尚荣医疗",
                        "scale": 2.56932298E+9,
                        "id": "002551.SZ"
                    },
                    {
                        "name": "大博医疗",
                        "scale": 12736517393,
                        "id": "002901.SZ"
                    },
                    {
                        "name": "明德生物",
                        "scale": 6847795641,
                        "id": "002932.SZ"
                    },
                    {
                        "name": "奥美医疗",
                        "scale": 5.74342106E+9,
                        "id": "002950.SZ"
                    },
                    {
                        "name": "乐普医疗",
                        "scale": 28224460896,
                        "id": "300003.SZ"
                    },
                    {
                        "name": "阳普医疗",
                        "scale": 1827169345,
                        "id": "300030.SZ"
                    },
                    {
                        "name": "福瑞股份",
                        "scale": 4157214883,
                        "id": "300049.SZ"
                    },
                    {
                        "name": "理邦仪器",
                        "scale": 3387358747,
                        "id": "300206.SZ"
                    },
                    {
                        "name": "冠昊生物",
                        "scale": 3547494017,
                        "id": "300238.SZ"
                    },
                    {
                        "name": "迪安诊断",
                        "scale": 15489098256,
                        "id": "300244.SZ"
                    },
                    {
                        "name": "宝莱特",
                        "scale": 1779004223,
                        "id": "300246.SZ"
                    },
                    {
                        "name": "*ST和佳",
                        "scale": 1443517996,
                        "id": "300273.SZ"
                    },
                    {
                        "name": "利德曼",
                        "scale": 2549977022,
                        "id": "300289.SZ"
                    },
                    {
                        "name": "三诺生物",
                        "scale": 12559137971,
                        "id": "300298.SZ"
                    },
                    {
                        "name": "戴维医疗",
                        "scale": 2109410779,
                        "id": "300314.SZ"
                    },
                    {
                        "name": "博晖创新",
                        "scale": 5989540797,
                        "id": "300318.SZ"
                    },
                    {
                        "name": "凯利泰",
                        "scale": 5732339784,
                        "id": "300326.SZ"
                    },
                    {
                        "name": "楚天科技",
                        "scale": 9066755555,
                        "id": "300358.SZ"
                    },
                    {
                        "name": "迪瑞医疗",
                        "scale": 4388171219,
                        "id": "300396.SZ"
                    },
                    {
                        "name": "九强生物",
                        "scale": 5996795632,
                        "id": "300406.SZ"
                    },
                    {
                        "name": "美康生物",
                        "scale": 3508471909,
                        "id": "300439.SZ"
                    },
                    {
                        "name": "三鑫医疗",
                        "scale": 2761626462,
                        "id": "300453.SZ"
                    },
                    {
                        "name": "迈克生物",
                        "scale": 7.77078974E+9,
                        "id": "300463.SZ"
                    },
                    {
                        "name": "万孚生物",
                        "scale": 12112495051,
                        "id": "300482.SZ"
                    },
                    {
                        "name": "健帆生物",
                        "scale": 23560241797,
                        "id": "300529.SZ"
                    },
                    {
                        "name": "乐心医疗",
                        "scale": 1459681736,
                        "id": "300562.SZ"
                    },
                    {
                        "name": "欧普康视",
                        "scale": 29159924741,
                        "id": "300595.SZ"
                    },
                    {
                        "name": "开立医疗",
                        "scale": 16134666404,
                        "id": "300633.SZ"
                    },
                    {
                        "name": "凯普生物",
                        "scale": 9277535059,
                        "id": "300639.SZ"
                    },
                    {
                        "name": "透景生命",
                        "scale": 2964123056,
                        "id": "300642.SZ"
                    },
                    {
                        "name": "正海生物",
                        "scale": 9.6714E+9,
                        "id": "300653.SZ"
                    },
                    {
                        "name": "华大基因",
                        "scale": 25547177719,
                        "id": "300676.SZ"
                    },
                    {
                        "name": "英科医疗",
                        "scale": 11316993442,
                        "id": "300677.SZ"
                    },
                    {
                        "name": "艾德生物",
                        "scale": 11498216185,
                        "id": "300685.SZ"
                    },
                    {
                        "name": "爱朋医疗",
                        "scale": 1097131423,
                        "id": "300753.SZ"
                    },
                    {
                        "name": "迈瑞医疗",
                        "scale": 371188634277,
                        "id": "300760.SZ"
                    },
                    {
                        "name": "新产业",
                        "scale": 11707448248,
                        "id": "300832.SZ"
                    },
                    {
                        "name": "康泰医学",
                        "scale": 4049701081,
                        "id": "300869.SZ"
                    },
                    {
                        "name": "爱美客",
                        "scale": 49990301322,
                        "id": "300896.SZ"
                    },
                    {
                        "name": "中红医疗",
                        "scale": 2.2869E+9,
                        "id": "300981.SZ"
                    },
                    {
                        "name": "迈普医学",
                        "scale": 1496264904,
                        "id": "301033.SZ"
                    },
                    {
                        "name": "达嘉维康",
                        "scale": 960251505,
                        "id": "301126.SZ"
                    },
                    {
                        "name": "万东医疗",
                        "scale": 12568568465,
                        "id": "600055.SH"
                    },
                    {
                        "name": "山东药玻",
                        "scale": 16587700786,
                        "id": "600529.SH"
                    },
                    {
                        "name": "新华医疗",
                        "scale": 7932154693,
                        "id": "600587.SH"
                    },
                    {
                        "name": "振德医疗",
                        "scale": 9288129608,
                        "id": "603301.SH"
                    },
                    {
                        "name": "维力医疗",
                        "scale": 4871613907,
                        "id": "603309.SH"
                    },
                    {
                        "name": "辰欣药业",
                        "scale": 5.54071608E+9,
                        "id": "603367.SH"
                    },
                    {
                        "name": "基蛋生物",
                        "scale": 6968289324,
                        "id": "603387.SH"
                    },
                    {
                        "name": "万泰生物",
                        "scale": 30206364953,
                        "id": "603392.SH"
                    },
                    {
                        "name": "安图生物",
                        "scale": 27853794883,
                        "id": "603658.SH"
                    },
                    {
                        "name": "南卫股份",
                        "scale": 1.75159452E+9,
                        "id": "603880.SH"
                    },
                    {
                        "name": "正川股份",
                        "scale": 3594060772,
                        "id": "603976.SH"
                    },
                    {
                        "name": "康德莱",
                        "scale": 7.63866642E+9,
                        "id": "603987.SH"
                    },
                    {
                        "name": "拱东医疗",
                        "scale": 3450640586,
                        "id": "605369.SH"
                    },
                    {
                        "name": "天臣医疗",
                        "scale": 813228624,
                        "id": "688013.SH"
                    },
                    {
                        "name": "心脉医疗",
                        "scale": 5899228934,
                        "id": "688016.SH"
                    },
                    {
                        "name": "洁特生物",
                        "scale": 3021357141,
                        "id": "688026.SH"
                    },
                    {
                        "name": "南微医学",
                        "scale": 17627348607,
                        "id": "688029.SH"
                    },
                    {
                        "name": "爱博医疗",
                        "scale": 1.420997496E+10,
                        "id": "688050.SH"
                    },
                    {
                        "name": "爱威科技",
                        "scale": 870823639,
                        "id": "688067.SH"
                    },
                    {
                        "name": "热景生物",
                        "scale": 4459830495,
                        "id": "688068.SH"
                    },
                    {
                        "name": "安旭生物",
                        "scale": 2.41882642E+9,
                        "id": "688075.SH"
                    },
                    {
                        "name": "三友医疗",
                        "scale": 2329222968,
                        "id": "688085.SH"
                    },
                    {
                        "name": "赛诺医疗",
                        "scale": 1861033099,
                        "id": "688108.SH"
                    },
                    {
                        "name": "海尔生物",
                        "scale": 1.406609356E+10,
                        "id": "688139.SH"
                    },
                    {
                        "name": "华强科技",
                        "scale": 1747422573,
                        "id": "688151.SH"
                    },
                    {
                        "name": "威高骨科",
                        "scale": 2745018408,
                        "id": "688161.SH"
                    },
                    {
                        "name": "佰仁医疗",
                        "scale": 4235275813,
                        "id": "688198.SH"
                    },
                    {
                        "name": "澳华内镜",
                        "scale": 1466859486,
                        "id": "688212.SH"
                    },
                    {
                        "name": "睿昂基因",
                        "scale": 1548715052,
                        "id": "688217.SH"
                    },
                    {
                        "name": "春立医疗",
                        "scale": 669831366,
                        "id": "688236.SH"
                    },
                    {
                        "name": "天智航-U",
                        "scale": 4601435893,
                        "id": "688277.SH"
                    },
                    {
                        "name": "圣湘生物",
                        "scale": 10284636875,
                        "id": "688289.SH"
                    },
                    {
                        "name": "东方生物",
                        "scale": 9346163803,
                        "id": "688298.SH"
                    },
                    {
                        "name": "奕瑞科技",
                        "scale": 2.040024588E+10,
                        "id": "688301.SH"
                    },
                    {
                        "name": "康拓医疗",
                        "scale": 1503578341,
                        "id": "688314.SH"
                    },
                    {
                        "name": "之江生物",
                        "scale": 5864189484,
                        "id": "688317.SH"
                    },
                    {
                        "name": "赛科希德",
                        "scale": 1676916644,
                        "id": "688338.SH"
                    },
                    {
                        "name": "祥生医疗",
                        "scale": 9.5172E+8,
                        "id": "688358.SH"
                    },
                    {
                        "name": "昊海生科",
                        "scale": 4.84408931E+9,
                        "id": "688366.SH"
                    },
                    {
                        "name": "普门科技",
                        "scale": 3012214875,
                        "id": "688389.SH"
                    },
                    {
                        "name": "安必平",
                        "scale": 1444125826,
                        "id": "688393.SH"
                    },
                    {
                        "name": "硕世生物",
                        "scale": 3.8956524E+9,
                        "id": "688399.SH"
                    },
                    {
                        "name": "科美诊断",
                        "scale": 3135158243,
                        "id": "688468.SH"
                    },
                    {
                        "name": "亚辉龙",
                        "scale": 5491639722,
                        "id": "688575.SH"
                    },
                    {
                        "name": "伟思医疗",
                        "scale": 1569710406,
                        "id": "688580.SH"
                    },
                    {
                        "name": "奥泰生物",
                        "scale": 2791860487,
                        "id": "688606.SH"
                    },
                    {
                        "name": "康众医疗",
                        "scale": 2119200246,
                        "id": "688607.SH"
                    },
                    {
                        "name": "奥精医疗",
                        "scale": 3129351051,
                        "id": "688613.SH"
                    },
                    {
                        "name": "惠泰医疗",
                        "scale": 8587446736,
                        "id": "688617.SH"
                    },
                    {
                        "name": "翔宇医疗",
                        "scale": 1.61882376E+9,
                        "id": "688626.SH"
                    },
                    {
                        "name": "浩欧博",
                        "scale": 753839821,
                        "id": "688656.SH"
                    },
                    {
                        "name": "海泰新光",
                        "scale": 4.63628474E+9,
                        "id": "688677.SH"
                    },
                    {
                        "name": "鹿得医疗",
                        "scale": 370051188,
                        "id": "832278.BJ"
                    },
                    {
                        "name": "锦好医疗",
                        "scale": 275707819,
                        "id": "872925.BJ"
                    }
                ],
                "name": "医疗器械",
                "scale": 1159019577233,
                "id": "370500"
            },
            {
                "children": [
                    {
                        "name": "*ST宜康",
                        "scale": 1394363119,
                        "id": "000150.SZ"
                    },
                    {
                        "name": "国新健康",
                        "scale": 9742774463,
                        "id": "000503.SZ"
                    },
                    {
                        "name": "华塑控股",
                        "scale": 4270977036,
                        "id": "000509.SZ"
                    },
                    {
                        "name": "国际医学",
                        "scale": 2.042651445E+10,
                        "id": "000516.SZ"
                    },
                    {
                        "name": "美年健康",
                        "scale": 18885150379,
                        "id": "002044.SZ"
                    },
                    {
                        "name": "创新医疗",
                        "scale": 2464316654,
                        "id": "002173.SZ"
                    },
                    {
                        "name": "恒康医疗",
                        "scale": 1.326406661E+10,
                        "id": "002219.SZ"
                    },
                    {
                        "name": "光正眼科",
                        "scale": 3284438814,
                        "id": "002524.SZ"
                    },
                    {
                        "name": "爱尔眼科",
                        "scale": 174054649461,
                        "id": "300015.SZ"
                    },
                    {
                        "name": "盈康生命",
                        "scale": 6.07527031E+9,
                        "id": "300143.SZ"
                    },
                    {
                        "name": "睿智医药",
                        "scale": 5.637675E+9,
                        "id": "300149.SZ"
                    },
                    {
                        "name": "泰格医药",
                        "scale": 6.139054989E+10,
                        "id": "300347.SZ"
                    },
                    {
                        "name": "博济医药",
                        "scale": 2192332688,
                        "id": "300404.SZ"
                    },
                    {
                        "name": "康龙化成",
                        "scale": 72489479718,
                        "id": "300759.SZ"
                    },
                    {
                        "name": "百花医药",
                        "scale": 2423367933,
                        "id": "600721.SH"
                    },
                    {
                        "name": "通策医疗",
                        "scale": 4.77336768E+10,
                        "id": "600763.SH"
                    },
                    {
                        "name": "*ST运盛",
                        "scale": 1619323365,
                        "id": "600767.SH"
                    },
                    {
                        "name": "润达医疗",
                        "scale": 5847585752,
                        "id": "603108.SH"
                    },
                    {
                        "name": "昭衍新药",
                        "scale": 35985439292,
                        "id": "603127.SH"
                    },
                    {
                        "name": "药明康德",
                        "scale": 242365879425,
                        "id": "603259.SH"
                    },
                    {
                        "name": "金域医学",
                        "scale": 32516277312,
                        "id": "603882.SH"
                    },
                    {
                        "name": "诺泰生物",
                        "scale": 3544791253,
                        "id": "688076.SH"
                    },
                    {
                        "name": "皓元医药",
                        "scale": 9963783287,
                        "id": "688131.SH"
                    },
                    {
                        "name": "美迪西",
                        "scale": 14166639106,
                        "id": "688202.SH"
                    },
                    {
                        "name": "成都先导",
                        "scale": 4827017047,
                        "id": "688222.SH"
                    },
                    {
                        "name": "南模生物",
                        "scale": 1126226931,
                        "id": "688265.SH"
                    },
                    {
                        "name": "诺禾致源",
                        "scale": 3021462289,
                        "id": "688315.SH"
                    },
                    {
                        "name": "阳光诺和",
                        "scale": 6.0462315E+9,
                        "id": "688621.SH"
                    }
                ],
                "name": "医疗服务",
                "scale": 806760259884,
                "id": "370600"
            }
        ],
        "name": "医药生物",
        "scale": 5317617019009,
        "id": "370000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "深圳能源",
                        "scale": 29876408672,
                        "id": "000027.SZ"
                    },
                    {
                        "name": "深南电A",
                        "scale": 2894164632,
                        "id": "000037.SZ"
                    },
                    {
                        "name": "东旭蓝天",
                        "scale": 5598598738,
                        "id": "000040.SZ"
                    },
                    {
                        "name": "川能动力",
                        "scale": 28273102231,
                        "id": "000155.SZ"
                    },
                    {
                        "name": "穗恒运Ａ",
                        "scale": 6568574078,
                        "id": "000531.SZ"
                    },
                    {
                        "name": "粤电力Ａ",
                        "scale": 10649804154,
                        "id": "000539.SZ"
                    },
                    {
                        "name": "皖能电力",
                        "scale": 11130298955,
                        "id": "000543.SZ"
                    },
                    {
                        "name": "太阳能",
                        "scale": 2.50488311E+10,
                        "id": "000591.SZ"
                    },
                    {
                        "name": "建投能源",
                        "scale": 5308514894,
                        "id": "000600.SZ"
                    },
                    {
                        "name": "韶能股份",
                        "scale": 7029900194,
                        "id": "000601.SZ"
                    },
                    {
                        "name": "宝新能源",
                        "scale": 11046314585,
                        "id": "000690.SZ"
                    },
                    {
                        "name": "惠天热电",
                        "scale": 2259187968,
                        "id": "000692.SZ"
                    },
                    {
                        "name": "新能泰山",
                        "scale": 7583147657,
                        "id": "000720.SZ"
                    },
                    {
                        "name": "湖南发展",
                        "scale": 6734936672,
                        "id": "000722.SZ"
                    },
                    {
                        "name": "晋控电力",
                        "scale": 11095643818,
                        "id": "000767.SZ"
                    },
                    {
                        "name": "甘肃电投",
                        "scale": 7953370016,
                        "id": "000791.SZ"
                    },
                    {
                        "name": "银星能源",
                        "scale": 3429253768,
                        "id": "000862.SZ"
                    },
                    {
                        "name": "吉电股份",
                        "scale": 16508322902,
                        "id": "000875.SZ"
                    },
                    {
                        "name": "湖北能源",
                        "scale": 32137418625,
                        "id": "000883.SZ"
                    },
                    {
                        "name": "赣能股份",
                        "scale": 9805533197,
                        "id": "000899.SZ"
                    },
                    {
                        "name": "长源电力",
                        "scale": 6984459947,
                        "id": "000966.SZ"
                    },
                    {
                        "name": "闽东电力",
                        "scale": 5448472417,
                        "id": "000993.SZ"
                    },
                    {
                        "name": "金房节能",
                        "scale": 1115062043,
                        "id": "001210.SZ"
                    },
                    {
                        "name": "豫能控股",
                        "scale": 7007079988,
                        "id": "001896.SZ"
                    },
                    {
                        "name": "协鑫能科",
                        "scale": 21003724175,
                        "id": "002015.SZ"
                    },
                    {
                        "name": "黔源电力",
                        "scale": 6370537882,
                        "id": "002039.SZ"
                    },
                    {
                        "name": "兆新股份",
                        "scale": 4145765263,
                        "id": "002256.SZ"
                    },
                    {
                        "name": "*ST科林",
                        "scale": 9.1282653E+8,
                        "id": "002499.SZ"
                    },
                    {
                        "name": "江苏国信",
                        "scale": 27504420245,
                        "id": "002608.SZ"
                    },
                    {
                        "name": "爱康科技",
                        "scale": 16963123889,
                        "id": "002610.SZ"
                    },
                    {
                        "name": "长青集团",
                        "scale": 2482694317,
                        "id": "002616.SZ"
                    },
                    {
                        "name": "华通热力",
                        "scale": 2045938867,
                        "id": "002893.SZ"
                    },
                    {
                        "name": "南网能源",
                        "scale": 10405345448,
                        "id": "003035.SZ"
                    },
                    {
                        "name": "中国广核",
                        "scale": 26629391129,
                        "id": "003816.SZ"
                    },
                    {
                        "name": "聆达股份",
                        "scale": 8467305515,
                        "id": "300125.SZ"
                    },
                    {
                        "name": "华能国际",
                        "scale": 75554267144,
                        "id": "600011.SH"
                    },
                    {
                        "name": "上海电力",
                        "scale": 24156425538,
                        "id": "600021.SH"
                    },
                    {
                        "name": "浙能电力",
                        "scale": 48010435658,
                        "id": "600023.SH"
                    },
                    {
                        "name": "华能水电",
                        "scale": 1.2672E+11,
                        "id": "600025.SH"
                    },
                    {
                        "name": "华电国际",
                        "scale": 39832683529,
                        "id": "600027.SH"
                    },
                    {
                        "name": "浙江新能",
                        "scale": 2.85584E+9,
                        "id": "600032.SH"
                    },
                    {
                        "name": "广州发展",
                        "scale": 18695617992,
                        "id": "600098.SH"
                    },
                    {
                        "name": "明星电力",
                        "scale": 4.23961266E+9,
                        "id": "600101.SH"
                    },
                    {
                        "name": "三峡水利",
                        "scale": 17652864802,
                        "id": "600116.SH"
                    },
                    {
                        "name": "国网信通",
                        "scale": 8184247887,
                        "id": "600131.SH"
                    },
                    {
                        "name": "永泰能源",
                        "scale": 38436731971,
                        "id": "600157.SH"
                    },
                    {
                        "name": "中闽能源",
                        "scale": 8159920638,
                        "id": "600163.SH"
                    },
                    {
                        "name": "联美控股",
                        "scale": 17321064426,
                        "id": "600167.SH"
                    },
                    {
                        "name": "桂冠电力",
                        "scale": 47530738146,
                        "id": "600236.SH"
                    },
                    {
                        "name": "桂东电力",
                        "scale": 4.132122E+9,
                        "id": "600310.SH"
                    },
                    {
                        "name": "金山股份",
                        "scale": 4683207678,
                        "id": "600396.SH"
                    },
                    {
                        "name": "涪陵电力",
                        "scale": 12182580265,
                        "id": "600452.SH"
                    },
                    {
                        "name": "福能股份",
                        "scale": 20533252036,
                        "id": "600483.SH"
                    },
                    {
                        "name": "西昌电力",
                        "scale": 3510785025,
                        "id": "600505.SH"
                    },
                    {
                        "name": "天富能源",
                        "scale": 6977575003,
                        "id": "600509.SH"
                    },
                    {
                        "name": "京能电力",
                        "scale": 23064917126,
                        "id": "600578.SH"
                    },
                    {
                        "name": "申能股份",
                        "scale": 27743218501,
                        "id": "600642.SH"
                    },
                    {
                        "name": "乐山电力",
                        "scale": 3569596369,
                        "id": "600644.SH"
                    },
                    {
                        "name": "川投能源",
                        "scale": 56724491023,
                        "id": "600674.SH"
                    },
                    {
                        "name": "ST热电",
                        "scale": 2160561864,
                        "id": "600719.SH"
                    },
                    {
                        "name": "*ST华源",
                        "scale": 3852034629,
                        "id": "600726.SH"
                    },
                    {
                        "name": "华银电力",
                        "scale": 3881605345,
                        "id": "600744.SH"
                    },
                    {
                        "name": "通宝能源",
                        "scale": 6856085088,
                        "id": "600780.SH"
                    },
                    {
                        "name": "国电电力",
                        "scale": 70093982992,
                        "id": "600795.SH"
                    },
                    {
                        "name": "内蒙华电",
                        "scale": 23757871632,
                        "id": "600863.SH"
                    },
                    {
                        "name": "梅雁吉祥",
                        "scale": 5580557116,
                        "id": "600868.SH"
                    },
                    {
                        "name": "国投电力",
                        "scale": 72166447875,
                        "id": "600886.SH"
                    },
                    {
                        "name": "长江电力",
                        "scale": 551035249143,
                        "id": "600900.SH"
                    },
                    {
                        "name": "三峡能源",
                        "scale": 5.168313E+10,
                        "id": "600905.SH"
                    },
                    {
                        "name": "郴电国际",
                        "scale": 3163931638,
                        "id": "600969.SH"
                    },
                    {
                        "name": "广安爱众",
                        "scale": 4288264069,
                        "id": "600979.SH"
                    },
                    {
                        "name": "宁波能源",
                        "scale": 3846494674,
                        "id": "600982.SH"
                    },
                    {
                        "name": "文山电力",
                        "scale": 8393353056,
                        "id": "600995.SH"
                    },
                    {
                        "name": "节能风电",
                        "scale": 22448275121,
                        "id": "601016.SH"
                    },
                    {
                        "name": "嘉泽新能",
                        "scale": 10720539384,
                        "id": "601619.SH"
                    },
                    {
                        "name": "晶科科技",
                        "scale": 11347782425,
                        "id": "601778.SH"
                    },
                    {
                        "name": "中国核电",
                        "scale": 118757531069,
                        "id": "601985.SH"
                    },
                    {
                        "name": "大唐发电",
                        "scale": 35204893061,
                        "id": "601991.SH"
                    },
                    {
                        "name": "芯能科技",
                        "scale": 7.135E+9,
                        "id": "603105.SH"
                    },
                    {
                        "name": "江苏新能",
                        "scale": 1.0837866E+10,
                        "id": "603693.SH"
                    },
                    {
                        "name": "杭州热电",
                        "scale": 2.038113E+9,
                        "id": "605011.SH"
                    },
                    {
                        "name": "世茂能源",
                        "scale": 8.144E+8,
                        "id": "605028.SH"
                    },
                    {
                        "name": "新中港",
                        "scale": 1065014475,
                        "id": "605162.SH"
                    }
                ],
                "name": "电力",
                "scale": 2060018653584,
                "id": "410100"
            },
            {
                "children": [
                    {
                        "name": "中原环保",
                        "scale": 6325702327,
                        "id": "000544.SZ"
                    },
                    {
                        "name": "兴蓉环境",
                        "scale": 1.469768158E+10,
                        "id": "000598.SZ"
                    },
                    {
                        "name": "渤海股份",
                        "scale": 2.19175894E+9,
                        "id": "000605.SZ"
                    },
                    {
                        "name": "中山公用",
                        "scale": 9110981431,
                        "id": "000685.SZ"
                    },
                    {
                        "name": "顺控发展",
                        "scale": 2435672352,
                        "id": "003039.SZ"
                    },
                    {
                        "name": "节能国祯",
                        "scale": 4728886209,
                        "id": "300388.SZ"
                    },
                    {
                        "name": "鹏鹞环保",
                        "scale": 3831823392,
                        "id": "300664.SZ"
                    },
                    {
                        "name": "中环环保",
                        "scale": 2816814257,
                        "id": "300692.SZ"
                    },
                    {
                        "name": "华骐环保",
                        "scale": 1340374215,
                        "id": "300929.SZ"
                    },
                    {
                        "name": "深水海纳",
                        "scale": 1739937331,
                        "id": "300961.SZ"
                    },
                    {
                        "name": "首创环保",
                        "scale": 20994089336,
                        "id": "600008.SH"
                    },
                    {
                        "name": "武汉控股",
                        "scale": 4519958938,
                        "id": "600168.SH"
                    },
                    {
                        "name": "国中水务",
                        "scale": 4449085494,
                        "id": "600187.SH"
                    },
                    {
                        "name": "钱江水利",
                        "scale": 4776032606,
                        "id": "600283.SH"
                    },
                    {
                        "name": "洪城环境",
                        "scale": 6.65366641E+9,
                        "id": "600461.SH"
                    },
                    {
                        "name": "创业环保",
                        "scale": 7.23006906E+9,
                        "id": "600874.SH"
                    },
                    {
                        "name": "重庆水务",
                        "scale": 2.5152E+10,
                        "id": "601158.SH"
                    },
                    {
                        "name": "江南水务",
                        "scale": 7247879763,
                        "id": "601199.SH"
                    },
                    {
                        "name": "绿城水务",
                        "scale": 5032946539,
                        "id": "601368.SH"
                    },
                    {
                        "name": "海天股份",
                        "scale": 1946596678,
                        "id": "603759.SH"
                    },
                    {
                        "name": "联泰环保",
                        "scale": 3.17581418E+9,
                        "id": "603797.SH"
                    },
                    {
                        "name": "海峡环保",
                        "scale": 3025269704,
                        "id": "603817.SH"
                    },
                    {
                        "name": "中持股份",
                        "scale": 2134304584,
                        "id": "603903.SH"
                    }
                ],
                "name": "水务",
                "scale": 145557345326,
                "id": "410200"
            },
            {
                "children": [
                    {
                        "name": "胜利股份",
                        "scale": 3520338803,
                        "id": "000407.SZ"
                    },
                    {
                        "name": "南京公用",
                        "scale": 2926225833,
                        "id": "000421.SZ"
                    },
                    {
                        "name": "德龙汇能",
                        "scale": 2261859373,
                        "id": "000593.SZ"
                    },
                    {
                        "name": "ST金鸿",
                        "scale": 1.27236445E+9,
                        "id": "000669.SZ"
                    },
                    {
                        "name": "ST升达",
                        "scale": 1918437081,
                        "id": "002259.SZ"
                    },
                    {
                        "name": "陕天然气",
                        "scale": 9263588457,
                        "id": "002267.SZ"
                    },
                    {
                        "name": "ST浩源",
                        "scale": 1649086636,
                        "id": "002700.SZ"
                    },
                    {
                        "name": "佛燃能源",
                        "scale": 12129894919,
                        "id": "002911.SZ"
                    },
                    {
                        "name": "中泰股份",
                        "scale": 5234114463,
                        "id": "300435.SZ"
                    },
                    {
                        "name": "长春燃气",
                        "scale": 3349668762,
                        "id": "600333.SH"
                    },
                    {
                        "name": "国新能源",
                        "scale": 5362028892,
                        "id": "600617.SH"
                    },
                    {
                        "name": "大众公用",
                        "scale": 8030388361,
                        "id": "600635.SH"
                    },
                    {
                        "name": "百川能源",
                        "scale": 6534220483,
                        "id": "600681.SH"
                    },
                    {
                        "name": "新奥股份",
                        "scale": 25787344898,
                        "id": "600803.SH"
                    },
                    {
                        "name": "贵州燃气",
                        "scale": 9355880922,
                        "id": "600903.SH"
                    },
                    {
                        "name": "重庆燃气",
                        "scale": 1.496872E+10,
                        "id": "600917.SH"
                    },
                    {
                        "name": "新天绿能",
                        "scale": 3389979809,
                        "id": "600956.SH"
                    },
                    {
                        "name": "深圳燃气",
                        "scale": 24020699625,
                        "id": "601139.SH"
                    },
                    {
                        "name": "成都燃气",
                        "scale": 5.5472021E+9,
                        "id": "603053.SH"
                    },
                    {
                        "name": "新疆火炬",
                        "scale": 2.259755E+9,
                        "id": "603080.SH"
                    },
                    {
                        "name": "新天然气",
                        "scale": 9613830709,
                        "id": "603393.SH"
                    },
                    {
                        "name": "皖天然气",
                        "scale": 3673849507,
                        "id": "603689.SH"
                    },
                    {
                        "name": "东方环宇",
                        "scale": 3446765395,
                        "id": "603706.SH"
                    },
                    {
                        "name": "九丰能源",
                        "scale": 6203903878,
                        "id": "605090.SH"
                    },
                    {
                        "name": "洪通燃气",
                        "scale": 9.462336E+8,
                        "id": "605169.SH"
                    },
                    {
                        "name": "蓝天燃气",
                        "scale": 2.38675412E+9,
                        "id": "605368.SH"
                    },
                    {
                        "name": "凯添燃气",
                        "scale": 615253891,
                        "id": "831010.BJ"
                    }
                ],
                "name": "燃气",
                "scale": 175668389967,
                "id": "410300"
            },
            {
                "children": [
                    {
                        "name": "ST星源",
                        "scale": 1893723773,
                        "id": "000005.SZ"
                    },
                    {
                        "name": "中国天楹",
                        "scale": 16241146389,
                        "id": "000035.SZ"
                    },
                    {
                        "name": "华控赛格",
                        "scale": 3805218134,
                        "id": "000068.SZ"
                    },
                    {
                        "name": "京蓝科技",
                        "scale": 2149448249,
                        "id": "000711.SZ"
                    },
                    {
                        "name": "*ST节能",
                        "scale": 1110352816,
                        "id": "000820.SZ"
                    },
                    {
                        "name": "启迪环境",
                        "scale": 5106522627,
                        "id": "000826.SZ"
                    },
                    {
                        "name": "沃顿科技",
                        "scale": 3872548575,
                        "id": "000920.SZ"
                    },
                    {
                        "name": "盈峰环境",
                        "scale": 15919476237,
                        "id": "000967.SZ"
                    },
                    {
                        "name": "旺能环境",
                        "scale": 9801580078,
                        "id": "002034.SZ"
                    },
                    {
                        "name": "国统股份",
                        "scale": 1912326816,
                        "id": "002205.SZ"
                    },
                    {
                        "name": "浙富控股",
                        "scale": 1.47684706E+10,
                        "id": "002266.SZ"
                    },
                    {
                        "name": "富春环保",
                        "scale": 4306531755,
                        "id": "002479.SZ"
                    },
                    {
                        "name": "清新环境",
                        "scale": 6669242098,
                        "id": "002573.SZ"
                    },
                    {
                        "name": "雪迪龙",
                        "scale": 2385644818,
                        "id": "002658.SZ"
                    },
                    {
                        "name": "东江环保",
                        "scale": 4338927429,
                        "id": "002672.SZ"
                    },
                    {
                        "name": "绿茵生态",
                        "scale": 1403375849,
                        "id": "002887.SZ"
                    },
                    {
                        "name": "侨银股份",
                        "scale": 1367895941,
                        "id": "002973.SZ"
                    },
                    {
                        "name": "同兴环保",
                        "scale": 1158431625,
                        "id": "003027.SZ"
                    },
                    {
                        "name": "万邦达",
                        "scale": 6325507951,
                        "id": "300055.SZ"
                    },
                    {
                        "name": "中创环保",
                        "scale": 3295943288,
                        "id": "300056.SZ"
                    },
                    {
                        "name": "碧水源",
                        "scale": 14997682249,
                        "id": "300070.SZ"
                    },
                    {
                        "name": "先河环保",
                        "scale": 2855880971,
                        "id": "300137.SZ"
                    },
                    {
                        "name": "中环装备",
                        "scale": 3128892257,
                        "id": "300140.SZ"
                    },
                    {
                        "name": "科融环境",
                        "scale": 2599977399,
                        "id": "300152.SZ"
                    },
                    {
                        "name": "中电环保",
                        "scale": 2649175475,
                        "id": "300172.SZ"
                    },
                    {
                        "name": "永清环保",
                        "scale": 4429034689,
                        "id": "300187.SZ"
                    },
                    {
                        "name": "维尔利",
                        "scale": 3709503744,
                        "id": "300190.SZ"
                    },
                    {
                        "name": "聚光科技",
                        "scale": 13248917232,
                        "id": "300203.SZ"
                    },
                    {
                        "name": "巴安水务",
                        "scale": 1614906239,
                        "id": "300262.SZ"
                    },
                    {
                        "name": "隆华科技",
                        "scale": 7.33107956E+9,
                        "id": "300263.SZ"
                    },
                    {
                        "name": "兴源环境",
                        "scale": 5795207429,
                        "id": "300266.SZ"
                    },
                    {
                        "name": "天壕环境",
                        "scale": 12808862829,
                        "id": "300332.SZ"
                    },
                    {
                        "name": "津膜科技",
                        "scale": 2304487076,
                        "id": "300334.SZ"
                    },
                    {
                        "name": "迪森股份",
                        "scale": 1573388024,
                        "id": "300335.SZ"
                    },
                    {
                        "name": "博世科",
                        "scale": 2526999163,
                        "id": "300422.SZ"
                    },
                    {
                        "name": "中建环能",
                        "scale": 3263999401,
                        "id": "300425.SZ"
                    },
                    {
                        "name": "百川畅银",
                        "scale": 2429810975,
                        "id": "300614.SZ"
                    },
                    {
                        "name": "久吾高科",
                        "scale": 3572558858,
                        "id": "300631.SZ"
                    },
                    {
                        "name": "倍杰特",
                        "scale": 1914428357,
                        "id": "300774.SZ"
                    },
                    {
                        "name": "惠城环保",
                        "scale": 1347378463,
                        "id": "300779.SZ"
                    },
                    {
                        "name": "玉禾田",
                        "scale": 2464764872,
                        "id": "300815.SZ"
                    },
                    {
                        "name": "中兰环保",
                        "scale": 4.85832E+8,
                        "id": "300854.SZ"
                    },
                    {
                        "name": "南大环境",
                        "scale": 8.480688E+8,
                        "id": "300864.SZ"
                    },
                    {
                        "name": "圣元环保",
                        "scale": 3271702428,
                        "id": "300867.SZ"
                    },
                    {
                        "name": "上海凯鑫",
                        "scale": 754079537,
                        "id": "300899.SZ"
                    },
                    {
                        "name": "建工修复",
                        "scale": 1.57941059E+9,
                        "id": "300958.SZ"
                    },
                    {
                        "name": "超越科技",
                        "scale": 658595185,
                        "id": "301049.SZ"
                    },
                    {
                        "name": "大地海洋",
                        "scale": 5.49045E+8,
                        "id": "301068.SZ"
                    },
                    {
                        "name": "天源环保",
                        "scale": 1.12955E+9,
                        "id": "301127.SZ"
                    },
                    {
                        "name": "中再资环",
                        "scale": 6957185508,
                        "id": "600217.SH"
                    },
                    {
                        "name": "远达环保",
                        "scale": 4958187252,
                        "id": "600292.SH"
                    },
                    {
                        "name": "瀚蓝环境",
                        "scale": 16323249863,
                        "id": "600323.SH"
                    },
                    {
                        "name": "上海环境",
                        "scale": 11039088063,
                        "id": "601200.SH"
                    },
                    {
                        "name": "绿色动力",
                        "scale": 7566463591,
                        "id": "601330.SH"
                    },
                    {
                        "name": "三峰环境",
                        "scale": 5.66216628E+9,
                        "id": "601827.SH"
                    },
                    {
                        "name": "中材节能",
                        "scale": 4.21245E+9,
                        "id": "603126.SH"
                    },
                    {
                        "name": "德创环保",
                        "scale": 2.75932E+9,
                        "id": "603177.SH"
                    },
                    {
                        "name": "上海洗霸",
                        "scale": 2780380322,
                        "id": "603200.SH"
                    },
                    {
                        "name": "伟明环保",
                        "scale": 45997894625,
                        "id": "603568.SH"
                    },
                    {
                        "name": "高能环境",
                        "scale": 16198317949,
                        "id": "603588.SH"
                    },
                    {
                        "name": "*ST博天",
                        "scale": 1843802058,
                        "id": "603603.SH"
                    },
                    {
                        "name": "正和生态",
                        "scale": 591125332,
                        "id": "605069.SH"
                    },
                    {
                        "name": "德林海",
                        "scale": 1701990132,
                        "id": "688069.SH"
                    },
                    {
                        "name": "京源环保",
                        "scale": 1.03939316E+9,
                        "id": "688096.SH"
                    },
                    {
                        "name": "三达膜",
                        "scale": 2788257388,
                        "id": "688101.SH"
                    },
                    {
                        "name": "复洁环保",
                        "scale": 1596254092,
                        "id": "688335.SH"
                    },
                    {
                        "name": "金科环境",
                        "scale": 8.064398E+8,
                        "id": "688466.SH"
                    },
                    {
                        "name": "力源科技",
                        "scale": 1117511395,
                        "id": "688565.SH"
                    },
                    {
                        "name": "通源环境",
                        "scale": 611375764,
                        "id": "688679.SH"
                    },
                    {
                        "name": "卓锦股份",
                        "scale": 353250202,
                        "id": "688701.SH"
                    },
                    {
                        "name": "新安洁",
                        "scale": 8.2991261E+8,
                        "id": "831370.BJ"
                    },
                    {
                        "name": "中航泰达",
                        "scale": 581427671,
                        "id": "836263.BJ"
                    }
                ],
                "name": "环保工程及服务",
                "scale": 351990976907,
                "id": "410400"
            }
        ],
        "name": "公用事业",
        "scale": 2733235365784,
        "id": "410000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "盐 田 港",
                        "scale": 11223317118,
                        "id": "000088.SZ"
                    },
                    {
                        "name": "珠海港",
                        "scale": 5.18844208E+9,
                        "id": "000507.SZ"
                    },
                    {
                        "name": "北部湾港",
                        "scale": 10615321953,
                        "id": "000582.SZ"
                    },
                    {
                        "name": "厦门港务",
                        "scale": 4.41261E+9,
                        "id": "000905.SZ"
                    },
                    {
                        "name": "招商港口",
                        "scale": 9382357106,
                        "id": "001872.SZ"
                    },
                    {
                        "name": "南 京 港",
                        "scale": 3368408928,
                        "id": "002040.SZ"
                    },
                    {
                        "name": "日照港",
                        "scale": 9.07317897E+9,
                        "id": "600017.SH"
                    },
                    {
                        "name": "上港集团",
                        "scale": 127455210575,
                        "id": "600018.SH"
                    },
                    {
                        "name": "锦州港",
                        "scale": 5534196888,
                        "id": "600190.SH"
                    },
                    {
                        "name": "重庆港",
                        "scale": 3444899792,
                        "id": "600279.SH"
                    },
                    {
                        "name": "天津港",
                        "scale": 11489184121,
                        "id": "600717.SH"
                    },
                    {
                        "name": "唐山港",
                        "scale": 1.505185868E+10,
                        "id": "601000.SH"
                    },
                    {
                        "name": "连云港",
                        "scale": 4.03727872E+9,
                        "id": "601008.SH"
                    },
                    {
                        "name": "宁波港",
                        "scale": 50452007108,
                        "id": "601018.SH"
                    },
                    {
                        "name": "广州港",
                        "scale": 2.11806756E+10,
                        "id": "601228.SH"
                    },
                    {
                        "name": "青岛港",
                        "scale": 2.895544275E+10,
                        "id": "601298.SH"
                    },
                    {
                        "name": "秦港股份",
                        "scale": 1.322601402E+10,
                        "id": "601326.SH"
                    },
                    {
                        "name": "辽港股份",
                        "scale": 31255060696,
                        "id": "601880.SH"
                    }
                ],
                "name": "港口",
                "scale": 365345465105,
                "id": "420100"
            },
            {
                "children": [
                    {
                        "name": "粤高速Ａ",
                        "scale": 9.55336533E+9,
                        "id": "000429.SZ"
                    },
                    {
                        "name": "湖南投资",
                        "scale": 2286284754,
                        "id": "000548.SZ"
                    },
                    {
                        "name": "山西路桥",
                        "scale": 3428446836,
                        "id": "000755.SZ"
                    },
                    {
                        "name": "东莞控股",
                        "scale": 10405551576,
                        "id": "000828.SZ"
                    },
                    {
                        "name": "城发环境",
                        "scale": 6639089157,
                        "id": "000885.SZ"
                    },
                    {
                        "name": "海南高速",
                        "scale": 4051666104,
                        "id": "000886.SZ"
                    },
                    {
                        "name": "现代投资",
                        "scale": 6480838761,
                        "id": "000900.SZ"
                    },
                    {
                        "name": "招商公路",
                        "scale": 14167463868,
                        "id": "001965.SZ"
                    },
                    {
                        "name": "皖通高速",
                        "scale": 7.786208E+9,
                        "id": "600012.SH"
                    },
                    {
                        "name": "中原高速",
                        "scale": 6764589214,
                        "id": "600020.SH"
                    },
                    {
                        "name": "福建高速",
                        "scale": 7.82154E+9,
                        "id": "600033.SH"
                    },
                    {
                        "name": "楚天高速",
                        "scale": 5554899858,
                        "id": "600035.SH"
                    },
                    {
                        "name": "重庆路桥",
                        "scale": 7017252327,
                        "id": "600106.SH"
                    },
                    {
                        "name": "赣粤高速",
                        "scale": 7963737918,
                        "id": "600269.SH"
                    },
                    {
                        "name": "山东高速",
                        "scale": 25149776776,
                        "id": "600350.SH"
                    },
                    {
                        "name": "五洲交通",
                        "scale": 4.31117082E+9,
                        "id": "600368.SH"
                    },
                    {
                        "name": "宁沪高速",
                        "scale": 28934612638,
                        "id": "600377.SH"
                    },
                    {
                        "name": "深高速",
                        "scale": 12412121023,
                        "id": "600548.SH"
                    },
                    {
                        "name": "四川成渝",
                        "scale": 8.4130586E+9,
                        "id": "601107.SH"
                    },
                    {
                        "name": "龙江交通",
                        "scale": 3.89500057E+9,
                        "id": "601188.SH"
                    },
                    {
                        "name": "吉林高速",
                        "scale": 3727090534,
                        "id": "601518.SH"
                    }
                ],
                "name": "高速公路",
                "scale": 186763764664,
                "id": "420200"
            },
            {
                "children": [
                    {
                        "name": "富临运业",
                        "scale": 1880505594,
                        "id": "002357.SZ"
                    },
                    {
                        "name": "三峡旅游",
                        "scale": 3.75165728E+9,
                        "id": "002627.SZ"
                    },
                    {
                        "name": "江西长运",
                        "scale": 1.27777496E+9,
                        "id": "600561.SH"
                    },
                    {
                        "name": "大众交通",
                        "scale": 4846280728,
                        "id": "600611.SH"
                    },
                    {
                        "name": "锦江在线",
                        "scale": 4120408791,
                        "id": "600650.SH"
                    },
                    {
                        "name": "外服控股",
                        "scale": 6383374877,
                        "id": "600662.SH"
                    },
                    {
                        "name": "申通地铁",
                        "scale": 4568544831,
                        "id": "600834.SH"
                    },
                    {
                        "name": "德新交运",
                        "scale": 1.392549624E+10,
                        "id": "603032.SH"
                    },
                    {
                        "name": "海汽集团",
                        "scale": 8.5004E+9,
                        "id": "603069.SH"
                    }
                ],
                "name": "公交",
                "scale": 49254443301,
                "id": "420300"
            },
            {
                "children": [
                    {
                        "name": "中信海直",
                        "scale": 5880581326,
                        "id": "000099.SZ"
                    },
                    {
                        "name": "华夏航空",
                        "scale": 10297847263,
                        "id": "002928.SZ"
                    },
                    {
                        "name": "南方航空",
                        "scale": 64794068808,
                        "id": "600029.SH"
                    },
                    {
                        "name": "中国东航",
                        "scale": 47767325271,
                        "id": "600115.SH"
                    },
                    {
                        "name": "ST海航",
                        "scale": 47665381151,
                        "id": "600221.SH"
                    },
                    {
                        "name": "春秋航空",
                        "scale": 44851685174,
                        "id": "601021.SH"
                    },
                    {
                        "name": "中国国航",
                        "scale": 99820560846,
                        "id": "601111.SH"
                    },
                    {
                        "name": "吉祥航空",
                        "scale": 2.539180043E+10,
                        "id": "603885.SH"
                    }
                ],
                "name": "航空运输",
                "scale": 346469250269,
                "id": "420400"
            },
            {
                "children": [
                    {
                        "name": "深圳机场",
                        "scale": 14109107733,
                        "id": "000089.SZ"
                    },
                    {
                        "name": "白云机场",
                        "scale": 31264348518,
                        "id": "600004.SH"
                    },
                    {
                        "name": "上海机场",
                        "scale": 63421631026,
                        "id": "600009.SH"
                    },
                    {
                        "name": "厦门空港",
                        "scale": 4.5743616E+9,
                        "id": "600897.SH"
                    }
                ],
                "name": "机场",
                "scale": 113369448877,
                "id": "420500"
            },
            {
                "children": [
                    {
                        "name": "长航凤凰",
                        "scale": 3279150394,
                        "id": "000520.SZ"
                    },
                    {
                        "name": "盛航股份",
                        "scale": 3245797791,
                        "id": "001205.SZ"
                    },
                    {
                        "name": "海峡股份",
                        "scale": 11590452572,
                        "id": "002320.SZ"
                    },
                    {
                        "name": "中远海能",
                        "scale": 37234821286,
                        "id": "600026.SH"
                    },
                    {
                        "name": "中远海特",
                        "scale": 11742179717,
                        "id": "600428.SH"
                    },
                    {
                        "name": "宁波海运",
                        "scale": 4693418042,
                        "id": "600798.SH"
                    },
                    {
                        "name": "中远海发",
                        "scale": 23086471738,
                        "id": "601866.SH"
                    },
                    {
                        "name": "招商轮船",
                        "scale": 54003568279,
                        "id": "601872.SH"
                    },
                    {
                        "name": "中远海控",
                        "scale": 175384922937,
                        "id": "601919.SH"
                    },
                    {
                        "name": "招商南油",
                        "scale": 18343522945,
                        "id": "601975.SH"
                    },
                    {
                        "name": "渤海轮渡",
                        "scale": 3340308861,
                        "id": "603167.SH"
                    },
                    {
                        "name": "中谷物流",
                        "scale": 8249885006,
                        "id": "603565.SH"
                    }
                ],
                "name": "航运",
                "scale": 354194499568,
                "id": "420600"
            },
            {
                "children": [
                    {
                        "name": "西部创业",
                        "scale": 6487727081,
                        "id": "000557.SZ"
                    },
                    {
                        "name": "中铁特货",
                        "scale": 2151111109,
                        "id": "001213.SZ"
                    },
                    {
                        "name": "铁龙物流",
                        "scale": 6514554151,
                        "id": "600125.SH"
                    },
                    {
                        "name": "大秦铁路",
                        "scale": 92472284783,
                        "id": "601006.SH"
                    },
                    {
                        "name": "广深铁路",
                        "scale": 1.170013059E+10,
                        "id": "601333.SH"
                    },
                    {
                        "name": "京沪高铁",
                        "scale": 126258571551,
                        "id": "601816.SH"
                    }
                ],
                "name": "铁路运输",
                "scale": 245584379265,
                "id": "420700"
            },
            {
                "children": [
                    {
                        "name": "浙商中拓",
                        "scale": 7269820558,
                        "id": "000906.SZ"
                    },
                    {
                        "name": "炬申股份",
                        "scale": 6.254521E+8,
                        "id": "001202.SZ"
                    },
                    {
                        "name": "三羊马",
                        "scale": 8.692344E+8,
                        "id": "001317.SZ"
                    },
                    {
                        "name": "传化智联",
                        "scale": 15374065547,
                        "id": "002010.SZ"
                    },
                    {
                        "name": "韵达股份",
                        "scale": 50108590893,
                        "id": "002120.SZ"
                    },
                    {
                        "name": "怡 亚 通",
                        "scale": 14798069491,
                        "id": "002183.SZ"
                    },
                    {
                        "name": "飞马国际",
                        "scale": 7391631859,
                        "id": "002210.SZ"
                    },
                    {
                        "name": "蔚蓝锂芯",
                        "scale": 18061202216,
                        "id": "002245.SZ"
                    },
                    {
                        "name": "顺丰控股",
                        "scale": 241197176097,
                        "id": "002352.SZ"
                    },
                    {
                        "name": "申通快递",
                        "scale": 16815354554,
                        "id": "002468.SZ"
                    },
                    {
                        "name": "恒基达鑫",
                        "scale": 2285276199,
                        "id": "002492.SZ"
                    },
                    {
                        "name": "龙洲股份",
                        "scale": 2697944587,
                        "id": "002682.SZ"
                    },
                    {
                        "name": "普路通",
                        "scale": 2.15741383E+9,
                        "id": "002769.SZ"
                    },
                    {
                        "name": "天顺股份",
                        "scale": 1736565215,
                        "id": "002800.SZ"
                    },
                    {
                        "name": "东方嘉盛",
                        "scale": 2092637861,
                        "id": "002889.SZ"
                    },
                    {
                        "name": "宏川智慧",
                        "scale": 9549331702,
                        "id": "002930.SZ"
                    },
                    {
                        "name": "新宁物流",
                        "scale": 2314802877,
                        "id": "300013.SZ"
                    },
                    {
                        "name": "飞力达",
                        "scale": 3100972623,
                        "id": "300240.SZ"
                    },
                    {
                        "name": "华鹏飞",
                        "scale": 2.88470358E+9,
                        "id": "300350.SZ"
                    },
                    {
                        "name": "海晨股份",
                        "scale": 3181812158,
                        "id": "300873.SZ"
                    },
                    {
                        "name": "厦门象屿",
                        "scale": 18048793276,
                        "id": "600057.SH"
                    },
                    {
                        "name": "长江投资",
                        "scale": 1.970434E+9,
                        "id": "600119.SH"
                    },
                    {
                        "name": "建发股份",
                        "scale": 30620165724,
                        "id": "600153.SH"
                    },
                    {
                        "name": "安通控股",
                        "scale": 15750269103,
                        "id": "600179.SH"
                    },
                    {
                        "name": "瑞茂通",
                        "scale": 7510583593,
                        "id": "600180.SH"
                    },
                    {
                        "name": "圆通速递",
                        "scale": 68413685854,
                        "id": "600233.SH"
                    },
                    {
                        "name": "淮河能源",
                        "scale": 12163997133,
                        "id": "600575.SH"
                    },
                    {
                        "name": "物产中大",
                        "scale": 23893499229,
                        "id": "600704.SH"
                    },
                    {
                        "name": "中储股份",
                        "scale": 11653327355,
                        "id": "600787.SH"
                    },
                    {
                        "name": "保税科技",
                        "scale": 4691028848,
                        "id": "600794.SH"
                    },
                    {
                        "name": "东航物流",
                        "scale": 1.403002223E+10,
                        "id": "601156.SH"
                    },
                    {
                        "name": "中国外运",
                        "scale": 19078978256,
                        "id": "601598.SH"
                    },
                    {
                        "name": "德邦股份",
                        "scale": 1.26144E+10,
                        "id": "603056.SH"
                    },
                    {
                        "name": "音飞储存",
                        "scale": 3133324218,
                        "id": "603066.SH"
                    },
                    {
                        "name": "ST万林",
                        "scale": 1.60185559E+9,
                        "id": "603117.SH"
                    },
                    {
                        "name": "华贸物流",
                        "scale": 11366138588,
                        "id": "603128.SH"
                    },
                    {
                        "name": "恒通股份",
                        "scale": 1.042763904E+10,
                        "id": "603223.SH"
                    },
                    {
                        "name": "上海雅仕",
                        "scale": 2647162264,
                        "id": "603329.SH"
                    },
                    {
                        "name": "嘉诚国际",
                        "scale": 5.168496E+9,
                        "id": "603535.SH"
                    },
                    {
                        "name": "长久物流",
                        "scale": 4975881031,
                        "id": "603569.SH"
                    },
                    {
                        "name": "XD畅联股",
                        "scale": 3.33419776E+9,
                        "id": "603648.SH"
                    },
                    {
                        "name": "密尔克卫",
                        "scale": 22890617474,
                        "id": "603713.SH"
                    },
                    {
                        "name": "原尚股份",
                        "scale": 1.4826594E+9,
                        "id": "603813.SH"
                    },
                    {
                        "name": "海程邦达",
                        "scale": 1515688243,
                        "id": "603836.SH"
                    },
                    {
                        "name": "嘉友国际",
                        "scale": 9120886409,
                        "id": "603871.SH"
                    },
                    {
                        "name": "中创物流",
                        "scale": 3515200439,
                        "id": "603967.SH"
                    },
                    {
                        "name": "福然德",
                        "scale": 2.50581E+9,
                        "id": "605050.SH"
                    },
                    {
                        "name": "西上海",
                        "scale": 1.24019074E+9,
                        "id": "605151.SH"
                    }
                ],
                "name": "物流",
                "scale": 729876990144,
                "id": "420800"
            }
        ],
        "name": "交通运输",
        "scale": 2390858241193,
        "id": "420000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "万  科Ａ",
                        "scale": 159173522481,
                        "id": "000002.SZ"
                    },
                    {
                        "name": "深振业Ａ",
                        "scale": 5.57547954E+9,
                        "id": "000006.SZ"
                    },
                    {
                        "name": "深物业A",
                        "scale": 5433227604,
                        "id": "000011.SZ"
                    },
                    {
                        "name": "沙河股份",
                        "scale": 1970256263,
                        "id": "000014.SZ"
                    },
                    {
                        "name": "深深房Ａ",
                        "scale": 8.515353E+9,
                        "id": "000029.SZ"
                    },
                    {
                        "name": "大悦城",
                        "scale": 6617619495,
                        "id": "000031.SZ"
                    },
                    {
                        "name": "华联控股",
                        "scale": 5918701008,
                        "id": "000036.SZ"
                    },
                    {
                        "name": "中洲控股",
                        "scale": 5690220877,
                        "id": "000042.SZ"
                    },
                    {
                        "name": "皇庭国际",
                        "scale": 4934359155,
                        "id": "000056.SZ"
                    },
                    {
                        "name": "华侨城Ａ",
                        "scale": 38664439318,
                        "id": "000069.SZ"
                    },
                    {
                        "name": "天健集团",
                        "scale": 10369320811,
                        "id": "000090.SZ"
                    },
                    {
                        "name": "金 融 街",
                        "scale": 16701964311,
                        "id": "000402.SZ"
                    },
                    {
                        "name": "中润资源",
                        "scale": 3408222427,
                        "id": "000506.SZ"
                    },
                    {
                        "name": "渝 开 发",
                        "scale": 3518524924,
                        "id": "000514.SZ"
                    },
                    {
                        "name": "荣安地产",
                        "scale": 7316158186,
                        "id": "000517.SZ"
                    },
                    {
                        "name": "广宇发展",
                        "scale": 24436271846,
                        "id": "000537.SZ"
                    },
                    {
                        "name": "中天金融",
                        "scale": 11019592238,
                        "id": "000540.SZ"
                    },
                    {
                        "name": "莱茵体育",
                        "scale": 3608140189,
                        "id": "000558.SZ"
                    },
                    {
                        "name": "我爱我家",
                        "scale": 5.78235368E+9,
                        "id": "000560.SZ"
                    },
                    {
                        "name": "粤宏远Ａ",
                        "scale": 1981070978,
                        "id": "000573.SZ"
                    },
                    {
                        "name": "阳光股份",
                        "scale": 2121939261,
                        "id": "000608.SZ"
                    },
                    {
                        "name": "中迪投资",
                        "scale": 1483812232,
                        "id": "000609.SZ"
                    },
                    {
                        "name": "奥园美谷",
                        "scale": 5675745304,
                        "id": "000615.SZ"
                    },
                    {
                        "name": "ST海投",
                        "scale": 2.4886079E+9,
                        "id": "000616.SZ"
                    },
                    {
                        "name": "新华联",
                        "scale": 4267404439,
                        "id": "000620.SZ"
                    },
                    {
                        "name": "顺发恒业",
                        "scale": 10557133189,
                        "id": "000631.SZ"
                    },
                    {
                        "name": "金科股份",
                        "scale": 1.333341616E+10,
                        "id": "000656.SZ"
                    },
                    {
                        "name": "美好置业",
                        "scale": 3707753147,
                        "id": "000667.SZ"
                    },
                    {
                        "name": "荣丰控股",
                        "scale": 1972958886,
                        "id": "000668.SZ"
                    },
                    {
                        "name": "阳 光 城",
                        "scale": 9238667737,
                        "id": "000671.SZ"
                    },
                    {
                        "name": "大连友谊",
                        "scale": 1.717848E+9,
                        "id": "000679.SZ"
                    },
                    {
                        "name": "亚太实业",
                        "scale": 1.5161363E+9,
                        "id": "000691.SZ"
                    },
                    {
                        "name": "苏宁环球",
                        "scale": 7830959439,
                        "id": "000718.SZ"
                    },
                    {
                        "name": "ST泰禾",
                        "scale": 3007663055,
                        "id": "000732.SZ"
                    },
                    {
                        "name": "中交地产",
                        "scale": 8692921113,
                        "id": "000736.SZ"
                    },
                    {
                        "name": "中国武夷",
                        "scale": 4.4898343E+9,
                        "id": "000797.SZ"
                    },
                    {
                        "name": "ST新城",
                        "scale": 2606340486,
                        "id": "000809.SZ"
                    },
                    {
                        "name": "财信发展",
                        "scale": 6192027227,
                        "id": "000838.SZ"
                    },
                    {
                        "name": "三湘印象",
                        "scale": 4672884593,
                        "id": "000863.SZ"
                    },
                    {
                        "name": "津滨发展",
                        "scale": 3.80052489E+9,
                        "id": "000897.SZ"
                    },
                    {
                        "name": "数源科技",
                        "scale": 3312474037,
                        "id": "000909.SZ"
                    },
                    {
                        "name": "嘉凯城",
                        "scale": 4.47439492E+9,
                        "id": "000918.SZ"
                    },
                    {
                        "name": "福星股份",
                        "scale": 4090044083,
                        "id": "000926.SZ"
                    },
                    {
                        "name": "中南建设",
                        "scale": 10518896588,
                        "id": "000961.SZ"
                    },
                    {
                        "name": "天保基建",
                        "scale": 5194008589,
                        "id": "000965.SZ"
                    },
                    {
                        "name": "*ST银亿",
                        "scale": 9262707961,
                        "id": "000981.SZ"
                    },
                    {
                        "name": "招商积余",
                        "scale": 10896484083,
                        "id": "001914.SZ"
                    },
                    {
                        "name": "招商蛇口",
                        "scale": 105160074141,
                        "id": "001979.SZ"
                    },
                    {
                        "name": "世荣兆业",
                        "scale": 4588128822,
                        "id": "002016.SZ"
                    },
                    {
                        "name": "广宇集团",
                        "scale": 2532872961,
                        "id": "002133.SZ"
                    },
                    {
                        "name": "荣盛发展",
                        "scale": 11050103537,
                        "id": "002146.SZ"
                    },
                    {
                        "name": "合肥城建",
                        "scale": 4722931996,
                        "id": "002208.SZ"
                    },
                    {
                        "name": "滨江集团",
                        "scale": 22987771552,
                        "id": "002244.SZ"
                    },
                    {
                        "name": "世联行",
                        "scale": 5942605924,
                        "id": "002285.SZ"
                    },
                    {
                        "name": "南国置业",
                        "scale": 4036608523,
                        "id": "002305.SZ"
                    },
                    {
                        "name": "南山控股",
                        "scale": 4857481919,
                        "id": "002314.SZ"
                    },
                    {
                        "name": "国创高新",
                        "scale": 2766308693,
                        "id": "002377.SZ"
                    },
                    {
                        "name": "新大正",
                        "scale": 2269479014,
                        "id": "002968.SZ"
                    },
                    {
                        "name": "特发服务",
                        "scale": 2070904875,
                        "id": "300917.SZ"
                    },
                    {
                        "name": "中国国贸",
                        "scale": 14575378267,
                        "id": "600007.SH"
                    },
                    {
                        "name": "保利发展",
                        "scale": 1.8614039515E+11,
                        "id": "600048.SH"
                    },
                    {
                        "name": "冠城大通",
                        "scale": 4982174086,
                        "id": "600067.SH"
                    },
                    {
                        "name": "宋都股份",
                        "scale": 4703829364,
                        "id": "600077.SH"
                    },
                    {
                        "name": "大名城",
                        "scale": 7740456871,
                        "id": "600094.SH"
                    },
                    {
                        "name": "大龙地产",
                        "scale": 2.29080892E+9,
                        "id": "600159.SH"
                    },
                    {
                        "name": "香江控股",
                        "scale": 6519900334,
                        "id": "600162.SH"
                    },
                    {
                        "name": "卧龙地产",
                        "scale": 3.81726853E+9,
                        "id": "600173.SH"
                    },
                    {
                        "name": "雅戈尔",
                        "scale": 28947146469,
                        "id": "600177.SH"
                    },
                    {
                        "name": "格力地产",
                        "scale": 10819933263,
                        "id": "600185.SH"
                    },
                    {
                        "name": "新湖中宝",
                        "scale": 22269265275,
                        "id": "600208.SH"
                    },
                    {
                        "name": "鲁商发展",
                        "scale": 9284200231,
                        "id": "600223.SH"
                    },
                    {
                        "name": "天津松江",
                        "scale": 12544477527,
                        "id": "600225.SH"
                    },
                    {
                        "name": "ST云城",
                        "scale": 2970520782,
                        "id": "600239.SH"
                    },
                    {
                        "name": "万通发展",
                        "scale": 22060059903,
                        "id": "600246.SH"
                    },
                    {
                        "name": "城建发展",
                        "scale": 9071281152,
                        "id": "600266.SH"
                    },
                    {
                        "name": "天房发展",
                        "scale": 2.134001E+9,
                        "id": "600322.SH"
                    },
                    {
                        "name": "华发股份",
                        "scale": 1.697955997E+10,
                        "id": "600325.SH"
                    },
                    {
                        "name": "华夏幸福",
                        "scale": 11524330984,
                        "id": "600340.SH"
                    },
                    {
                        "name": "首开股份",
                        "scale": 1.129849576E+10,
                        "id": "600376.SH"
                    },
                    {
                        "name": "金地集团",
                        "scale": 46274481613,
                        "id": "600383.SH"
                    },
                    {
                        "name": "粤泰股份",
                        "scale": 1539341495,
                        "id": "600393.SH"
                    },
                    {
                        "name": "蓝光发展",
                        "scale": 4309601218,
                        "id": "600466.SH"
                    },
                    {
                        "name": "华丽家族",
                        "scale": 4.9190303E+9,
                        "id": "600503.SH"
                    },
                    {
                        "name": "黑牡丹",
                        "scale": 7660103528,
                        "id": "600510.SH"
                    },
                    {
                        "name": "ST基础",
                        "scale": 31014922277,
                        "id": "600515.SH"
                    },
                    {
                        "name": "栖霞建设",
                        "scale": 3.3495E+9,
                        "id": "600533.SH"
                    },
                    {
                        "name": "迪马股份",
                        "scale": 5406568636,
                        "id": "600565.SH"
                    },
                    {
                        "name": "ST中珠",
                        "scale": 2973401747,
                        "id": "600568.SH"
                    },
                    {
                        "name": "绿地控股",
                        "scale": 4.384916114E+10,
                        "id": "600606.SH"
                    },
                    {
                        "name": "光大嘉宝",
                        "scale": 4709012162,
                        "id": "600622.SH"
                    },
                    {
                        "name": "新黄浦",
                        "scale": 3609406773,
                        "id": "600638.SH"
                    },
                    {
                        "name": "万业企业",
                        "scale": 24934928416,
                        "id": "600641.SH"
                    },
                    {
                        "name": "同达创业",
                        "scale": 2490669545,
                        "id": "600647.SH"
                    },
                    {
                        "name": "城投控股",
                        "scale": 1.009300678E+10,
                        "id": "600649.SH"
                    },
                    {
                        "name": "信达地产",
                        "scale": 1.591348256E+10,
                        "id": "600657.SH"
                    },
                    {
                        "name": "天地源",
                        "scale": 2721985941,
                        "id": "600665.SH"
                    },
                    {
                        "name": "中华企业",
                        "scale": 17008217353,
                        "id": "600675.SH"
                    },
                    {
                        "name": "京投发展",
                        "scale": 3200159219,
                        "id": "600683.SH"
                    },
                    {
                        "name": "珠江股份",
                        "scale": 2731074314,
                        "id": "600684.SH"
                    },
                    {
                        "name": "亚通股份",
                        "scale": 1532613207,
                        "id": "600692.SH"
                    },
                    {
                        "name": "光明地产",
                        "scale": 5.05138054E+9,
                        "id": "600708.SH"
                    },
                    {
                        "name": "凤凰股份",
                        "scale": 4699024162,
                        "id": "600716.SH"
                    },
                    {
                        "name": "宁波富达",
                        "scale": 5707523523,
                        "id": "600724.SH"
                    },
                    {
                        "name": "苏州高新",
                        "scale": 6044287762,
                        "id": "600736.SH"
                    },
                    {
                        "name": "华远地产",
                        "scale": 4434130652,
                        "id": "600743.SH"
                    },
                    {
                        "name": "上实发展",
                        "scale": 6253068204,
                        "id": "600748.SH"
                    },
                    {
                        "name": "西藏城投",
                        "scale": 2.081118629E+10,
                        "id": "600773.SH"
                    },
                    {
                        "name": "京能置业",
                        "scale": 1854486154,
                        "id": "600791.SH"
                    },
                    {
                        "name": "济南高新",
                        "scale": 2998540348,
                        "id": "600807.SH"
                    },
                    {
                        "name": "世茂股份",
                        "scale": 9753037479,
                        "id": "600823.SH"
                    },
                    {
                        "name": "新城控股",
                        "scale": 44509942794,
                        "id": "601155.SH"
                    },
                    {
                        "name": "北辰实业",
                        "scale": 5.6392E+9,
                        "id": "601588.SH"
                    },
                    {
                        "name": "南都物业",
                        "scale": 2442988905,
                        "id": "603506.SH"
                    }
                ],
                "name": "房地产开发",
                "scale": 1401856607082,
                "id": "430100"
            },
            {
                "children": [
                    {
                        "name": "南京高科",
                        "scale": 11766309579,
                        "id": "600064.SH"
                    },
                    {
                        "name": "海泰发展",
                        "scale": 2080620151,
                        "id": "600082.SH"
                    },
                    {
                        "name": "派斯林",
                        "scale": 3.79931863E+9,
                        "id": "600215.SH"
                    },
                    {
                        "name": "空港股份",
                        "scale": 2.301E+9,
                        "id": "600463.SH"
                    },
                    {
                        "name": "市北高新",
                        "scale": 7346914077,
                        "id": "600604.SH"
                    },
                    {
                        "name": "浦东金桥",
                        "scale": 10168830968,
                        "id": "600639.SH"
                    },
                    {
                        "name": "外高桥",
                        "scale": 11806418211,
                        "id": "600648.SH"
                    },
                    {
                        "name": "电子城",
                        "scale": 5.22379216E+9,
                        "id": "600658.SH"
                    },
                    {
                        "name": "陆家嘴",
                        "scale": 28747922112,
                        "id": "600663.SH"
                    },
                    {
                        "name": "上海临港",
                        "scale": 29743969771,
                        "id": "600848.SH"
                    },
                    {
                        "name": "张江高科",
                        "scale": 19420566957,
                        "id": "600895.SH"
                    },
                    {
                        "name": "中新集团",
                        "scale": 6.9215188E+9,
                        "id": "601512.SH"
                    }
                ],
                "name": "园区开发",
                "scale": 139327181416,
                "id": "430200"
            }
        ],
        "name": "房地产",
        "scale": 1541183788498,
        "id": "430000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "深粮控股",
                        "scale": 3175490268,
                        "id": "000019.SZ"
                    },
                    {
                        "name": "中成股份",
                        "scale": 3246505518,
                        "id": "000151.SZ"
                    },
                    {
                        "name": "远大控股",
                        "scale": 6315713029,
                        "id": "000626.SZ"
                    },
                    {
                        "name": "江苏国泰",
                        "scale": 15460279581,
                        "id": "002091.SZ"
                    },
                    {
                        "name": "鹏都农牧",
                        "scale": 20142665038,
                        "id": "002505.SZ"
                    },
                    {
                        "name": "五矿发展",
                        "scale": 10343938361,
                        "id": "600058.SH"
                    },
                    {
                        "name": "南纺股份",
                        "scale": 1360989166,
                        "id": "600250.SH"
                    },
                    {
                        "name": "东方创业",
                        "scale": 4881393529,
                        "id": "600278.SH"
                    },
                    {
                        "name": "江苏舜天",
                        "scale": 2336858996,
                        "id": "600287.SH"
                    },
                    {
                        "name": "南化股份",
                        "scale": 2969921008,
                        "id": "600301.SH"
                    },
                    {
                        "name": "汇通能源",
                        "scale": 1788468659,
                        "id": "600605.SH"
                    },
                    {
                        "name": "ST沪科",
                        "scale": 1442222628,
                        "id": "600608.SH"
                    },
                    {
                        "name": "苏美达",
                        "scale": 8.70295123E+9,
                        "id": "600710.SH"
                    },
                    {
                        "name": "东方银星",
                        "scale": 2.9761536E+9,
                        "id": "600753.SH"
                    },
                    {
                        "name": "厦门国贸",
                        "scale": 14033143437,
                        "id": "600755.SH"
                    },
                    {
                        "name": "上海物贸",
                        "scale": 3173144743,
                        "id": "600822.SH"
                    },
                    {
                        "name": "兰生股份",
                        "scale": 3.44840502E+9,
                        "id": "600826.SH"
                    },
                    {
                        "name": "汇鸿集团",
                        "scale": 6458207593,
                        "id": "600981.SH"
                    }
                ],
                "name": "贸易",
                "scale": 112256451404,
                "id": "450200"
            },
            {
                "children": [
                    {
                        "name": "合肥百货",
                        "scale": 3404349961,
                        "id": "000417.SZ"
                    },
                    {
                        "name": "通程控股",
                        "scale": 2694767231,
                        "id": "000419.SZ"
                    },
                    {
                        "name": "武商集团",
                        "scale": 7.8957919E+9,
                        "id": "000501.SZ"
                    },
                    {
                        "name": "ST大集",
                        "scale": 15485882874,
                        "id": "000564.SZ"
                    },
                    {
                        "name": "中兴商业",
                        "scale": 2133405799,
                        "id": "000715.SZ"
                    },
                    {
                        "name": "中百集团",
                        "scale": 3308190283,
                        "id": "000759.SZ"
                    },
                    {
                        "name": "居然之家",
                        "scale": 11306433554,
                        "id": "000785.SZ"
                    },
                    {
                        "name": "广百股份",
                        "scale": 3139738943,
                        "id": "002187.SZ"
                    },
                    {
                        "name": "步 步 高",
                        "scale": 5304370259,
                        "id": "002251.SZ"
                    },
                    {
                        "name": "新 华 都",
                        "scale": 3183603926,
                        "id": "002264.SZ"
                    },
                    {
                        "name": "友阿股份",
                        "scale": 6.41319488E+9,
                        "id": "002277.SZ"
                    },
                    {
                        "name": "人人乐",
                        "scale": 2.43683275E+9,
                        "id": "002336.SZ"
                    },
                    {
                        "name": "天虹股份",
                        "scale": 7093005926,
                        "id": "002419.SZ"
                    },
                    {
                        "name": "徐家汇",
                        "scale": 3821877519,
                        "id": "002561.SZ"
                    },
                    {
                        "name": "*ST跨境",
                        "scale": 3629757236,
                        "id": "002640.SZ"
                    },
                    {
                        "name": "红旗连锁",
                        "scale": 5.1946586E+9,
                        "id": "002697.SZ"
                    },
                    {
                        "name": "孩子王",
                        "scale": 1364393991,
                        "id": "301078.SZ"
                    },
                    {
                        "name": "迪阿股份",
                        "scale": 2241825963,
                        "id": "301177.SZ"
                    },
                    {
                        "name": "中央商场",
                        "scale": 2697853523,
                        "id": "600280.SH"
                    },
                    {
                        "name": "ST商城",
                        "scale": 2.5094618E+9,
                        "id": "600306.SH"
                    },
                    {
                        "name": "华联综超",
                        "scale": 4434280734,
                        "id": "600361.SH"
                    },
                    {
                        "name": "新世界",
                        "scale": 4573408965,
                        "id": "600628.SH"
                    },
                    {
                        "name": "东百集团",
                        "scale": 3423326886,
                        "id": "600693.SH"
                    },
                    {
                        "name": "大商股份",
                        "scale": 5090144256,
                        "id": "600694.SH"
                    },
                    {
                        "name": "欧亚集团",
                        "scale": 1982893872,
                        "id": "600697.SH"
                    },
                    {
                        "name": "南宁百货",
                        "scale": 2.06805585E+9,
                        "id": "600712.SH"
                    },
                    {
                        "name": "重庆百货",
                        "scale": 9327487372,
                        "id": "600729.SH"
                    },
                    {
                        "name": "汉商集团",
                        "scale": 3272747654,
                        "id": "600774.SH"
                    },
                    {
                        "name": "友好集团",
                        "scale": 2.39946674E+9,
                        "id": "600778.SH"
                    },
                    {
                        "name": "新华百货",
                        "scale": 2.63537335E+9,
                        "id": "600785.SH"
                    },
                    {
                        "name": "杭州解百",
                        "scale": 4411715097,
                        "id": "600814.SH"
                    },
                    {
                        "name": "金开新能",
                        "scale": 8925612483,
                        "id": "600821.SH"
                    },
                    {
                        "name": "百联股份",
                        "scale": 17007169152,
                        "id": "600827.SH"
                    },
                    {
                        "name": "茂业商业",
                        "scale": 5782743005,
                        "id": "600828.SH"
                    },
                    {
                        "name": "上海九百",
                        "scale": 2661856354,
                        "id": "600838.SH"
                    },
                    {
                        "name": "宁波中百",
                        "scale": 2812971784,
                        "id": "600857.SH"
                    },
                    {
                        "name": "银座股份",
                        "scale": 2.84651416E+9,
                        "id": "600858.SH"
                    },
                    {
                        "name": "王府井",
                        "scale": 22416125283,
                        "id": "600859.SH"
                    },
                    {
                        "name": "北京城乡",
                        "scale": 6120671615,
                        "id": "600861.SH"
                    },
                    {
                        "name": "百大集团",
                        "scale": 3596857421,
                        "id": "600865.SH"
                    },
                    {
                        "name": "文峰股份",
                        "scale": 5.02656E+9,
                        "id": "601010.SH"
                    },
                    {
                        "name": "国芳集团",
                        "scale": 2.55744E+9,
                        "id": "601086.SH"
                    },
                    {
                        "name": "华鼎股份",
                        "scale": 4184151559,
                        "id": "601113.SH"
                    },
                    {
                        "name": "三江购物",
                        "scale": 5.12079304E+9,
                        "id": "601116.SH"
                    },
                    {
                        "name": "利群股份",
                        "scale": 5221147735,
                        "id": "601366.SH"
                    },
                    {
                        "name": "永辉超市",
                        "scale": 31581128736,
                        "id": "601933.SH"
                    },
                    {
                        "name": "安孚科技",
                        "scale": 5.74448E+9,
                        "id": "603031.SH"
                    },
                    {
                        "name": "汇嘉时代",
                        "scale": 2.874144E+9,
                        "id": "603101.SH"
                    },
                    {
                        "name": "翠微股份",
                        "scale": 7827311388,
                        "id": "603123.SH"
                    },
                    {
                        "name": "家家悦",
                        "scale": 7106138794,
                        "id": "603708.SH"
                    },
                    {
                        "name": "国光连锁",
                        "scale": 459491785,
                        "id": "605188.SH"
                    },
                    {
                        "name": "菜百股份",
                        "scale": 854000244,
                        "id": "605599.SH"
                    }
                ],
                "name": "一般零售",
                "scale": 289605606232,
                "id": "450300"
            },
            {
                "children": [
                    {
                        "name": "天音控股",
                        "scale": 11552182666,
                        "id": "000829.SZ"
                    },
                    {
                        "name": "ST易购",
                        "scale": 15487221072,
                        "id": "002024.SZ"
                    },
                    {
                        "name": "南极电商",
                        "scale": 9913676599,
                        "id": "002127.SZ"
                    },
                    {
                        "name": "爱施德",
                        "scale": 11322251402,
                        "id": "002416.SZ"
                    },
                    {
                        "name": "吉峰科技",
                        "scale": 1657004728,
                        "id": "300022.SZ"
                    },
                    {
                        "name": "博士眼镜",
                        "scale": 2303026541,
                        "id": "300622.SZ"
                    },
                    {
                        "name": "华致酒行",
                        "scale": 15846292476,
                        "id": "300755.SZ"
                    },
                    {
                        "name": "ST宏图",
                        "scale": 2223856032,
                        "id": "600122.SH"
                    },
                    {
                        "name": "豫园股份",
                        "scale": 32009135427,
                        "id": "600655.SH"
                    },
                    {
                        "name": "国美通讯",
                        "scale": 1666657212,
                        "id": "600898.SH"
                    },
                    {
                        "name": "爱婴室",
                        "scale": 2564434082,
                        "id": "603214.SH"
                    },
                    {
                        "name": "莱绅通灵",
                        "scale": 2635267522,
                        "id": "603900.SH"
                    }
                ],
                "name": "专业零售",
                "scale": 109181005759,
                "id": "450400"
            },
            {
                "children": [
                    {
                        "name": "全新好",
                        "scale": 2474673832,
                        "id": "000007.SZ"
                    },
                    {
                        "name": "深 赛 格",
                        "scale": 6055805241,
                        "id": "000058.SZ"
                    },
                    {
                        "name": "农 产 品",
                        "scale": 9859202552,
                        "id": "000061.SZ"
                    },
                    {
                        "name": "海印股份",
                        "scale": 6187865999,
                        "id": "000861.SZ"
                    },
                    {
                        "name": "华联股份",
                        "scale": 4981973389,
                        "id": "000882.SZ"
                    },
                    {
                        "name": "海宁皮城",
                        "scale": 6484213366,
                        "id": "002344.SZ"
                    },
                    {
                        "name": "富森美",
                        "scale": 4186725705,
                        "id": "002818.SZ"
                    },
                    {
                        "name": "德必集团",
                        "scale": 1410347604,
                        "id": "300947.SZ"
                    },
                    {
                        "name": "浙江东日",
                        "scale": 2945847106,
                        "id": "600113.SH"
                    },
                    {
                        "name": "小商品城",
                        "scale": 28304713715,
                        "id": "600415.SH"
                    },
                    {
                        "name": "丽尚国潮",
                        "scale": 4.89179511E+9,
                        "id": "600738.SH"
                    },
                    {
                        "name": "轻纺城",
                        "scale": 5232873613,
                        "id": "600790.SH"
                    },
                    {
                        "name": "美凯龙",
                        "scale": 1.857311778E+10,
                        "id": "601828.SH"
                    },
                    {
                        "name": "锦和商管",
                        "scale": 1.0288215E+9,
                        "id": "603682.SH"
                    },
                    {
                        "name": "恒合股份",
                        "scale": 1.701042E+8,
                        "id": "832145.BJ"
                    },
                    {
                        "name": "华维设计",
                        "scale": 151888811,
                        "id": "833427.BJ"
                    },
                    {
                        "name": "中设咨询",
                        "scale": 385069248,
                        "id": "833873.BJ"
                    },
                    {
                        "name": "广咨国际",
                        "scale": 2.3487165E+8,
                        "id": "836892.BJ"
                    }
                ],
                "name": "商业物业经营",
                "scale": 103559910421,
                "id": "450500"
            }
        ],
        "name": "商业贸易",
        "scale": 614602973816,
        "id": "450000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "张家界",
                        "scale": 2046828396,
                        "id": "000430.SZ"
                    },
                    {
                        "name": "峨眉山Ａ",
                        "scale": 3825389121,
                        "id": "000888.SZ"
                    },
                    {
                        "name": "桂林旅游",
                        "scale": 2.21071882E+9,
                        "id": "000978.SZ"
                    },
                    {
                        "name": "宋城演艺",
                        "scale": 2.919088441E+10,
                        "id": "300144.SZ"
                    },
                    {
                        "name": "西域旅游",
                        "scale": 2656021875,
                        "id": "300859.SZ"
                    },
                    {
                        "name": "黄山旅游",
                        "scale": 5.153532E+9,
                        "id": "600054.SH"
                    },
                    {
                        "name": "大连圣亚",
                        "scale": 1.84184E+9,
                        "id": "600593.SH"
                    },
                    {
                        "name": "西藏旅游",
                        "scale": 2521586894,
                        "id": "600749.SH"
                    },
                    {
                        "name": "长白山",
                        "scale": 2.2586949E+9,
                        "id": "603099.SH"
                    },
                    {
                        "name": "天目湖",
                        "scale": 4275453795,
                        "id": "603136.SH"
                    },
                    {
                        "name": "九华旅游",
                        "scale": 2.4482416E+9,
                        "id": "603199.SH"
                    }
                ],
                "name": "景点",
                "scale": 58429191811,
                "id": "460100"
            },
            {
                "children": [
                    {
                        "name": "华天酒店",
                        "scale": 4.0347747E+9,
                        "id": "000428.SZ"
                    },
                    {
                        "name": "西安旅游",
                        "scale": 2081129543,
                        "id": "000610.SZ"
                    },
                    {
                        "name": "君亭酒店",
                        "scale": 1863796275,
                        "id": "301073.SZ"
                    },
                    {
                        "name": "首旅酒店",
                        "scale": 21954561469,
                        "id": "600258.SH"
                    },
                    {
                        "name": "锦江酒店",
                        "scale": 54568430561,
                        "id": "600754.SH"
                    },
                    {
                        "name": "金陵饭店",
                        "scale": 3.1629E+9,
                        "id": "601007.SH"
                    }
                ],
                "name": "酒店",
                "scale": 87665592548,
                "id": "460200"
            },
            {
                "children": [
                    {
                        "name": "岭南控股",
                        "scale": 6245705928,
                        "id": "000524.SZ"
                    },
                    {
                        "name": "ST凯撒",
                        "scale": 4221648427,
                        "id": "000796.SZ"
                    },
                    {
                        "name": "丽江股份",
                        "scale": 4538706295,
                        "id": "002033.SZ"
                    },
                    {
                        "name": "云南旅游",
                        "scale": 4962081591,
                        "id": "002059.SZ"
                    },
                    {
                        "name": "三特索道",
                        "scale": 1577671299,
                        "id": "002159.SZ"
                    },
                    {
                        "name": "众信旅游",
                        "scale": 4590746203,
                        "id": "002707.SZ"
                    },
                    {
                        "name": "中青旅",
                        "scale": 7.6582272E+9,
                        "id": "600138.SH"
                    },
                    {
                        "name": "国旅联合",
                        "scale": 2979126294,
                        "id": "600358.SH"
                    },
                    {
                        "name": "曲江文旅",
                        "scale": 2387096857,
                        "id": "600706.SH"
                    },
                    {
                        "name": "中国中免",
                        "scale": 382021364939,
                        "id": "601888.SH"
                    }
                ],
                "name": "旅游综合",
                "scale": 421182375033,
                "id": "460300"
            },
            {
                "children": [
                    {
                        "name": "西安饮食",
                        "scale": 1861518435,
                        "id": "000721.SZ"
                    },
                    {
                        "name": "全 聚 德",
                        "scale": 2482912862,
                        "id": "002186.SZ"
                    },
                    {
                        "name": "中科云网",
                        "scale": 2786559482,
                        "id": "002306.SZ"
                    },
                    {
                        "name": "同庆楼",
                        "scale": 1781708871,
                        "id": "605108.SH"
                    }
                ],
                "name": "餐饮",
                "scale": 8.91269965E+9,
                "id": "460400"
            },
            {
                "children": [
                    {
                        "name": "科锐国际",
                        "scale": 8305243554,
                        "id": "300662.SZ"
                    },
                    {
                        "name": "米奥会展",
                        "scale": 773419469,
                        "id": "300795.SZ"
                    },
                    {
                        "name": "锋尚文化",
                        "scale": 1909140846,
                        "id": "300860.SZ"
                    },
                    {
                        "name": "零点有数",
                        "scale": 679053894,
                        "id": "301169.SZ"
                    },
                    {
                        "name": "福成股份",
                        "scale": 5689971637,
                        "id": "600965.SH"
                    }
                ],
                "name": "其他休闲服务",
                "scale": 1.73568294E+10,
                "id": "460500"
            }
        ],
        "name": "休闲服务",
        "scale": 593546688442,
        "id": "460000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "平安银行",
                        "scale": 240240361741,
                        "id": "000001.SZ"
                    },
                    {
                        "name": "宁波银行",
                        "scale": 194659496598,
                        "id": "002142.SZ"
                    },
                    {
                        "name": "江阴银行",
                        "scale": 9871090434,
                        "id": "002807.SZ"
                    },
                    {
                        "name": "张家港行",
                        "scale": 10618688438,
                        "id": "002839.SZ"
                    },
                    {
                        "name": "郑州银行",
                        "scale": 15439773263,
                        "id": "002936.SZ"
                    },
                    {
                        "name": "青岛银行",
                        "scale": 10201163432,
                        "id": "002948.SZ"
                    },
                    {
                        "name": "青农商行",
                        "scale": 14849689085,
                        "id": "002958.SZ"
                    },
                    {
                        "name": "苏州银行",
                        "scale": 22138429944,
                        "id": "002966.SZ"
                    },
                    {
                        "name": "浦发银行",
                        "scale": 212509734612,
                        "id": "600000.SH"
                    },
                    {
                        "name": "华夏银行",
                        "scale": 66165063129,
                        "id": "600015.SH"
                    },
                    {
                        "name": "民生银行",
                        "scale": 129082128495,
                        "id": "600016.SH"
                    },
                    {
                        "name": "招商银行",
                        "scale": 709016820025,
                        "id": "600036.SH"
                    },
                    {
                        "name": "无锡银行",
                        "scale": 10546937619,
                        "id": "600908.SH"
                    },
                    {
                        "name": "江苏银行",
                        "scale": 102375692741,
                        "id": "600919.SH"
                    },
                    {
                        "name": "杭州银行",
                        "scale": 68518789093,
                        "id": "600926.SH"
                    },
                    {
                        "name": "西安银行",
                        "scale": 10679053897,
                        "id": "600928.SH"
                    },
                    {
                        "name": "南京银行",
                        "scale": 92550927018,
                        "id": "601009.SH"
                    },
                    {
                        "name": "渝农商行",
                        "scale": 20971840114,
                        "id": "601077.SH"
                    },
                    {
                        "name": "常熟银行",
                        "scale": 20015306139,
                        "id": "601128.SH"
                    },
                    {
                        "name": "兴业银行",
                        "scale": 3.7123563499E+11,
                        "id": "601166.SH"
                    },
                    {
                        "name": "北京银行",
                        "scale": 87743384729,
                        "id": "601169.SH"
                    },
                    {
                        "name": "厦门银行",
                        "scale": 6096669066,
                        "id": "601187.SH"
                    },
                    {
                        "name": "上海银行",
                        "scale": 81350877819,
                        "id": "601229.SH"
                    },
                    {
                        "name": "农业银行",
                        "scale": 846975243202,
                        "id": "601288.SH"
                    },
                    {
                        "name": "交通银行",
                        "scale": 180553974469,
                        "id": "601328.SH"
                    },
                    {
                        "name": "工商银行",
                        "scale": 1.17550924667E+12,
                        "id": "601398.SH"
                    },
                    {
                        "name": "瑞丰银行",
                        "scale": 4349564074,
                        "id": "601528.SH"
                    },
                    {
                        "name": "长沙银行",
                        "scale": 14471418143,
                        "id": "601577.SH"
                    },
                    {
                        "name": "邮储银行",
                        "scale": 51411544066,
                        "id": "601658.SH"
                    },
                    {
                        "name": "齐鲁银行",
                        "scale": 9119921317,
                        "id": "601665.SH"
                    },
                    {
                        "name": "光大银行",
                        "scale": 118683665489,
                        "id": "601818.SH"
                    },
                    {
                        "name": "沪农商行",
                        "scale": 5912044448,
                        "id": "601825.SH"
                    },
                    {
                        "name": "成都银行",
                        "scale": 53740695785,
                        "id": "601838.SH"
                    },
                    {
                        "name": "紫金银行",
                        "scale": 9.79940383E+9,
                        "id": "601860.SH"
                    },
                    {
                        "name": "浙商银行",
                        "scale": 2.285470656E+10,
                        "id": "601916.SH"
                    },
                    {
                        "name": "建设银行",
                        "scale": 52956989985,
                        "id": "601939.SH"
                    },
                    {
                        "name": "重庆银行",
                        "scale": 5019259639,
                        "id": "601963.SH"
                    },
                    {
                        "name": "中国银行",
                        "scale": 640727165132,
                        "id": "601988.SH"
                    },
                    {
                        "name": "贵阳银行",
                        "scale": 1.986652932E+10,
                        "id": "601997.SH"
                    },
                    {
                        "name": "中信银行",
                        "scale": 146767053731,
                        "id": "601998.SH"
                    },
                    {
                        "name": "苏农银行",
                        "scale": 7846998749,
                        "id": "603323.SH"
                    }
                ],
                "name": "银行",
                "scale": 5.87344297703E+12,
                "id": "480100"
            }
        ],
        "name": "银行",
        "scale": 5.87344297703E+12,
        "id": "480000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "申万宏源",
                        "scale": 94423775654,
                        "id": "000166.SZ"
                    },
                    {
                        "name": "东北证券",
                        "scale": 16734238342,
                        "id": "000686.SZ"
                    },
                    {
                        "name": "锦龙股份",
                        "scale": 13267468286,
                        "id": "000712.SZ"
                    },
                    {
                        "name": "国元证券",
                        "scale": 33300404231,
                        "id": "000728.SZ"
                    },
                    {
                        "name": "国海证券",
                        "scale": 1.949140134E+10,
                        "id": "000750.SZ"
                    },
                    {
                        "name": "广发证券",
                        "scale": 96425257949,
                        "id": "000776.SZ"
                    },
                    {
                        "name": "长江证券",
                        "scale": 3.035946656E+10,
                        "id": "000783.SZ"
                    },
                    {
                        "name": "越秀金控",
                        "scale": 32862217626,
                        "id": "000987.SZ"
                    },
                    {
                        "name": "山西证券",
                        "scale": 20461697818,
                        "id": "002500.SZ"
                    },
                    {
                        "name": "国盛金控",
                        "scale": 13830947402,
                        "id": "002670.SZ"
                    },
                    {
                        "name": "西部证券",
                        "scale": 26504305222,
                        "id": "002673.SZ"
                    },
                    {
                        "name": "国信证券",
                        "scale": 82092203389,
                        "id": "002736.SZ"
                    },
                    {
                        "name": "第一创业",
                        "scale": 2.6199416E+10,
                        "id": "002797.SZ"
                    },
                    {
                        "name": "华西证券",
                        "scale": 2.107875E+10,
                        "id": "002926.SZ"
                    },
                    {
                        "name": "长城证券",
                        "scale": 28861669764,
                        "id": "002939.SZ"
                    },
                    {
                        "name": "华林证券",
                        "scale": 3.9852E+10,
                        "id": "002945.SZ"
                    },
                    {
                        "name": "东方财富",
                        "scale": 254485001263,
                        "id": "300059.SZ"
                    },
                    {
                        "name": "中信证券",
                        "scale": 228015667901,
                        "id": "600030.SH"
                    },
                    {
                        "name": "国投资本",
                        "scale": 40415163538,
                        "id": "600061.SH"
                    },
                    {
                        "name": "湘财股份",
                        "scale": 8200973326,
                        "id": "600095.SH"
                    },
                    {
                        "name": "国金证券",
                        "scale": 26463143963,
                        "id": "600109.SH"
                    },
                    {
                        "name": "华创阳安",
                        "scale": 14420924612,
                        "id": "600155.SH"
                    },
                    {
                        "name": "西南证券",
                        "scale": 22411083222,
                        "id": "600369.SH"
                    },
                    {
                        "name": "华鑫股份",
                        "scale": 13643164895,
                        "id": "600621.SH"
                    },
                    {
                        "name": "海通证券",
                        "scale": 84918257893,
                        "id": "600837.SH"
                    },
                    {
                        "name": "XD哈投股",
                        "scale": 10735743883,
                        "id": "600864.SH"
                    },
                    {
                        "name": "XD财达证",
                        "scale": 10294156096,
                        "id": "600906.SH"
                    },
                    {
                        "name": "华安证券",
                        "scale": 21233428516,
                        "id": "600909.SH"
                    },
                    {
                        "name": "中泰证券",
                        "scale": 19463658664,
                        "id": "600918.SH"
                    },
                    {
                        "name": "东方证券",
                        "scale": 67524125091,
                        "id": "600958.SH"
                    },
                    {
                        "name": "招商证券",
                        "scale": 102720552964,
                        "id": "600999.SH"
                    },
                    {
                        "name": "中信建投",
                        "scale": 102335070183,
                        "id": "601066.SH"
                    },
                    {
                        "name": "太平洋",
                        "scale": 19494664818,
                        "id": "601099.SH"
                    },
                    {
                        "name": "财通证券",
                        "scale": 3.482798394E+10,
                        "id": "601108.SH"
                    },
                    {
                        "name": "天风证券",
                        "scale": 26690532989,
                        "id": "601162.SH"
                    },
                    {
                        "name": "东兴证券",
                        "scale": 27346489099,
                        "id": "601198.SH"
                    },
                    {
                        "name": "国泰君安",
                        "scale": 108443290296,
                        "id": "601211.SH"
                    },
                    {
                        "name": "红塔证券",
                        "scale": 41460564252,
                        "id": "601236.SH"
                    },
                    {
                        "name": "中原证券",
                        "scale": 13721128406,
                        "id": "601375.SH"
                    },
                    {
                        "name": "兴业证券",
                        "scale": 43662299314,
                        "id": "601377.SH"
                    },
                    {
                        "name": "国联证券",
                        "scale": 11165520005,
                        "id": "601456.SH"
                    },
                    {
                        "name": "东吴证券",
                        "scale": 33950867974,
                        "id": "601555.SH"
                    },
                    {
                        "name": "华泰证券",
                        "scale": 96812420077,
                        "id": "601688.SH"
                    },
                    {
                        "name": "中银证券",
                        "scale": 18508973665,
                        "id": "601696.SH"
                    },
                    {
                        "name": "光大证券",
                        "scale": 6.211651154E+10,
                        "id": "601788.SH"
                    },
                    {
                        "name": "浙商证券",
                        "scale": 42427166617,
                        "id": "601878.SH"
                    },
                    {
                        "name": "中国银河",
                        "scale": 5.820985534E+10,
                        "id": "601881.SH"
                    },
                    {
                        "name": "方正证券",
                        "scale": 56554536584,
                        "id": "601901.SH"
                    },
                    {
                        "name": "南京证券",
                        "scale": 32144983435,
                        "id": "601990.SH"
                    },
                    {
                        "name": "中金公司",
                        "scale": 40336267383,
                        "id": "601995.SH"
                    }
                ],
                "name": "证券",
                "scale": 2390899391327,
                "id": "490100"
            },
            {
                "children": [
                    {
                        "name": "天茂集团",
                        "scale": 16024679493,
                        "id": "000627.SZ"
                    },
                    {
                        "name": "中国平安",
                        "scale": 450747169762,
                        "id": "601318.SH"
                    },
                    {
                        "name": "中国人保",
                        "scale": 151162839966,
                        "id": "601319.SH"
                    },
                    {
                        "name": "新华保险",
                        "scale": 58663408634,
                        "id": "601336.SH"
                    },
                    {
                        "name": "中国太保",
                        "scale": 1.3765378366E+11,
                        "id": "601601.SH"
                    },
                    {
                        "name": "中国人寿",
                        "scale": 5.820176635E+11,
                        "id": "601628.SH"
                    }
                ],
                "name": "保险",
                "scale": 1396269545015,
                "id": "490200"
            },
            {
                "children": [
                    {
                        "name": "泛海控股",
                        "scale": 7322972413,
                        "id": "000046.SZ"
                    },
                    {
                        "name": "渤海租赁",
                        "scale": 9461875124,
                        "id": "000415.SZ"
                    },
                    {
                        "name": "民生控股",
                        "scale": 1.95112283E+9,
                        "id": "000416.SZ"
                    },
                    {
                        "name": "陕国投Ａ",
                        "scale": 12486640465,
                        "id": "000563.SZ"
                    },
                    {
                        "name": "海德股份",
                        "scale": 1.5130332E+10,
                        "id": "000567.SZ"
                    },
                    {
                        "name": "中油资本",
                        "scale": 63463236977,
                        "id": "000617.SZ"
                    },
                    {
                        "name": "经纬纺机",
                        "scale": 2764719066,
                        "id": "000666.SZ"
                    },
                    {
                        "name": "法尔胜",
                        "scale": 1925463901,
                        "id": "000890.SZ"
                    },
                    {
                        "name": "电投产融",
                        "scale": 5146663169,
                        "id": "000958.SZ"
                    },
                    {
                        "name": "中粮资本",
                        "scale": 8077571654,
                        "id": "002423.SZ"
                    },
                    {
                        "name": "仁东控股",
                        "scale": 3869162252,
                        "id": "002647.SZ"
                    },
                    {
                        "name": "瑞达期货",
                        "scale": 1.85232894E+9,
                        "id": "002961.SZ"
                    },
                    {
                        "name": "派生科技",
                        "scale": 2260042767,
                        "id": "300176.SZ"
                    },
                    {
                        "name": "*ST吉艾",
                        "scale": 1361814101,
                        "id": "300309.SZ"
                    },
                    {
                        "name": "九鼎投资",
                        "scale": 7660665936,
                        "id": "600053.SH"
                    },
                    {
                        "name": "浙江东方",
                        "scale": 11643218946,
                        "id": "600120.SH"
                    },
                    {
                        "name": "新力金融",
                        "scale": 3865966345,
                        "id": "600318.SH"
                    },
                    {
                        "name": "五矿资本",
                        "scale": 22130482058,
                        "id": "600390.SH"
                    },
                    {
                        "name": "ST熊猫",
                        "scale": 1.5604E+9,
                        "id": "600599.SH"
                    },
                    {
                        "name": "爱建集团",
                        "scale": 9.42318173E+9,
                        "id": "600643.SH"
                    },
                    {
                        "name": "岩石股份",
                        "scale": 8.79989073E+9,
                        "id": "600696.SH"
                    },
                    {
                        "name": "中航产融",
                        "scale": 29504983265,
                        "id": "600705.SH"
                    },
                    {
                        "name": "鲁信创投",
                        "scale": 9885091424,
                        "id": "600783.SH"
                    },
                    {
                        "name": "ST安信",
                        "scale": 2.095187627E+10,
                        "id": "600816.SH"
                    },
                    {
                        "name": "香溢融通",
                        "scale": 2594182885,
                        "id": "600830.SH"
                    },
                    {
                        "name": "江苏租赁",
                        "scale": 15162595286,
                        "id": "600901.SH"
                    },
                    {
                        "name": "永安期货",
                        "scale": 2851433342,
                        "id": "600927.SH"
                    },
                    {
                        "name": "南华期货",
                        "scale": 1480501026,
                        "id": "603093.SH"
                    },
                    {
                        "name": "华铁应急",
                        "scale": 9498301326,
                        "id": "603300.SH"
                    }
                ],
                "name": "多元金融",
                "scale": 294086716228,
                "id": "490300"
            }
        ],
        "name": "非银金融",
        "scale": 4.08125565257E+12,
        "id": "490000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "中国宝安",
                        "scale": 41511771371,
                        "id": "000009.SZ"
                    },
                    {
                        "name": "云鼎科技",
                        "scale": 2551420525,
                        "id": "000409.SZ"
                    },
                    {
                        "name": "三木集团",
                        "scale": 2001570906,
                        "id": "000632.SZ"
                    },
                    {
                        "name": "*ST万方",
                        "scale": 1630161375,
                        "id": "000638.SZ"
                    },
                    {
                        "name": "泰达股份",
                        "scale": 6001028224,
                        "id": "000652.SZ"
                    },
                    {
                        "name": "ST国安",
                        "scale": 9995557198,
                        "id": "000839.SZ"
                    },
                    {
                        "name": "广电计量",
                        "scale": 5770696032,
                        "id": "002967.SZ"
                    },
                    {
                        "name": "开普检测",
                        "scale": 884836748,
                        "id": "003008.SZ"
                    },
                    {
                        "name": "华测检测",
                        "scale": 31440057977,
                        "id": "300012.SZ"
                    },
                    {
                        "name": "创业黑马",
                        "scale": 2325194836,
                        "id": "300688.SZ"
                    },
                    {
                        "name": "钢研纳克",
                        "scale": 1137104377,
                        "id": "300797.SZ"
                    },
                    {
                        "name": "谱尼测试",
                        "scale": 2710249153,
                        "id": "300887.SZ"
                    },
                    {
                        "name": "信测标准",
                        "scale": 1890910131,
                        "id": "300938.SZ"
                    },
                    {
                        "name": "易瑞生物",
                        "scale": 2372519797,
                        "id": "300942.SZ"
                    },
                    {
                        "name": "中金辐照",
                        "scale": 1832873698,
                        "id": "300962.SZ"
                    },
                    {
                        "name": "深圳瑞捷",
                        "scale": 6.06564E+8,
                        "id": "300977.SZ"
                    },
                    {
                        "name": "宁波联合",
                        "scale": 2.1512896E+9,
                        "id": "600051.SH"
                    },
                    {
                        "name": "浙江富润",
                        "scale": 2878173758,
                        "id": "600070.SH"
                    },
                    {
                        "name": "*ST博信",
                        "scale": 2134017531,
                        "id": "600083.SH"
                    },
                    {
                        "name": "弘业股份",
                        "scale": 2317146825,
                        "id": "600128.SH"
                    },
                    {
                        "name": "*ST西源",
                        "scale": 2468851595,
                        "id": "600139.SH"
                    },
                    {
                        "name": "廊坊发展",
                        "scale": 2.2391424E+9,
                        "id": "600149.SH"
                    },
                    {
                        "name": "绿能慧充",
                        "scale": 3883781847,
                        "id": "600212.SH"
                    },
                    {
                        "name": "科新发展",
                        "scale": 1.90704019E+9,
                        "id": "600234.SH"
                    },
                    {
                        "name": "华阳新材",
                        "scale": 2854931239,
                        "id": "600281.SH"
                    },
                    {
                        "name": "ST广珠",
                        "scale": 3660652902,
                        "id": "600382.SH"
                    },
                    {
                        "name": "广汇物流",
                        "scale": 13803029317,
                        "id": "600603.SH"
                    },
                    {
                        "name": "天宸股份",
                        "scale": 8034122222,
                        "id": "600620.SH"
                    },
                    {
                        "name": "复旦复华",
                        "scale": 4299991423,
                        "id": "600624.SH"
                    },
                    {
                        "name": "中国高科",
                        "scale": 3115143371,
                        "id": "600730.SH"
                    },
                    {
                        "name": "综艺股份",
                        "scale": 1.0426E+10,
                        "id": "600770.SH"
                    },
                    {
                        "name": "鲁银投资",
                        "scale": 4363605857,
                        "id": "600784.SH"
                    },
                    {
                        "name": "悦达投资",
                        "scale": 4557475972,
                        "id": "600805.SH"
                    },
                    {
                        "name": "东方集团",
                        "scale": 10648128639,
                        "id": "600811.SH"
                    },
                    {
                        "name": "宇通重工",
                        "scale": 2225024182,
                        "id": "600817.SH"
                    },
                    {
                        "name": "中路股份",
                        "scale": 4771056096,
                        "id": "600818.SH"
                    },
                    {
                        "name": "国检集团",
                        "scale": 9.25803648E+9,
                        "id": "603060.SH"
                    },
                    {
                        "name": "建研院",
                        "scale": 2261604845,
                        "id": "603183.SH"
                    },
                    {
                        "name": "行动教育",
                        "scale": 1110325983,
                        "id": "605098.SH"
                    }
                ],
                "name": "综合",
                "scale": 220031088622,
                "id": "510100"
            }
        ],
        "name": "综合",
        "scale": 220031088622,
        "id": "510000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "冀东水泥",
                        "scale": 14436295658,
                        "id": "000401.SZ"
                    },
                    {
                        "name": "金圆股份",
                        "scale": 12843889316,
                        "id": "000546.SZ"
                    },
                    {
                        "name": "上峰水泥",
                        "scale": 14569275538,
                        "id": "000672.SZ"
                    },
                    {
                        "name": "万年青",
                        "scale": 8109391141,
                        "id": "000789.SZ"
                    },
                    {
                        "name": "天山股份",
                        "scale": 9760306327,
                        "id": "000877.SZ"
                    },
                    {
                        "name": "四川双马",
                        "scale": 17360633172,
                        "id": "000935.SZ"
                    },
                    {
                        "name": "塔牌集团",
                        "scale": 9582557294,
                        "id": "002233.SZ"
                    },
                    {
                        "name": "西藏天路",
                        "scale": 5.09799786E+9,
                        "id": "600326.SH"
                    },
                    {
                        "name": "青松建化",
                        "scale": 5887433667,
                        "id": "600425.SH"
                    },
                    {
                        "name": "宁夏建材",
                        "scale": 5719045262,
                        "id": "600449.SH"
                    },
                    {
                        "name": "海螺水泥",
                        "scale": 131510220798,
                        "id": "600585.SH"
                    },
                    {
                        "name": "尖峰集团",
                        "scale": 4345778748,
                        "id": "600668.SH"
                    },
                    {
                        "name": "祁连山",
                        "scale": 8809446497,
                        "id": "600720.SH"
                    },
                    {
                        "name": "华新水泥",
                        "scale": 24309555412,
                        "id": "600801.SH"
                    },
                    {
                        "name": "福建水泥",
                        "scale": 2.88696492E+9,
                        "id": "600802.SH"
                    },
                    {
                        "name": "亚泰集团",
                        "scale": 8414686193,
                        "id": "600881.SH"
                    },
                    {
                        "name": "博闻科技",
                        "scale": 1.94300424E+9,
                        "id": "600883.SH"
                    },
                    {
                        "name": "金隅集团",
                        "scale": 21835494652,
                        "id": "601992.SH"
                    },
                    {
                        "name": "旭杰科技",
                        "scale": 206289757,
                        "id": "836149.BJ"
                    }
                ],
                "name": "水泥制造",
                "scale": 307628266452,
                "id": "610100"
            },
            {
                "children": [
                    {
                        "name": "南  玻Ａ",
                        "scale": 13891762382,
                        "id": "000012.SZ"
                    },
                    {
                        "name": "亚玛顿",
                        "scale": 8928693819,
                        "id": "002623.SZ"
                    },
                    {
                        "name": "金刚玻璃",
                        "scale": 11039955001,
                        "id": "300093.SZ"
                    },
                    {
                        "name": "力诺特玻",
                        "scale": 846750921,
                        "id": "301188.SZ"
                    },
                    {
                        "name": "金晶科技",
                        "scale": 1.4859208E+10,
                        "id": "600586.SH"
                    },
                    {
                        "name": "耀皮玻璃",
                        "scale": 4103314208,
                        "id": "600819.SH"
                    },
                    {
                        "name": "洛阳玻璃",
                        "scale": 10544015239,
                        "id": "600876.SH"
                    },
                    {
                        "name": "旗滨集团",
                        "scale": 34617063131,
                        "id": "601636.SH"
                    },
                    {
                        "name": "福莱特",
                        "scale": 66419713687,
                        "id": "601865.SH"
                    }
                ],
                "name": "玻璃制造",
                "scale": 165250476388,
                "id": "610200"
            },
            {
                "children": [
                    {
                        "name": "深天地Ａ",
                        "scale": 1513830578,
                        "id": "000023.SZ"
                    },
                    {
                        "name": "海螺新材",
                        "scale": 2.7972E+9,
                        "id": "000619.SZ"
                    },
                    {
                        "name": "北新建材",
                        "scale": 46529045969,
                        "id": "000786.SZ"
                    },
                    {
                        "name": "兔 宝 宝",
                        "scale": 6115446763,
                        "id": "002043.SZ"
                    },
                    {
                        "name": "瑞泰科技",
                        "scale": 2.95911E+9,
                        "id": "002066.SZ"
                    },
                    {
                        "name": "万邦德",
                        "scale": 4128032236,
                        "id": "002082.SZ"
                    },
                    {
                        "name": "鲁阳节能",
                        "scale": 1.060615717E+10,
                        "id": "002088.SZ"
                    },
                    {
                        "name": "悦心健康",
                        "scale": 4070925495,
                        "id": "002162.SZ"
                    },
                    {
                        "name": "海南发展",
                        "scale": 9.497961E+9,
                        "id": "002163.SZ"
                    },
                    {
                        "name": "濮耐股份",
                        "scale": 4356879549,
                        "id": "002225.SZ"
                    },
                    {
                        "name": "东方雨虹",
                        "scale": 75205061305,
                        "id": "002271.SZ"
                    },
                    {
                        "name": "西部建设",
                        "scale": 9.59389271E+9,
                        "id": "002302.SZ"
                    },
                    {
                        "name": "雅博股份",
                        "scale": 9627028877,
                        "id": "002323.SZ"
                    },
                    {
                        "name": "罗普斯金",
                        "scale": 2513665308,
                        "id": "002333.SZ"
                    },
                    {
                        "name": "伟星新材",
                        "scale": 2.796606682E+10,
                        "id": "002372.SZ"
                    },
                    {
                        "name": "北京利尔",
                        "scale": 3755343374,
                        "id": "002392.SZ"
                    },
                    {
                        "name": "垒知集团",
                        "scale": 3471656677,
                        "id": "002398.SZ"
                    },
                    {
                        "name": "青龙管业",
                        "scale": 2903046318,
                        "id": "002457.SZ"
                    },
                    {
                        "name": "海南瑞泽",
                        "scale": 3217914468,
                        "id": "002596.SZ"
                    },
                    {
                        "name": "公元股份",
                        "scale": 5987066761,
                        "id": "002641.SZ"
                    },
                    {
                        "name": "扬子新材",
                        "scale": 1590817012,
                        "id": "002652.SZ"
                    },
                    {
                        "name": "龙泉股份",
                        "scale": 2151997587,
                        "id": "002671.SZ"
                    },
                    {
                        "name": "顾地科技",
                        "scale": 3063226664,
                        "id": "002694.SZ"
                    },
                    {
                        "name": "友邦吊顶",
                        "scale": 909081101,
                        "id": "002718.SZ"
                    },
                    {
                        "name": "三圣股份",
                        "scale": 2.50405988E+9,
                        "id": "002742.SZ"
                    },
                    {
                        "name": "万里石",
                        "scale": 4165634404,
                        "id": "002785.SZ"
                    },
                    {
                        "name": "坚朗五金",
                        "scale": 12773093322,
                        "id": "002791.SZ"
                    },
                    {
                        "name": "帝欧家居",
                        "scale": 1888940806,
                        "id": "002798.SZ"
                    },
                    {
                        "name": "蒙娜丽莎",
                        "scale": 2830956691,
                        "id": "002918.SZ"
                    },
                    {
                        "name": "东鹏控股",
                        "scale": 5224487568,
                        "id": "003012.SZ"
                    },
                    {
                        "name": "三和管桩",
                        "scale": 1000327197,
                        "id": "003037.SZ"
                    },
                    {
                        "name": "嘉寓股份",
                        "scale": 3.4906212E+9,
                        "id": "300117.SZ"
                    },
                    {
                        "name": "纳川股份",
                        "scale": 3390699156,
                        "id": "300198.SZ"
                    },
                    {
                        "name": "开尔新材",
                        "scale": 2274987264,
                        "id": "300234.SZ"
                    },
                    {
                        "name": "中铁装配",
                        "scale": 2043767419,
                        "id": "300374.SZ"
                    },
                    {
                        "name": "雄塑科技",
                        "scale": 1727905513,
                        "id": "300599.SZ"
                    },
                    {
                        "name": "凯伦股份",
                        "scale": 4207952599,
                        "id": "300715.SZ"
                    },
                    {
                        "name": "科顺股份",
                        "scale": 9763102325,
                        "id": "300737.SZ"
                    },
                    {
                        "name": "正源股份",
                        "scale": 3.0059945E+9,
                        "id": "600321.SH"
                    },
                    {
                        "name": "四川金顶",
                        "scale": 2.059041E+9,
                        "id": "600678.SH"
                    },
                    {
                        "name": "华立股份",
                        "scale": 1715399985,
                        "id": "603038.SH"
                    },
                    {
                        "name": "韩建河山",
                        "scale": 2.28058064E+9,
                        "id": "603616.SH"
                    },
                    {
                        "name": "东宏股份",
                        "scale": 3471853684,
                        "id": "603856.SH"
                    },
                    {
                        "name": "丽岛新材",
                        "scale": 2.6506872E+9,
                        "id": "603937.SH"
                    },
                    {
                        "name": "四方新材",
                        "scale": 1.01252704E+9,
                        "id": "605122.SH"
                    },
                    {
                        "name": "华达新材",
                        "scale": 9.8277153E+8,
                        "id": "605158.SH"
                    },
                    {
                        "name": "法狮龙",
                        "scale": 6.4162347E+8,
                        "id": "605318.SH"
                    }
                ],
                "name": "其他建材",
                "scale": 319637468135,
                "id": "610300"
            }
        ],
        "name": "建筑材料",
        "scale": 792516210975,
        "id": "610000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "高新发展",
                        "scale": 3150014256,
                        "id": "000628.SZ"
                    },
                    {
                        "name": "浙江建投",
                        "scale": 12457761337,
                        "id": "002761.SZ"
                    },
                    {
                        "name": "华阳国际",
                        "scale": 1858871803,
                        "id": "002949.SZ"
                    },
                    {
                        "name": "华图山鼎",
                        "scale": 3991538318,
                        "id": "300492.SZ"
                    },
                    {
                        "name": "启迪设计",
                        "scale": 2813091718,
                        "id": "300500.SZ"
                    },
                    {
                        "name": "筑博设计",
                        "scale": 7.2684E+8,
                        "id": "300564.SZ"
                    },
                    {
                        "name": "杰恩设计",
                        "scale": 1612077238,
                        "id": "300668.SZ"
                    },
                    {
                        "name": "建科院",
                        "scale": 2249867178,
                        "id": "300675.SZ"
                    },
                    {
                        "name": "汉嘉设计",
                        "scale": 2363158582,
                        "id": "300746.SZ"
                    },
                    {
                        "name": "新城市",
                        "scale": 2167704758,
                        "id": "300778.SZ"
                    },
                    {
                        "name": "尤安设计",
                        "scale": 1.07488E+9,
                        "id": "300983.SZ"
                    },
                    {
                        "name": "霍普股份",
                        "scale": 4.154535E+8,
                        "id": "301024.SZ"
                    },
                    {
                        "name": "华蓝集团",
                        "scale": 1.75797834E+9,
                        "id": "301027.SZ"
                    },
                    {
                        "name": "上海建工",
                        "scale": 24398049775,
                        "id": "600170.SH"
                    },
                    {
                        "name": "龙元建设",
                        "scale": 10463544412,
                        "id": "600491.SH"
                    },
                    {
                        "name": "华建集团",
                        "scale": 4079000979,
                        "id": "600629.SH"
                    },
                    {
                        "name": "祥龙电业",
                        "scale": 3322297992,
                        "id": "600769.SH"
                    },
                    {
                        "name": "同济科技",
                        "scale": 5173025352,
                        "id": "600846.SH"
                    },
                    {
                        "name": "重庆建工",
                        "scale": 7397936076,
                        "id": "600939.SH"
                    },
                    {
                        "name": "中国建筑",
                        "scale": 200910004872,
                        "id": "601668.SH"
                    },
                    {
                        "name": "宁波建工",
                        "scale": 5390521006,
                        "id": "601789.SH"
                    },
                    {
                        "name": "中衡设计",
                        "scale": 2693816011,
                        "id": "603017.SH"
                    },
                    {
                        "name": "城地香江",
                        "scale": 3137450276,
                        "id": "603887.SH"
                    }
                ],
                "name": "房屋建设",
                "scale": 303604883779,
                "id": "620100"
            },
            {
                "children": [
                    {
                        "name": "宝鹰股份",
                        "scale": 5702927877,
                        "id": "002047.SZ"
                    },
                    {
                        "name": "金 螳 螂",
                        "scale": 13047969597,
                        "id": "002081.SZ"
                    },
                    {
                        "name": "洪涛股份",
                        "scale": 3052011053,
                        "id": "002325.SZ"
                    },
                    {
                        "name": "亚厦股份",
                        "scale": 6348839033,
                        "id": "002375.SZ"
                    },
                    {
                        "name": "ST广田",
                        "scale": 3655026034,
                        "id": "002482.SZ"
                    },
                    {
                        "name": "ST弘高",
                        "scale": 675592573,
                        "id": "002504.SZ"
                    },
                    {
                        "name": "瑞和股份",
                        "scale": 2114744056,
                        "id": "002620.SZ"
                    },
                    {
                        "name": "东易日盛",
                        "scale": 2568233216,
                        "id": "002713.SZ"
                    },
                    {
                        "name": "*ST奇信",
                        "scale": 1780212257,
                        "id": "002781.SZ"
                    },
                    {
                        "name": "建艺集团",
                        "scale": 1.32137911E+9,
                        "id": "002789.SZ"
                    },
                    {
                        "name": "郑中设计",
                        "scale": 2009641944,
                        "id": "002811.SZ"
                    },
                    {
                        "name": "中装建设",
                        "scale": 3215110343,
                        "id": "002822.SZ"
                    },
                    {
                        "name": "名雕股份",
                        "scale": 7.9554475E+8,
                        "id": "002830.SZ"
                    },
                    {
                        "name": "美芝股份",
                        "scale": 1.27137662E+9,
                        "id": "002856.SZ"
                    },
                    {
                        "name": "豪尔赛",
                        "scale": 883819929,
                        "id": "002963.SZ"
                    },
                    {
                        "name": "中天精装",
                        "scale": 1.49412648E+9,
                        "id": "002989.SZ"
                    },
                    {
                        "name": "名家汇",
                        "scale": 4.16792708E+9,
                        "id": "300506.SZ"
                    },
                    {
                        "name": "华凯易佰",
                        "scale": 2251824289,
                        "id": "300592.SZ"
                    },
                    {
                        "name": "维业股份",
                        "scale": 1665364973,
                        "id": "300621.SZ"
                    },
                    {
                        "name": "创兴资源",
                        "scale": 2.68410363E+9,
                        "id": "600193.SH"
                    },
                    {
                        "name": "江河集团",
                        "scale": 11262040476,
                        "id": "601886.SH"
                    },
                    {
                        "name": "全筑股份",
                        "scale": 1734408738,
                        "id": "603030.SH"
                    },
                    {
                        "name": "大丰实业",
                        "scale": 4387808902,
                        "id": "603081.SH"
                    },
                    {
                        "name": "风语筑",
                        "scale": 7770406844,
                        "id": "603466.SH"
                    },
                    {
                        "name": "柯利达",
                        "scale": 2055991706,
                        "id": "603828.SH"
                    },
                    {
                        "name": "时空科技",
                        "scale": 1.58187512E+9,
                        "id": "605178.SH"
                    },
                    {
                        "name": "德才股份",
                        "scale": 1517245702,
                        "id": "605287.SH"
                    },
                    {
                        "name": "罗曼股份",
                        "scale": 947765363,
                        "id": "605289.SH"
                    }
                ],
                "name": "装修装饰",
                "scale": 91963317695,
                "id": "620200"
            },
            {
                "children": [
                    {
                        "name": "山东路桥",
                        "scale": 6151029082,
                        "id": "000498.SZ"
                    },
                    {
                        "name": "甘咨询",
                        "scale": 3694223009,
                        "id": "000779.SZ"
                    },
                    {
                        "name": "粤 水 电",
                        "scale": 9350413174,
                        "id": "002060.SZ"
                    },
                    {
                        "name": "浙江交科",
                        "scale": 12011730156,
                        "id": "002061.SZ"
                    },
                    {
                        "name": "宏润建设",
                        "scale": 5.96966094E+9,
                        "id": "002062.SZ"
                    },
                    {
                        "name": "中国海诚",
                        "scale": 3656030755,
                        "id": "002116.SZ"
                    },
                    {
                        "name": "北新路桥",
                        "scale": 6.93895536E+9,
                        "id": "002307.SZ"
                    },
                    {
                        "name": "*ST围海",
                        "scale": 3736698301,
                        "id": "002586.SZ"
                    },
                    {
                        "name": "成都路桥",
                        "scale": 2.67999008E+9,
                        "id": "002628.SZ"
                    },
                    {
                        "name": "中设股份",
                        "scale": 1419207056,
                        "id": "002883.SZ"
                    },
                    {
                        "name": "新疆交建",
                        "scale": 9.03671809E+9,
                        "id": "002941.SZ"
                    },
                    {
                        "name": "地铁设计",
                        "scale": 975290965,
                        "id": "003013.SZ"
                    },
                    {
                        "name": "苏交科",
                        "scale": 5669131879,
                        "id": "300284.SZ"
                    },
                    {
                        "name": "永福股份",
                        "scale": 11384640482,
                        "id": "300712.SZ"
                    },
                    {
                        "name": "设研院",
                        "scale": 3363289142,
                        "id": "300732.SZ"
                    },
                    {
                        "name": "苏文电能",
                        "scale": 1830451806,
                        "id": "300982.SZ"
                    },
                    {
                        "name": "蕾奥规划",
                        "scale": 5.6241E+8,
                        "id": "300989.SZ"
                    },
                    {
                        "name": "四川路桥",
                        "scale": 48673120113,
                        "id": "600039.SH"
                    },
                    {
                        "name": "东湖高新",
                        "scale": 4590698977,
                        "id": "600133.SH"
                    },
                    {
                        "name": "浦东建设",
                        "scale": 6.47160752E+9,
                        "id": "600284.SH"
                    },
                    {
                        "name": "安徽建工",
                        "scale": 10085999194,
                        "id": "600502.SH"
                    },
                    {
                        "name": "腾达建设",
                        "scale": 4428960845,
                        "id": "600512.SH"
                    },
                    {
                        "name": "隧道股份",
                        "scale": 17512615244,
                        "id": "600820.SH"
                    },
                    {
                        "name": "龙建股份",
                        "scale": 3135292824,
                        "id": "600853.SH"
                    },
                    {
                        "name": "中国铁建",
                        "scale": 84088724605,
                        "id": "601186.SH"
                    },
                    {
                        "name": "中国中铁",
                        "scale": 1.1444309077E+11,
                        "id": "601390.SH"
                    },
                    {
                        "name": "中国核建",
                        "scale": 21131969284,
                        "id": "601611.SH"
                    },
                    {
                        "name": "中国电建",
                        "scale": 78808349752,
                        "id": "601669.SH"
                    },
                    {
                        "name": "中国交建",
                        "scale": 92450742795,
                        "id": "601800.SH"
                    },
                    {
                        "name": "中国能建",
                        "scale": 26259226362,
                        "id": "601868.SH"
                    },
                    {
                        "name": "华设集团",
                        "scale": 5.71670914E+9,
                        "id": "603018.SH"
                    },
                    {
                        "name": "设计总院",
                        "scale": 4599972104,
                        "id": "603357.SH"
                    },
                    {
                        "name": "勘设股份",
                        "scale": 3262631997,
                        "id": "603458.SH"
                    },
                    {
                        "name": "交建股份",
                        "scale": 2143913137,
                        "id": "603815.SH"
                    },
                    {
                        "name": "正平股份",
                        "scale": 3526101114,
                        "id": "603843.SH"
                    },
                    {
                        "name": "中公高科",
                        "scale": 1.5376408E+9,
                        "id": "603860.SH"
                    },
                    {
                        "name": "建发合诚",
                        "scale": 2698969588,
                        "id": "603909.SH"
                    }
                ],
                "name": "基础建设",
                "scale": 623996206442,
                "id": "620300"
            },
            {
                "children": [
                    {
                        "name": "方大集团",
                        "scale": 3353196226,
                        "id": "000055.SZ"
                    },
                    {
                        "name": "北方国际",
                        "scale": 7.57719201E+9,
                        "id": "000065.SZ"
                    },
                    {
                        "name": "中钢国际",
                        "scale": 7557993969,
                        "id": "000928.SZ"
                    },
                    {
                        "name": "中工国际",
                        "scale": 8876100542,
                        "id": "002051.SZ"
                    },
                    {
                        "name": "东南网架",
                        "scale": 8838706522,
                        "id": "002135.SZ"
                    },
                    {
                        "name": "东华科技",
                        "scale": 5747747416,
                        "id": "002140.SZ"
                    },
                    {
                        "name": "延华智能",
                        "scale": 3520274749,
                        "id": "002178.SZ"
                    },
                    {
                        "name": "中电兴发",
                        "scale": 4392823683,
                        "id": "002298.SZ"
                    },
                    {
                        "name": "三维化学",
                        "scale": 4027524051,
                        "id": "002469.SZ"
                    },
                    {
                        "name": "鸿路钢构",
                        "scale": 13351178251,
                        "id": "002541.SZ"
                    },
                    {
                        "name": "中化岩土",
                        "scale": 4810274987,
                        "id": "002542.SZ"
                    },
                    {
                        "name": "日上集团",
                        "scale": 2303872955,
                        "id": "002593.SZ"
                    },
                    {
                        "name": "富煌钢构",
                        "scale": 2680747634,
                        "id": "002743.SZ"
                    },
                    {
                        "name": "中岩大地",
                        "scale": 846115933,
                        "id": "003001.SZ"
                    },
                    {
                        "name": "三联虹普",
                        "scale": 4508434665,
                        "id": "300384.SZ"
                    },
                    {
                        "name": "海波重科",
                        "scale": 1580576552,
                        "id": "300517.SZ"
                    },
                    {
                        "name": "中达安",
                        "scale": 1532498779,
                        "id": "300635.SZ"
                    },
                    {
                        "name": "测绘股份",
                        "scale": 924495672,
                        "id": "300826.SZ"
                    },
                    {
                        "name": "深水规院",
                        "scale": 7.82067E+8,
                        "id": "301038.SZ"
                    },
                    {
                        "name": "能辉科技",
                        "scale": 1.5142324E+9,
                        "id": "301046.SZ"
                    },
                    {
                        "name": "中粮工科",
                        "scale": 1.7272024E+9,
                        "id": "301058.SZ"
                    },
                    {
                        "name": "新瀚新材",
                        "scale": 7.488E+8,
                        "id": "301076.SZ"
                    },
                    {
                        "name": "陕西建工",
                        "scale": 6745583164,
                        "id": "600248.SH"
                    },
                    {
                        "name": "杭萧钢构",
                        "scale": 11091000906,
                        "id": "600477.SH"
                    },
                    {
                        "name": "精工钢构",
                        "scale": 8574844727,
                        "id": "600496.SH"
                    },
                    {
                        "name": "中材国际",
                        "scale": 18506394934,
                        "id": "600970.SH"
                    },
                    {
                        "name": "中铝国际",
                        "scale": 11927692508,
                        "id": "601068.SH"
                    },
                    {
                        "name": "中国化学",
                        "scale": 52499548237,
                        "id": "601117.SH"
                    },
                    {
                        "name": "华电重工",
                        "scale": 6.29475E+9,
                        "id": "601226.SH"
                    },
                    {
                        "name": "中国中冶",
                        "scale": 57663959919,
                        "id": "601618.SH"
                    },
                    {
                        "name": "森特股份",
                        "scale": 17607983281,
                        "id": "603098.SH"
                    },
                    {
                        "name": "汇通集团",
                        "scale": 9.717778E+8,
                        "id": "603176.SH"
                    },
                    {
                        "name": "镇海股份",
                        "scale": 2137059331,
                        "id": "603637.SH"
                    },
                    {
                        "name": "航天工程",
                        "scale": 7.2305051E+9,
                        "id": "603698.SH"
                    },
                    {
                        "name": "亚翔集成",
                        "scale": 2.7502104E+9,
                        "id": "603929.SH"
                    },
                    {
                        "name": "百利科技",
                        "scale": 7629052316,
                        "id": "603959.SH"
                    },
                    {
                        "name": "利柏特",
                        "scale": 1735619574,
                        "id": "605167.SH"
                    },
                    {
                        "name": "上海港湾",
                        "scale": 757181477,
                        "id": "605598.SH"
                    },
                    {
                        "name": "润农节水",
                        "scale": 599586854,
                        "id": "830964.BJ"
                    }
                ],
                "name": "专业工程",
                "scale": 305924806924,
                "id": "620400"
            },
            {
                "children": [
                    {
                        "name": "美丽生态",
                        "scale": 1817156813,
                        "id": "000010.SZ"
                    },
                    {
                        "name": "汇绿生态",
                        "scale": 1442744654,
                        "id": "001267.SZ"
                    },
                    {
                        "name": "ST交投",
                        "scale": 1427029898,
                        "id": "002200.SZ"
                    },
                    {
                        "name": "东方园林",
                        "scale": 6147610963,
                        "id": "002310.SZ"
                    },
                    {
                        "name": "中锐股份",
                        "scale": 5748345488,
                        "id": "002374.SZ"
                    },
                    {
                        "name": "棕榈股份",
                        "scale": 4535411798,
                        "id": "002431.SZ"
                    },
                    {
                        "name": "普邦股份",
                        "scale": 2.50837848E+9,
                        "id": "002663.SZ"
                    },
                    {
                        "name": "岭南股份",
                        "scale": 3896173954,
                        "id": "002717.SZ"
                    },
                    {
                        "name": "文科园林",
                        "scale": 1773941412,
                        "id": "002775.SZ"
                    },
                    {
                        "name": "节能铁汉",
                        "scale": 4561727088,
                        "id": "300197.SZ"
                    },
                    {
                        "name": "美晨生态",
                        "scale": 3754367041,
                        "id": "300237.SZ"
                    },
                    {
                        "name": "蒙草生态",
                        "scale": 5047696709,
                        "id": "300355.SZ"
                    },
                    {
                        "name": "*ST美尚",
                        "scale": 1168795027,
                        "id": "300495.SZ"
                    },
                    {
                        "name": "农尚环境",
                        "scale": 3440982449,
                        "id": "300536.SZ"
                    },
                    {
                        "name": "杭州园林",
                        "scale": 2176962166,
                        "id": "300649.SZ"
                    },
                    {
                        "name": "山水比德",
                        "scale": 4.389056E+8,
                        "id": "300844.SZ"
                    },
                    {
                        "name": "冠中生态",
                        "scale": 1.072764E+9,
                        "id": "300948.SZ"
                    },
                    {
                        "name": "奥雅股份",
                        "scale": 616082093,
                        "id": "300949.SZ"
                    },
                    {
                        "name": "建研设计",
                        "scale": 5.856E+8,
                        "id": "301167.SZ"
                    },
                    {
                        "name": "中毅达",
                        "scale": 7685806604,
                        "id": "600610.SH"
                    },
                    {
                        "name": "ST花王",
                        "scale": 1276942843,
                        "id": "603007.SH"
                    },
                    {
                        "name": "诚邦股份",
                        "scale": 1.58029872E+9,
                        "id": "603316.SH"
                    },
                    {
                        "name": "东珠生态",
                        "scale": 5.464676E+9,
                        "id": "603359.SH"
                    },
                    {
                        "name": "元成股份",
                        "scale": 2338164892,
                        "id": "603388.SH"
                    },
                    {
                        "name": "天域生态",
                        "scale": 2338578694,
                        "id": "603717.SH"
                    },
                    {
                        "name": "乾景园林",
                        "scale": 2211428568,
                        "id": "603778.SH"
                    },
                    {
                        "name": "大千生态",
                        "scale": 2.23938E+9,
                        "id": "603955.SH"
                    },
                    {
                        "name": "太和水",
                        "scale": 1518575132,
                        "id": "605081.SH"
                    },
                    {
                        "name": "园林股份",
                        "scale": 8.1785724E+8,
                        "id": "605303.SH"
                    }
                ],
                "name": "园林工程",
                "scale": 79632384326,
                "id": "620500"
            }
        ],
        "name": "建筑装饰",
        "scale": 1405121599166,
        "id": "620000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "佳电股份",
                        "scale": 5597392544,
                        "id": "000922.SZ"
                    },
                    {
                        "name": "江特电机",
                        "scale": 42605227354,
                        "id": "002176.SZ"
                    },
                    {
                        "name": "方正电机",
                        "scale": 4882118835,
                        "id": "002196.SZ"
                    },
                    {
                        "name": "大洋电机",
                        "scale": 10976103767,
                        "id": "002249.SZ"
                    },
                    {
                        "name": "通达动力",
                        "scale": 2943033047,
                        "id": "002576.SZ"
                    },
                    {
                        "name": "微光股份",
                        "scale": 3838859505,
                        "id": "002801.SZ"
                    },
                    {
                        "name": "凯中精密",
                        "scale": 1808704594,
                        "id": "002823.SZ"
                    },
                    {
                        "name": "科力尔",
                        "scale": 3377234129,
                        "id": "002892.SZ"
                    },
                    {
                        "name": "兆威机电",
                        "scale": 3.81160128E+9,
                        "id": "003021.SZ"
                    },
                    {
                        "name": "华瑞股份",
                        "scale": 1325836392,
                        "id": "300626.SZ"
                    },
                    {
                        "name": "江苏雷利",
                        "scale": 5241631434,
                        "id": "300660.SZ"
                    },
                    {
                        "name": "康平科技",
                        "scale": 8.179248E+8,
                        "id": "300907.SZ"
                    },
                    {
                        "name": "江南奕帆",
                        "scale": 1.13289225E+9,
                        "id": "301023.SZ"
                    },
                    {
                        "name": "卧龙电驱",
                        "scale": 20415683165,
                        "id": "600580.SH"
                    },
                    {
                        "name": "迪贝电气",
                        "scale": 1691530745,
                        "id": "603320.SH"
                    },
                    {
                        "name": "八方股份",
                        "scale": 13108457071,
                        "id": "603489.SH"
                    },
                    {
                        "name": "鸣志电器",
                        "scale": 1.73239924E+10,
                        "id": "603728.SH"
                    },
                    {
                        "name": "神力股份",
                        "scale": 4160823874,
                        "id": "603819.SH"
                    },
                    {
                        "name": "中电电机",
                        "scale": 2.758896E+9,
                        "id": "603988.SH"
                    }
                ],
                "name": "电机",
                "scale": 147817943186,
                "id": "630100"
            },
            {
                "children": [
                    {
                        "name": "许继电气",
                        "scale": 2.224243267E+10,
                        "id": "000400.SZ"
                    },
                    {
                        "name": "东方电子",
                        "scale": 10550485853,
                        "id": "000682.SZ"
                    },
                    {
                        "name": "威尔泰",
                        "scale": 2015098356,
                        "id": "002058.SZ"
                    },
                    {
                        "name": "金智科技",
                        "scale": 4760812085,
                        "id": "002090.SZ"
                    },
                    {
                        "name": "科陆电子",
                        "scale": 11136024576,
                        "id": "002121.SZ"
                    },
                    {
                        "name": "智光电气",
                        "scale": 6672811416,
                        "id": "002169.SZ"
                    },
                    {
                        "name": "海得控制",
                        "scale": 3263652144,
                        "id": "002184.SZ"
                    },
                    {
                        "name": "理工能科",
                        "scale": 3442666721,
                        "id": "002322.SZ"
                    },
                    {
                        "name": "英威腾",
                        "scale": 4857858819,
                        "id": "002334.SZ"
                    },
                    {
                        "name": "积成电子",
                        "scale": 3668986223,
                        "id": "002339.SZ"
                    },
                    {
                        "name": "新时达",
                        "scale": 4521168161,
                        "id": "002527.SZ"
                    },
                    {
                        "name": "新联电子",
                        "scale": 3454829445,
                        "id": "002546.SZ"
                    },
                    {
                        "name": "先锋电子",
                        "scale": 1576689733,
                        "id": "002767.SZ"
                    },
                    {
                        "name": "雷赛智能",
                        "scale": 3519500702,
                        "id": "002979.SZ"
                    },
                    {
                        "name": "中元股份",
                        "scale": 2.59258617E+9,
                        "id": "300018.SZ"
                    },
                    {
                        "name": "九洲集团",
                        "scale": 3549376727,
                        "id": "300040.SZ"
                    },
                    {
                        "name": "合康新能",
                        "scale": 7125332709,
                        "id": "300048.SZ"
                    },
                    {
                        "name": "汇川技术",
                        "scale": 1.4305800975E+11,
                        "id": "300124.SZ"
                    },
                    {
                        "name": "青岛中程",
                        "scale": 7190144608,
                        "id": "300208.SZ"
                    },
                    {
                        "name": "安科瑞",
                        "scale": 5529633432,
                        "id": "300286.SZ"
                    },
                    {
                        "name": "*ST光一",
                        "scale": 1037283039,
                        "id": "300356.SZ"
                    },
                    {
                        "name": "炬华科技",
                        "scale": 5658535363,
                        "id": "300360.SZ"
                    },
                    {
                        "name": "凯发电气",
                        "scale": 1744017683,
                        "id": "300407.SZ"
                    },
                    {
                        "name": "红相股份",
                        "scale": 5668070828,
                        "id": "300427.SZ"
                    },
                    {
                        "name": "赛摩智能",
                        "scale": 2629113969,
                        "id": "300466.SZ"
                    },
                    {
                        "name": "蓝海华腾",
                        "scale": 2068859997,
                        "id": "300484.SZ"
                    },
                    {
                        "name": "华自科技",
                        "scale": 4471626911,
                        "id": "300490.SZ"
                    },
                    {
                        "name": "友讯达",
                        "scale": 1.78601216E+9,
                        "id": "300514.SZ"
                    },
                    {
                        "name": "欣锐科技",
                        "scale": 4965862938,
                        "id": "300745.SZ"
                    },
                    {
                        "name": "迦南智能",
                        "scale": 1492138368,
                        "id": "300880.SZ"
                    },
                    {
                        "name": "万胜智能",
                        "scale": 979309565,
                        "id": "300882.SZ"
                    },
                    {
                        "name": "国电南自",
                        "scale": 7056941618,
                        "id": "600268.SH"
                    },
                    {
                        "name": "国电南瑞",
                        "scale": 186236212257,
                        "id": "600406.SH"
                    },
                    {
                        "name": "长园集团",
                        "scale": 7247052094,
                        "id": "600525.SH"
                    },
                    {
                        "name": "泰豪科技",
                        "scale": 5980907918,
                        "id": "600590.SH"
                    },
                    {
                        "name": "四方股份",
                        "scale": 1.365315788E+10,
                        "id": "601126.SH"
                    },
                    {
                        "name": "林洋能源",
                        "scale": 18273700414,
                        "id": "601222.SH"
                    },
                    {
                        "name": "三星医疗",
                        "scale": 16500171731,
                        "id": "601567.SH"
                    },
                    {
                        "name": "弘讯科技",
                        "scale": 3.56116939E+9,
                        "id": "603015.SH"
                    },
                    {
                        "name": "大豪科技",
                        "scale": 19405799467,
                        "id": "603025.SH"
                    },
                    {
                        "name": "科林电气",
                        "scale": 2658623539,
                        "id": "603050.SH"
                    },
                    {
                        "name": "禾望电气",
                        "scale": 1.589017841E+10,
                        "id": "603063.SH"
                    },
                    {
                        "name": "川仪股份",
                        "scale": 8.25945E+9,
                        "id": "603100.SH"
                    },
                    {
                        "name": "信捷电气",
                        "scale": 6.60632E+9,
                        "id": "603416.SH"
                    },
                    {
                        "name": "捷昌驱动",
                        "scale": 12475780678,
                        "id": "603583.SH"
                    },
                    {
                        "name": "能科科技",
                        "scale": 5296872989,
                        "id": "603859.SH"
                    },
                    {
                        "name": "凯迪股份",
                        "scale": 764416009,
                        "id": "605288.SH"
                    },
                    {
                        "name": "智洋创新",
                        "scale": 1375351987,
                        "id": "688191.SH"
                    },
                    {
                        "name": "南网科技",
                        "scale": 3157851848,
                        "id": "688248.SH"
                    },
                    {
                        "name": "宏力达",
                        "scale": 5366962453,
                        "id": "688330.SH"
                    },
                    {
                        "name": "正弦电气",
                        "scale": 962719317,
                        "id": "688395.SH"
                    },
                    {
                        "name": "煜邦电力",
                        "scale": 2200084987,
                        "id": "688597.SH"
                    },
                    {
                        "name": "杭州柯林",
                        "scale": 8.7888775E+8,
                        "id": "688611.SH"
                    },
                    {
                        "name": "西力科技",
                        "scale": 6.5738535E+8,
                        "id": "688616.SH"
                    },
                    {
                        "name": "科汇股份",
                        "scale": 1.07589057E+9,
                        "id": "688681.SH"
                    },
                    {
                        "name": "伟创电气",
                        "scale": 9.7983E+8,
                        "id": "688698.SH"
                    },
                    {
                        "name": "中控技术",
                        "scale": 22993356401,
                        "id": "688777.SH"
                    }
                ],
                "name": "电气自动化设备",
                "scale": 656744006178,
                "id": "630200"
            },
            {
                "children": [
                    {
                        "name": "北清环能",
                        "scale": 4338811497,
                        "id": "000803.SZ"
                    },
                    {
                        "name": "国轩高科",
                        "scale": 50705939131,
                        "id": "002074.SZ"
                    },
                    {
                        "name": "TCL中环",
                        "scale": 163377443719,
                        "id": "002129.SZ"
                    },
                    {
                        "name": "金风科技",
                        "scale": 50768182202,
                        "id": "002202.SZ"
                    },
                    {
                        "name": "拓日新能",
                        "scale": 8.72484576E+9,
                        "id": "002218.SZ"
                    },
                    {
                        "name": "奥 特 迅",
                        "scale": 3575961061,
                        "id": "002227.SZ"
                    },
                    {
                        "name": "海陆重工",
                        "scale": 3845570026,
                        "id": "002255.SZ"
                    },
                    {
                        "name": "ST中利",
                        "scale": 3750399219,
                        "id": "002309.SZ"
                    },
                    {
                        "name": "科华数据",
                        "scale": 14908458295,
                        "id": "002335.SZ"
                    },
                    {
                        "name": "中恒电气",
                        "scale": 4274535571,
                        "id": "002364.SZ"
                    },
                    {
                        "name": "晶澳科技",
                        "scale": 78761868532,
                        "id": "002459.SZ"
                    },
                    {
                        "name": "协鑫集成",
                        "scale": 24684932947,
                        "id": "002506.SZ"
                    },
                    {
                        "name": "科士达",
                        "scale": 17667400438,
                        "id": "002518.SZ"
                    },
                    {
                        "name": "天顺风能",
                        "scale": 29383110978,
                        "id": "002531.SZ"
                    },
                    {
                        "name": "西子洁能",
                        "scale": 16570664502,
                        "id": "002534.SZ"
                    },
                    {
                        "name": "圣阳股份",
                        "scale": 3312250578,
                        "id": "002580.SZ"
                    },
                    {
                        "name": "露笑科技",
                        "scale": 1.839553829E+10,
                        "id": "002617.SZ"
                    },
                    {
                        "name": "华西能源",
                        "scale": 2642159725,
                        "id": "002630.SZ"
                    },
                    {
                        "name": "首航高科",
                        "scale": 12463599122,
                        "id": "002665.SZ"
                    },
                    {
                        "name": "雄韬股份",
                        "scale": 7024512835,
                        "id": "002733.SZ"
                    },
                    {
                        "name": "科达利",
                        "scale": 22258314166,
                        "id": "002850.SZ"
                    },
                    {
                        "name": "麦格米特",
                        "scale": 11431202246,
                        "id": "002851.SZ"
                    },
                    {
                        "name": "鼎汉技术",
                        "scale": 3053129648,
                        "id": "300011.SZ"
                    },
                    {
                        "name": "亿纬锂能",
                        "scale": 177590270548,
                        "id": "300014.SZ"
                    },
                    {
                        "name": "ST天龙",
                        "scale": 1.63212291E+9,
                        "id": "300029.SZ"
                    },
                    {
                        "name": "南都电源",
                        "scale": 20045749609,
                        "id": "300068.SZ"
                    },
                    {
                        "name": "龙源技术",
                        "scale": 3423134212,
                        "id": "300105.SZ"
                    },
                    {
                        "name": "向日葵",
                        "scale": 3396408369,
                        "id": "300111.SZ"
                    },
                    {
                        "name": "保力新",
                        "scale": 7879610742,
                        "id": "300116.SZ"
                    },
                    {
                        "name": "东方日升",
                        "scale": 24046428204,
                        "id": "300118.SZ"
                    },
                    {
                        "name": "泰胜风能",
                        "scale": 5086701572,
                        "id": "300129.SZ"
                    },
                    {
                        "name": "和顺电气",
                        "scale": 1878993396,
                        "id": "300141.SZ"
                    },
                    {
                        "name": "科泰电源",
                        "scale": 2941810268,
                        "id": "300153.SZ"
                    },
                    {
                        "name": "通裕重工",
                        "scale": 8920624042,
                        "id": "300185.SZ"
                    },
                    {
                        "name": "阳光电源",
                        "scale": 139201328071,
                        "id": "300274.SZ"
                    },
                    {
                        "name": "晶盛机电",
                        "scale": 81550771933,
                        "id": "300316.SZ"
                    },
                    {
                        "name": "珈伟新能",
                        "scale": 5173633384,
                        "id": "300317.SZ"
                    },
                    {
                        "name": "易事特",
                        "scale": 19352204922,
                        "id": "300376.SZ"
                    },
                    {
                        "name": "中来股份",
                        "scale": 18458853396,
                        "id": "300393.SZ"
                    },
                    {
                        "name": "鹏辉能源",
                        "scale": 24822181178,
                        "id": "300438.SZ"
                    },
                    {
                        "name": "金雷股份",
                        "scale": 8.54657854E+9,
                        "id": "300443.SZ"
                    },
                    {
                        "name": "通合科技",
                        "scale": 2297207869,
                        "id": "300491.SZ"
                    },
                    {
                        "name": "天能重工",
                        "scale": 6731115426,
                        "id": "300569.SZ"
                    },
                    {
                        "name": "新雷能",
                        "scale": 13481582688,
                        "id": "300593.SZ"
                    },
                    {
                        "name": "盛弘股份",
                        "scale": 4979283476,
                        "id": "300693.SZ"
                    },
                    {
                        "name": "英可瑞",
                        "scale": 1292424615,
                        "id": "300713.SZ"
                    },
                    {
                        "name": "宁德时代",
                        "scale": 1.02340556802E+12,
                        "id": "300750.SZ"
                    },
                    {
                        "name": "锦浪科技",
                        "scale": 71913931625,
                        "id": "300763.SZ"
                    },
                    {
                        "name": "运达股份",
                        "scale": 7165110365,
                        "id": "300772.SZ"
                    },
                    {
                        "name": "英杰电气",
                        "scale": 3450604288,
                        "id": "300820.SZ"
                    },
                    {
                        "name": "上能电气",
                        "scale": 6322179014,
                        "id": "300827.SZ"
                    },
                    {
                        "name": "新强联",
                        "scale": 16968140904,
                        "id": "300850.SZ"
                    },
                    {
                        "name": "欧陆通",
                        "scale": 2039285072,
                        "id": "300870.SZ"
                    },
                    {
                        "name": "中环海陆",
                        "scale": 2.00883212E+9,
                        "id": "301040.SZ"
                    },
                    {
                        "name": "绿岛风",
                        "scale": 4.7196E+8,
                        "id": "301043.SZ"
                    },
                    {
                        "name": "百胜智能",
                        "scale": 595687157,
                        "id": "301083.SZ"
                    },
                    {
                        "name": "华研精机",
                        "scale": 9.99E+8,
                        "id": "301138.SZ"
                    },
                    {
                        "name": "通灵股份",
                        "scale": 1.914E+9,
                        "id": "301168.SZ"
                    },
                    {
                        "name": "迈赫股份",
                        "scale": 9.458558E+8,
                        "id": "301199.SZ"
                    },
                    {
                        "name": "苏轴股份",
                        "scale": 447630209,
                        "id": "430418.BJ"
                    },
                    {
                        "name": "航天机电",
                        "scale": 15246101811,
                        "id": "600151.SH"
                    },
                    {
                        "name": "哈空调",
                        "scale": 2.18504183E+9,
                        "id": "600202.SH"
                    },
                    {
                        "name": "安彩高科",
                        "scale": 7.29197798E+9,
                        "id": "600207.SH"
                    },
                    {
                        "name": "ST时万",
                        "scale": 2363245983,
                        "id": "600241.SH"
                    },
                    {
                        "name": "ST华仪",
                        "scale": 1816169391,
                        "id": "600290.SH"
                    },
                    {
                        "name": "动力源",
                        "scale": 3856329873,
                        "id": "600405.SH"
                    },
                    {
                        "name": "湘电股份",
                        "scale": 14810551119,
                        "id": "600416.SH"
                    },
                    {
                        "name": "通威股份",
                        "scale": 230119143166,
                        "id": "600438.SH"
                    },
                    {
                        "name": "华光环能",
                        "scale": 8064712689,
                        "id": "600475.SH"
                    },
                    {
                        "name": "亿晶光电",
                        "scale": 6799356569,
                        "id": "600537.SH"
                    },
                    {
                        "name": "爱旭股份",
                        "scale": 27906431857,
                        "id": "600732.SH"
                    },
                    {
                        "name": "万里股份",
                        "scale": 2921657844,
                        "id": "600847.SH"
                    },
                    {
                        "name": "东方电气",
                        "scale": 3.30987129E+10,
                        "id": "600875.SH"
                    },
                    {
                        "name": "隆基绿能",
                        "scale": 443917248046,
                        "id": "601012.SH"
                    },
                    {
                        "name": "吉鑫科技",
                        "scale": 4905815311,
                        "id": "601218.SH"
                    },
                    {
                        "name": "明阳智能",
                        "scale": 60397181554,
                        "id": "601615.SH"
                    },
                    {
                        "name": "上海电气",
                        "scale": 55303779392,
                        "id": "601727.SH"
                    },
                    {
                        "name": "京运通",
                        "scale": 22817997036,
                        "id": "601908.SH"
                    },
                    {
                        "name": "赛伍技术",
                        "scale": 7586885892,
                        "id": "603212.SH"
                    },
                    {
                        "name": "日月股份",
                        "scale": 25060661005,
                        "id": "603218.SH"
                    },
                    {
                        "name": "金辰股份",
                        "scale": 13102186672,
                        "id": "603396.SH"
                    },
                    {
                        "name": "振江股份",
                        "scale": 4218544125,
                        "id": "603507.SH"
                    },
                    {
                        "name": "清源股份",
                        "scale": 4.2439E+9,
                        "id": "603628.SH"
                    },
                    {
                        "name": "璞泰来",
                        "scale": 9.846425685E+10,
                        "id": "603659.SH"
                    },
                    {
                        "name": "福斯特",
                        "scale": 9.746911208E+10,
                        "id": "603806.SH"
                    },
                    {
                        "name": "野马电池",
                        "scale": 9.25185E+8,
                        "id": "605378.SH"
                    },
                    {
                        "name": "恒盛能源",
                        "scale": 6.53E+8,
                        "id": "605580.SH"
                    },
                    {
                        "name": "禾迈股份",
                        "scale": 11743524545,
                        "id": "688032.SH"
                    },
                    {
                        "name": "派能科技",
                        "scale": 30872365856,
                        "id": "688063.SH"
                    },
                    {
                        "name": "晶科能源",
                        "scale": 2.5284E+10,
                        "id": "688223.SH"
                    },
                    {
                        "name": "大全能源",
                        "scale": 17445076208,
                        "id": "688303.SH"
                    },
                    {
                        "name": "亿华通-U",
                        "scale": 8717631032,
                        "id": "688339.SH"
                    },
                    {
                        "name": "博力威",
                        "scale": 1.72156E+9,
                        "id": "688345.SH"
                    },
                    {
                        "name": "固德威",
                        "scale": 29002594156,
                        "id": "688390.SH"
                    },
                    {
                        "name": "中信博",
                        "scale": 1.002881488E+10,
                        "id": "688408.SH"
                    },
                    {
                        "name": "奥特维",
                        "scale": 18585461004,
                        "id": "688516.SH"
                    },
                    {
                        "name": "明冠新材",
                        "scale": 3737439034,
                        "id": "688560.SH"
                    },
                    {
                        "name": "孚能科技",
                        "scale": 25748335658,
                        "id": "688567.SH"
                    },
                    {
                        "name": "天合光能",
                        "scale": 1.0987503579E+11,
                        "id": "688599.SH"
                    },
                    {
                        "name": "电气风电",
                        "scale": 4.71808059E+9,
                        "id": "688660.SH"
                    },
                    {
                        "name": "海优新材",
                        "scale": 1.18652599E+10,
                        "id": "688680.SH"
                    },
                    {
                        "name": "珠海冠宇",
                        "scale": 3.49781E+9,
                        "id": "688772.SH"
                    },
                    {
                        "name": "天能股份",
                        "scale": 5455125716,
                        "id": "688819.SH"
                    },
                    {
                        "name": "球冠电缆",
                        "scale": 419648775,
                        "id": "834682.BJ"
                    },
                    {
                        "name": "连城数控",
                        "scale": 8367032353,
                        "id": "835368.BJ"
                    },
                    {
                        "name": "同享科技",
                        "scale": 9.2562345E+8,
                        "id": "839167.BJ"
                    }
                ],
                "name": "电源设备",
                "scale": 3800851239354,
                "id": "630300"
            },
            {
                "children": [
                    {
                        "name": "顺钠股份",
                        "scale": 3088909824,
                        "id": "000533.SZ"
                    },
                    {
                        "name": "*ST银河",
                        "scale": 1.53847038E+9,
                        "id": "000806.SZ"
                    },
                    {
                        "name": "华菱线缆",
                        "scale": 3.08291568E+9,
                        "id": "001208.SZ"
                    },
                    {
                        "name": "思源电气",
                        "scale": 27822285846,
                        "id": "002028.SZ"
                    },
                    {
                        "name": "三变科技",
                        "scale": 1960196525,
                        "id": "002112.SZ"
                    },
                    {
                        "name": "华明装备",
                        "scale": 6992460113,
                        "id": "002270.SZ"
                    },
                    {
                        "name": "万马股份",
                        "scale": 11180973758,
                        "id": "002276.SZ"
                    },
                    {
                        "name": "太阳电缆",
                        "scale": 5436785051,
                        "id": "002300.SZ"
                    },
                    {
                        "name": "柘中股份",
                        "scale": 6172057101,
                        "id": "002346.SZ"
                    },
                    {
                        "name": "北京科锐",
                        "scale": 4397327013,
                        "id": "002350.SZ"
                    },
                    {
                        "name": "ST森源",
                        "scale": 2.93471064E+9,
                        "id": "002358.SZ"
                    },
                    {
                        "name": "众业达",
                        "scale": 4291583272,
                        "id": "002441.SZ"
                    },
                    {
                        "name": "摩恩电气",
                        "scale": 3.09600045E+9,
                        "id": "002451.SZ"
                    },
                    {
                        "name": "长高电新",
                        "scale": 4502196687,
                        "id": "002452.SZ"
                    },
                    {
                        "name": "中超控股",
                        "scale": 4621592474,
                        "id": "002471.SZ"
                    },
                    {
                        "name": "汉缆股份",
                        "scale": 1.443829464E+10,
                        "id": "002498.SZ"
                    },
                    {
                        "name": "金杯电工",
                        "scale": 4.98498493E+9,
                        "id": "002533.SZ"
                    },
                    {
                        "name": "通达股份",
                        "scale": 3344071382,
                        "id": "002560.SZ"
                    },
                    {
                        "name": "大连电瓷",
                        "scale": 4658167164,
                        "id": "002606.SZ"
                    },
                    {
                        "name": "融钰集团",
                        "scale": 2965112633,
                        "id": "002622.SZ"
                    },
                    {
                        "name": "ST远程",
                        "scale": 2678792061,
                        "id": "002692.SZ"
                    },
                    {
                        "name": "良信股份",
                        "scale": 11504499093,
                        "id": "002706.SZ"
                    },
                    {
                        "name": "长缆科技",
                        "scale": 2389217947,
                        "id": "002879.SZ"
                    },
                    {
                        "name": "金龙羽",
                        "scale": 4729578375,
                        "id": "002882.SZ"
                    },
                    {
                        "name": "泰永长征",
                        "scale": 2639873311,
                        "id": "002927.SZ"
                    },
                    {
                        "name": "日丰股份",
                        "scale": 2082537609,
                        "id": "002953.SZ"
                    },
                    {
                        "name": "特锐德",
                        "scale": 18143792884,
                        "id": "300001.SZ"
                    },
                    {
                        "name": "中能电气",
                        "scale": 3250217307,
                        "id": "300062.SZ"
                    },
                    {
                        "name": "金利华电",
                        "scale": 2.1762E+9,
                        "id": "300069.SZ"
                    },
                    {
                        "name": "电科院",
                        "scale": 3600566307,
                        "id": "300215.SZ"
                    },
                    {
                        "name": "通光线缆",
                        "scale": 3752151949,
                        "id": "300265.SZ"
                    },
                    {
                        "name": "温州宏丰",
                        "scale": 1940994153,
                        "id": "300283.SZ"
                    },
                    {
                        "name": "昇辉科技",
                        "scale": 3499054441,
                        "id": "300423.SZ"
                    },
                    {
                        "name": "双杰电气",
                        "scale": 2868280899,
                        "id": "300444.SZ"
                    },
                    {
                        "name": "全信股份",
                        "scale": 3906921052,
                        "id": "300447.SZ"
                    },
                    {
                        "name": "合纵科技",
                        "scale": 6488225761,
                        "id": "300477.SZ"
                    },
                    {
                        "name": "金冠股份",
                        "scale": 4168689648,
                        "id": "300510.SZ"
                    },
                    {
                        "name": "安靠智电",
                        "scale": 4787560841,
                        "id": "300617.SZ"
                    },
                    {
                        "name": "大烨智能",
                        "scale": 1698792526,
                        "id": "300670.SZ"
                    },
                    {
                        "name": "三友联众",
                        "scale": 1845589119,
                        "id": "300932.SZ"
                    },
                    {
                        "name": "中辰股份",
                        "scale": 2.0681475E+9,
                        "id": "300933.SZ"
                    },
                    {
                        "name": "扬电科技",
                        "scale": 2.45946E+9,
                        "id": "301012.SZ"
                    },
                    {
                        "name": "久盛电气",
                        "scale": 836731504,
                        "id": "301082.SZ"
                    },
                    {
                        "name": "特变电工",
                        "scale": 90562051674,
                        "id": "600089.SH"
                    },
                    {
                        "name": "*ST天成",
                        "scale": 1853505639,
                        "id": "600112.SH"
                    },
                    {
                        "name": "长城电工",
                        "scale": 2.79184736E+9,
                        "id": "600192.SH"
                    },
                    {
                        "name": "平高电气",
                        "scale": 11615246405,
                        "id": "600312.SH"
                    },
                    {
                        "name": "宝光股份",
                        "scale": 3797317986,
                        "id": "600379.SH"
                    },
                    {
                        "name": "百利电气",
                        "scale": 5329903073,
                        "id": "600468.SH"
                    },
                    {
                        "name": "国网英大",
                        "scale": 10580994382,
                        "id": "600517.SH"
                    },
                    {
                        "name": "保变电气",
                        "scale": 1.1509553E+10,
                        "id": "600550.SH"
                    },
                    {
                        "name": "精达股份",
                        "scale": 1.29326727E+10,
                        "id": "600577.SH"
                    },
                    {
                        "name": "远东股份",
                        "scale": 15602049804,
                        "id": "600869.SH"
                    },
                    {
                        "name": "宏发股份",
                        "scale": 39767546809,
                        "id": "600885.SH"
                    },
                    {
                        "name": "宝胜股份",
                        "scale": 7161229864,
                        "id": "600973.SH"
                    },
                    {
                        "name": "中国西电",
                        "scale": 25526894113,
                        "id": "601179.SH"
                    },
                    {
                        "name": "广电电气",
                        "scale": 3.3867815E+9,
                        "id": "601616.SH"
                    },
                    {
                        "name": "风范股份",
                        "scale": 6709585798,
                        "id": "601700.SH"
                    },
                    {
                        "name": "正泰电器",
                        "scale": 75421072169,
                        "id": "601877.SH"
                    },
                    {
                        "name": "新宏泰",
                        "scale": 3.25952E+9,
                        "id": "603016.SH"
                    },
                    {
                        "name": "尚纬股份",
                        "scale": 4170450102,
                        "id": "603333.SH"
                    },
                    {
                        "name": "神马电力",
                        "scale": 7080473296,
                        "id": "603530.SH"
                    },
                    {
                        "name": "汇金通",
                        "scale": 3.16331148E+9,
                        "id": "603577.SH"
                    },
                    {
                        "name": "东方电缆",
                        "scale": 51303566453,
                        "id": "603606.SH"
                    },
                    {
                        "name": "杭电股份",
                        "scale": 4657717568,
                        "id": "603618.SH"
                    },
                    {
                        "name": "洛凯股份",
                        "scale": 1.944E+9,
                        "id": "603829.SH"
                    },
                    {
                        "name": "白云电器",
                        "scale": 3795023562,
                        "id": "603861.SH"
                    },
                    {
                        "name": "长城科技",
                        "scale": 7468842939,
                        "id": "603897.SH"
                    },
                    {
                        "name": "天正电气",
                        "scale": 2038375195,
                        "id": "605066.SH"
                    },
                    {
                        "name": "华通线缆",
                        "scale": 2733472067,
                        "id": "605196.SH"
                    },
                    {
                        "name": "起帆电缆",
                        "scale": 2187663383,
                        "id": "605222.SH"
                    },
                    {
                        "name": "新亚电子",
                        "scale": 1682955202,
                        "id": "605277.SH"
                    },
                    {
                        "name": "威腾电气",
                        "scale": 1.52441824E+9,
                        "id": "688226.SH"
                    },
                    {
                        "name": "金冠电气",
                        "scale": 1162324667,
                        "id": "688517.SH"
                    },
                    {
                        "name": "金盘科技",
                        "scale": 6250379095,
                        "id": "688676.SH"
                    }
                ],
                "name": "高低压设备",
                "scale": 643995715375,
                "id": "630400"
            }
        ],
        "name": "电气设备",
        "scale": 5249408904093,
        "id": "630000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "*ST沈机",
                        "scale": 8824808706,
                        "id": "000410.SZ"
                    },
                    {
                        "name": "冰山冷热",
                        "scale": 3477763268,
                        "id": "000530.SZ"
                    },
                    {
                        "name": "苏常柴Ａ",
                        "scale": 2619090212,
                        "id": "000570.SZ"
                    },
                    {
                        "name": "宝塔实业",
                        "scale": 8592231943,
                        "id": "000595.SZ"
                    },
                    {
                        "name": "中核科技",
                        "scale": 4217472061,
                        "id": "000777.SZ"
                    },
                    {
                        "name": "冰轮环境",
                        "scale": 8.27116008E+9,
                        "id": "000811.SZ"
                    },
                    {
                        "name": "智慧农业",
                        "scale": 6020061775,
                        "id": "000816.SZ"
                    },
                    {
                        "name": "秦川机床",
                        "scale": 7556786444,
                        "id": "000837.SZ"
                    },
                    {
                        "name": "潍柴重机",
                        "scale": 1.5243228E+9,
                        "id": "000880.SZ"
                    },
                    {
                        "name": "山东威达",
                        "scale": 5592294272,
                        "id": "002026.SZ"
                    },
                    {
                        "name": "国机精工",
                        "scale": 8557376953,
                        "id": "002046.SZ"
                    },
                    {
                        "name": "ST天马",
                        "scale": 2679552537,
                        "id": "002122.SZ"
                    },
                    {
                        "name": "汉钟精机",
                        "scale": 13926365035,
                        "id": "002158.SZ"
                    },
                    {
                        "name": "宁波东力",
                        "scale": 3664459661,
                        "id": "002164.SZ"
                    },
                    {
                        "name": "华东数控",
                        "scale": 2684436588,
                        "id": "002248.SZ"
                    },
                    {
                        "name": "川润股份",
                        "scale": 2544828663,
                        "id": "002272.SZ"
                    },
                    {
                        "name": "博深股份",
                        "scale": 3222964509,
                        "id": "002282.SZ"
                    },
                    {
                        "name": "泰尔股份",
                        "scale": 1924712059,
                        "id": "002347.SZ"
                    },
                    {
                        "name": "胜利精密",
                        "scale": 9262595564,
                        "id": "002426.SZ"
                    },
                    {
                        "name": "江苏神通",
                        "scale": 6916673501,
                        "id": "002438.SZ"
                    },
                    {
                        "name": "巨星科技",
                        "scale": 26842721619,
                        "id": "002444.SZ"
                    },
                    {
                        "name": "新筑股份",
                        "scale": 3488086929,
                        "id": "002480.SZ"
                    },
                    {
                        "name": "宝馨科技",
                        "scale": 7606890445,
                        "id": "002514.SZ"
                    },
                    {
                        "name": "日发精机",
                        "scale": 5141263383,
                        "id": "002520.SZ"
                    },
                    {
                        "name": "天山铝业",
                        "scale": 19684564855,
                        "id": "002532.SZ"
                    },
                    {
                        "name": "宝鼎科技",
                        "scale": 3692250974,
                        "id": "002552.SZ"
                    },
                    {
                        "name": "亚威股份",
                        "scale": 4221191901,
                        "id": "002559.SZ"
                    },
                    {
                        "name": "山东章鼓",
                        "scale": 3037763729,
                        "id": "002598.SZ"
                    },
                    {
                        "name": "申科股份",
                        "scale": 1700385375,
                        "id": "002633.SZ"
                    },
                    {
                        "name": "雪人股份",
                        "scale": 7443379716,
                        "id": "002639.SZ"
                    },
                    {
                        "name": "华东重机",
                        "scale": 3.15775792E+9,
                        "id": "002685.SZ"
                    },
                    {
                        "name": "亿利达",
                        "scale": 2.39345343E+9,
                        "id": "002686.SZ"
                    },
                    {
                        "name": "埃斯顿",
                        "scale": 20092185195,
                        "id": "002747.SZ"
                    },
                    {
                        "name": "凤形股份",
                        "scale": 1946138172,
                        "id": "002760.SZ"
                    },
                    {
                        "name": "永和智控",
                        "scale": 2123240797,
                        "id": "002795.SZ"
                    },
                    {
                        "name": "伟隆股份",
                        "scale": 1357904189,
                        "id": "002871.SZ"
                    },
                    {
                        "name": "智能自控",
                        "scale": 1529859032,
                        "id": "002877.SZ"
                    },
                    {
                        "name": "凌霄泵业",
                        "scale": 5276667369,
                        "id": "002884.SZ"
                    },
                    {
                        "name": "中大力德",
                        "scale": 5108427808,
                        "id": "002896.SZ"
                    },
                    {
                        "name": "宇环数控",
                        "scale": 2563334406,
                        "id": "002903.SZ"
                    },
                    {
                        "name": "锋龙股份",
                        "scale": 2416355196,
                        "id": "002931.SZ"
                    },
                    {
                        "name": "宇晶股份",
                        "scale": 4576313997,
                        "id": "002943.SZ"
                    },
                    {
                        "name": "思进智能",
                        "scale": 1640277306,
                        "id": "003025.SZ"
                    },
                    {
                        "name": "机器人",
                        "scale": 17256745397,
                        "id": "300024.SZ"
                    },
                    {
                        "name": "易成新能",
                        "scale": 7541960818,
                        "id": "300080.SZ"
                    },
                    {
                        "name": "金通灵",
                        "scale": 4900702065,
                        "id": "300091.SZ"
                    },
                    {
                        "name": "科新机电",
                        "scale": 1827228456,
                        "id": "300092.SZ"
                    },
                    {
                        "name": "华伍股份",
                        "scale": 3891720719,
                        "id": "300095.SZ"
                    },
                    {
                        "name": "锐奇股份",
                        "scale": 1.37773294E+9,
                        "id": "300126.SZ"
                    },
                    {
                        "name": "中金环境",
                        "scale": 5055379795,
                        "id": "300145.SZ"
                    },
                    {
                        "name": "瑞凌股份",
                        "scale": 2040502305,
                        "id": "300154.SZ"
                    },
                    {
                        "name": "华中数控",
                        "scale": 3867474893,
                        "id": "300161.SZ"
                    },
                    {
                        "name": "四方达",
                        "scale": 7069674632,
                        "id": "300179.SZ"
                    },
                    {
                        "name": "佳士科技",
                        "scale": 3977011614,
                        "id": "300193.SZ"
                    },
                    {
                        "name": "科大智能",
                        "scale": 5411491295,
                        "id": "300222.SZ"
                    },
                    {
                        "name": "开山股份",
                        "scale": 15123141697,
                        "id": "300257.SZ"
                    },
                    {
                        "name": "新莱应材",
                        "scale": 11675637143,
                        "id": "300260.SZ"
                    },
                    {
                        "name": "华昌达",
                        "scale": 6760382904,
                        "id": "300278.SZ"
                    },
                    {
                        "name": "华民股份",
                        "scale": 4139351631,
                        "id": "300345.SZ"
                    },
                    {
                        "name": "康跃科技",
                        "scale": 3843187149,
                        "id": "300391.SZ"
                    },
                    {
                        "name": "劲拓股份",
                        "scale": 3700438138,
                        "id": "300400.SZ"
                    },
                    {
                        "name": "五洋停车",
                        "scale": 3374978391,
                        "id": "300420.SZ"
                    },
                    {
                        "name": "力星股份",
                        "scale": 2191901394,
                        "id": "300421.SZ"
                    },
                    {
                        "name": "诚益通",
                        "scale": 2737668392,
                        "id": "300430.SZ"
                    },
                    {
                        "name": "鲍斯股份",
                        "scale": 4615895347,
                        "id": "300441.SZ"
                    },
                    {
                        "name": "星徽股份",
                        "scale": 1934176744,
                        "id": "300464.SZ"
                    },
                    {
                        "name": "中密控股",
                        "scale": 7959349453,
                        "id": "300470.SZ"
                    },
                    {
                        "name": "恒锋工具",
                        "scale": 3581451523,
                        "id": "300488.SZ"
                    },
                    {
                        "name": "昊志机电",
                        "scale": 2951510551,
                        "id": "300503.SZ"
                    },
                    {
                        "name": "三超新材",
                        "scale": 2150797058,
                        "id": "300554.SZ"
                    },
                    {
                        "name": "金太阳",
                        "scale": 1905592063,
                        "id": "300606.SZ"
                    },
                    {
                        "name": "拓斯达",
                        "scale": 4324515187,
                        "id": "300607.SZ"
                    },
                    {
                        "name": "新劲刚",
                        "scale": 3693734955,
                        "id": "300629.SZ"
                    },
                    {
                        "name": "岱勒新材",
                        "scale": 3320759547,
                        "id": "300700.SZ"
                    },
                    {
                        "name": "长盛轴承",
                        "scale": 4167179145,
                        "id": "300718.SZ"
                    },
                    {
                        "name": "德恩精工",
                        "scale": 1537008826,
                        "id": "300780.SZ"
                    },
                    {
                        "name": "华辰装备",
                        "scale": 2005686972,
                        "id": "300809.SZ"
                    },
                    {
                        "name": "双飞股份",
                        "scale": 879582413,
                        "id": "300817.SZ"
                    },
                    {
                        "name": "耐普矿机",
                        "scale": 1334777959,
                        "id": "300818.SZ"
                    },
                    {
                        "name": "浙江力诺",
                        "scale": 8.6085656E+8,
                        "id": "300838.SZ"
                    },
                    {
                        "name": "申昊科技",
                        "scale": 2916513234,
                        "id": "300853.SZ"
                    },
                    {
                        "name": "美畅股份",
                        "scale": 16887415281,
                        "id": "300861.SZ"
                    },
                    {
                        "name": "春晖智控",
                        "scale": 1817640689,
                        "id": "300943.SZ"
                    },
                    {
                        "name": "博亚精工",
                        "scale": 1.55678531E+9,
                        "id": "300971.SZ"
                    },
                    {
                        "name": "金沃股份",
                        "scale": 904136913,
                        "id": "300984.SZ"
                    },
                    {
                        "name": "同飞股份",
                        "scale": 2.08026E+9,
                        "id": "300990.SZ"
                    },
                    {
                        "name": "泰福泵业",
                        "scale": 979914324,
                        "id": "300992.SZ"
                    },
                    {
                        "name": "东亚机械",
                        "scale": 1219291296,
                        "id": "301028.SZ"
                    },
                    {
                        "name": "怡合达",
                        "scale": 17455827305,
                        "id": "301029.SZ"
                    },
                    {
                        "name": "新柴股份",
                        "scale": 860267688,
                        "id": "301032.SZ"
                    },
                    {
                        "name": "森赫股份",
                        "scale": 592266403,
                        "id": "301056.SZ"
                    },
                    {
                        "name": "开勒股份",
                        "scale": 4.48186E+8,
                        "id": "301070.SZ"
                    },
                    {
                        "name": "海力风电",
                        "scale": 5.6141484E+9,
                        "id": "301155.SZ"
                    },
                    {
                        "name": "黄河旋风",
                        "scale": 14842854373,
                        "id": "600172.SH"
                    },
                    {
                        "name": "全柴动力",
                        "scale": 4749702132,
                        "id": "600218.SH"
                    },
                    {
                        "name": "青海华鼎",
                        "scale": 2.1371995E+9,
                        "id": "600243.SH"
                    },
                    {
                        "name": "华嵘控股",
                        "scale": 2.02446E+9,
                        "id": "600421.SH"
                    },
                    {
                        "name": "双良节能",
                        "scale": 2.881870036E+10,
                        "id": "600481.SH"
                    },
                    {
                        "name": "龙溪股份",
                        "scale": 3424174103,
                        "id": "600592.SH"
                    },
                    {
                        "name": "动力新科",
                        "scale": 2.55113521E+9,
                        "id": "600841.SH"
                    },
                    {
                        "name": "晋亿实业",
                        "scale": 4.6047231E+9,
                        "id": "601002.SH"
                    },
                    {
                        "name": "恒立液压",
                        "scale": 7.17948E+10,
                        "id": "601100.SH"
                    },
                    {
                        "name": "杭齿前进",
                        "scale": 3.640546E+9,
                        "id": "601177.SH"
                    },
                    {
                        "name": "陕鼓动力",
                        "scale": 21052446664,
                        "id": "601369.SH"
                    },
                    {
                        "name": "海天精工",
                        "scale": 1.197468E+10,
                        "id": "601882.SH"
                    },
                    {
                        "name": "宁波精达",
                        "scale": 4448880128,
                        "id": "603088.SH"
                    },
                    {
                        "name": "宏盛股份",
                        "scale": 2.839E+9,
                        "id": "603090.SH"
                    },
                    {
                        "name": "上海沪工",
                        "scale": 4.80792818E+9,
                        "id": "603131.SH"
                    },
                    {
                        "name": "海容冷链",
                        "scale": 7560996063,
                        "id": "603187.SH"
                    },
                    {
                        "name": "海鸥股份",
                        "scale": 1481873465,
                        "id": "603269.SH"
                    },
                    {
                        "name": "银都股份",
                        "scale": 8.89493244E+9,
                        "id": "603277.SH"
                    },
                    {
                        "name": "应流股份",
                        "scale": 12166846663,
                        "id": "603308.SH"
                    },
                    {
                        "name": "福鞍股份",
                        "scale": 7905926298,
                        "id": "603315.SH"
                    },
                    {
                        "name": "百达精工",
                        "scale": 2112065385,
                        "id": "603331.SH"
                    },
                    {
                        "name": "四方科技",
                        "scale": 4307421156,
                        "id": "603339.SH"
                    },
                    {
                        "name": "科沃斯",
                        "scale": 52927833506,
                        "id": "603486.SH"
                    },
                    {
                        "name": "君禾股份",
                        "scale": 4153053904,
                        "id": "603617.SH"
                    },
                    {
                        "name": "亿嘉和",
                        "scale": 13423240908,
                        "id": "603666.SH"
                    },
                    {
                        "name": "五洲新春",
                        "scale": 5770562682,
                        "id": "603667.SH"
                    },
                    {
                        "name": "纽威股份",
                        "scale": 6.61421746E+9,
                        "id": "603699.SH"
                    },
                    {
                        "name": "大元泵业",
                        "scale": 3.49628928E+9,
                        "id": "603757.SH"
                    },
                    {
                        "name": "国茂股份",
                        "scale": 13786335021,
                        "id": "603915.SH"
                    },
                    {
                        "name": "恒润股份",
                        "scale": 10331243104,
                        "id": "603985.SH"
                    },
                    {
                        "name": "联德股份",
                        "scale": 1.98288E+9,
                        "id": "605060.SH"
                    },
                    {
                        "name": "华丰股份",
                        "scale": 1.14249184E+9,
                        "id": "605100.SH"
                    },
                    {
                        "name": "绿田机械",
                        "scale": 1.15449754E+9,
                        "id": "605259.SH"
                    },
                    {
                        "name": "长龄液压",
                        "scale": 994068057,
                        "id": "605389.SH"
                    },
                    {
                        "name": "天准科技",
                        "scale": 9.06917258E+9,
                        "id": "688003.SH"
                    },
                    {
                        "name": "绿的谐波",
                        "scale": 15797487534,
                        "id": "688017.SH"
                    },
                    {
                        "name": "沃尔德",
                        "scale": 3.92E+9,
                        "id": "688028.SH"
                    },
                    {
                        "name": "步科股份",
                        "scale": 1386679112,
                        "id": "688160.SH"
                    },
                    {
                        "name": "埃夫特-U",
                        "scale": 3455871218,
                        "id": "688165.SH"
                    },
                    {
                        "name": "石头科技",
                        "scale": 26032189617,
                        "id": "688169.SH"
                    },
                    {
                        "name": "江苏北人",
                        "scale": 3101693887,
                        "id": "688218.SH"
                    },
                    {
                        "name": "科德数控",
                        "scale": 4.02985422E+9,
                        "id": "688305.SH"
                    },
                    {
                        "name": "铂力特",
                        "scale": 1.85884508E+10,
                        "id": "688333.SH"
                    },
                    {
                        "name": "德马科技",
                        "scale": 1259658747,
                        "id": "688360.SH"
                    },
                    {
                        "name": "兰剑智能",
                        "scale": 1516029217,
                        "id": "688557.SH"
                    },
                    {
                        "name": "国盛智科",
                        "scale": 1430704998,
                        "id": "688558.SH"
                    },
                    {
                        "name": "浙海德曼",
                        "scale": 9.605778E+8,
                        "id": "688577.SH"
                    },
                    {
                        "name": "纽威数控",
                        "scale": 1209238827,
                        "id": "688697.SH"
                    },
                    {
                        "name": "万通液压",
                        "scale": 175189215,
                        "id": "830839.BJ"
                    },
                    {
                        "name": "常辅股份",
                        "scale": 307055955,
                        "id": "871396.BJ"
                    }
                ],
                "name": "通用机械",
                "scale": 903598067537,
                "id": "640100"
            },
            {
                "children": [
                    {
                        "name": "中联重科",
                        "scale": 43543358215,
                        "id": "000157.SZ"
                    },
                    {
                        "name": "徐工机械",
                        "scale": 43721893593,
                        "id": "000425.SZ"
                    },
                    {
                        "name": "柳    工",
                        "scale": 6010655796,
                        "id": "000528.SZ"
                    },
                    {
                        "name": "创元科技",
                        "scale": 4344873198,
                        "id": "000551.SZ"
                    },
                    {
                        "name": "哈工智能",
                        "scale": 6206544972,
                        "id": "000584.SZ"
                    },
                    {
                        "name": "山推股份",
                        "scale": 5221423417,
                        "id": "000680.SZ"
                    },
                    {
                        "name": "京山轻机",
                        "scale": 12617012333,
                        "id": "000821.SZ"
                    },
                    {
                        "name": "石化机械",
                        "scale": 5979782427,
                        "id": "000852.SZ"
                    },
                    {
                        "name": "冀东装备",
                        "scale": 2.07478E+9,
                        "id": "000856.SZ"
                    },
                    {
                        "name": "运机集团",
                        "scale": 682798293,
                        "id": "001288.SZ"
                    },
                    {
                        "name": "精功科技",
                        "scale": 1.39369992E+10,
                        "id": "002006.SZ"
                    },
                    {
                        "name": "天奇股份",
                        "scale": 7980415948,
                        "id": "002009.SZ"
                    },
                    {
                        "name": "ST中捷",
                        "scale": 1327439602,
                        "id": "002021.SZ"
                    },
                    {
                        "name": "巨轮智能",
                        "scale": 7743210713,
                        "id": "002031.SZ"
                    },
                    {
                        "name": "软控股份",
                        "scale": 8218602251,
                        "id": "002073.SZ"
                    },
                    {
                        "name": "山河智能",
                        "scale": 7015119034,
                        "id": "002097.SZ"
                    },
                    {
                        "name": "威海广泰",
                        "scale": 4487881785,
                        "id": "002111.SZ"
                    },
                    {
                        "name": "融捷股份",
                        "scale": 32625827907,
                        "id": "002192.SZ"
                    },
                    {
                        "name": "大连重工",
                        "scale": 13596845025,
                        "id": "002204.SZ"
                    },
                    {
                        "name": "达 意 隆",
                        "scale": 1294915997,
                        "id": "002209.SZ"
                    },
                    {
                        "name": "神开股份",
                        "scale": 1857640163,
                        "id": "002278.SZ"
                    },
                    {
                        "name": "赛象科技",
                        "scale": 4549036013,
                        "id": "002337.SZ"
                    },
                    {
                        "name": "杰瑞股份",
                        "scale": 24648220566,
                        "id": "002353.SZ"
                    },
                    {
                        "name": "*ST海核",
                        "scale": 3185890955,
                        "id": "002366.SZ"
                    },
                    {
                        "name": "康力电梯",
                        "scale": 4646966852,
                        "id": "002367.SZ"
                    },
                    {
                        "name": "杭氧股份",
                        "scale": 3.873531668E+10,
                        "id": "002430.SZ"
                    },
                    {
                        "name": "润邦股份",
                        "scale": 5488554954,
                        "id": "002483.SZ"
                    },
                    {
                        "name": "山东墨龙",
                        "scale": 2247704325,
                        "id": "002490.SZ"
                    },
                    {
                        "name": "天桥起重",
                        "scale": 4720909487,
                        "id": "002523.SZ"
                    },
                    {
                        "name": "山东矿机",
                        "scale": 4.63118511E+9,
                        "id": "002526.SZ"
                    },
                    {
                        "name": "海源复材",
                        "scale": 6.1308E+9,
                        "id": "002529.SZ"
                    },
                    {
                        "name": "ST林重",
                        "scale": 1235389144,
                        "id": "002535.SZ"
                    },
                    {
                        "name": "天沃科技",
                        "scale": 4759255078,
                        "id": "002564.SZ"
                    },
                    {
                        "name": "豪迈科技",
                        "scale": 13302610078,
                        "id": "002595.SZ"
                    },
                    {
                        "name": "东方精工",
                        "scale": 5883275172,
                        "id": "002611.SZ"
                    },
                    {
                        "name": "北玻股份",
                        "scale": 3171599515,
                        "id": "002613.SZ"
                    },
                    {
                        "name": "华宏科技",
                        "scale": 1.110279712E+10,
                        "id": "002645.SZ"
                    },
                    {
                        "name": "利君股份",
                        "scale": 4819545847,
                        "id": "002651.SZ"
                    },
                    {
                        "name": "鞍重股份",
                        "scale": 6179599161,
                        "id": "002667.SZ"
                    },
                    {
                        "name": "远大智能",
                        "scale": 4422020756,
                        "id": "002689.SZ"
                    },
                    {
                        "name": "美亚光电",
                        "scale": 9679974426,
                        "id": "002690.SZ"
                    },
                    {
                        "name": "冀凯股份",
                        "scale": 1964489343,
                        "id": "002691.SZ"
                    },
                    {
                        "name": "博实股份",
                        "scale": 12351505719,
                        "id": "002698.SZ"
                    },
                    {
                        "name": "物产金轮",
                        "scale": 2630264451,
                        "id": "002722.SZ"
                    },
                    {
                        "name": "电光科技",
                        "scale": 3321886848,
                        "id": "002730.SZ"
                    },
                    {
                        "name": "南兴股份",
                        "scale": 3343655028,
                        "id": "002757.SZ"
                    },
                    {
                        "name": "快意电梯",
                        "scale": 2082562487,
                        "id": "002774.SZ"
                    },
                    {
                        "name": "中坚科技",
                        "scale": 3179966996,
                        "id": "002779.SZ"
                    },
                    {
                        "name": "银宝山新",
                        "scale": 3.39949056E+9,
                        "id": "002786.SZ"
                    },
                    {
                        "name": "世嘉科技",
                        "scale": 2172301287,
                        "id": "002796.SZ"
                    },
                    {
                        "name": "和科达",
                        "scale": 2059805819,
                        "id": "002816.SZ"
                    },
                    {
                        "name": "弘亚数控",
                        "scale": 4274183927,
                        "id": "002833.SZ"
                    },
                    {
                        "name": "英维克",
                        "scale": 1.078680962E+10,
                        "id": "002837.SZ"
                    },
                    {
                        "name": "弘宇股份",
                        "scale": 1521755472,
                        "id": "002890.SZ"
                    },
                    {
                        "name": "科瑞技术",
                        "scale": 8666891887,
                        "id": "002957.SZ"
                    },
                    {
                        "name": "青鸟消防",
                        "scale": 13109005582,
                        "id": "002960.SZ"
                    },
                    {
                        "name": "博杰股份",
                        "scale": 1724761094,
                        "id": "002975.SZ"
                    },
                    {
                        "name": "泰坦股份",
                        "scale": 7.619436E+8,
                        "id": "003036.SZ"
                    },
                    {
                        "name": "南风股份",
                        "scale": 3194834353,
                        "id": "300004.SZ"
                    },
                    {
                        "name": "海默科技",
                        "scale": 1750984081,
                        "id": "300084.SZ"
                    },
                    {
                        "name": "智云股份",
                        "scale": 2297861247,
                        "id": "300097.SZ"
                    },
                    {
                        "name": "精准信息",
                        "scale": 3785475683,
                        "id": "300099.SZ"
                    },
                    {
                        "name": "达刚控股",
                        "scale": 2.03311721E+9,
                        "id": "300103.SZ"
                    },
                    {
                        "name": "昌红科技",
                        "scale": 6599072472,
                        "id": "300151.SZ"
                    },
                    {
                        "name": "东富龙",
                        "scale": 12532074077,
                        "id": "300171.SZ"
                    },
                    {
                        "name": "福能东方",
                        "scale": 3831715511,
                        "id": "300173.SZ"
                    },
                    {
                        "name": "长荣股份",
                        "scale": 1927649426,
                        "id": "300195.SZ"
                    },
                    {
                        "name": "*ST海伦",
                        "scale": 2293584213,
                        "id": "300201.SZ"
                    },
                    {
                        "name": "森远股份",
                        "scale": 1.50871673E+9,
                        "id": "300210.SZ"
                    },
                    {
                        "name": "梅安森",
                        "scale": 2.12542516E+9,
                        "id": "300275.SZ"
                    },
                    {
                        "name": "三丰智能",
                        "scale": 4319333193,
                        "id": "300276.SZ"
                    },
                    {
                        "name": "金明精机",
                        "scale": 2407795027,
                        "id": "300281.SZ"
                    },
                    {
                        "name": "蓝英装备",
                        "scale": 3223863046,
                        "id": "300293.SZ"
                    },
                    {
                        "name": "慈星股份",
                        "scale": 5402355329,
                        "id": "300307.SZ"
                    },
                    {
                        "name": "斯莱克",
                        "scale": 13464191201,
                        "id": "300382.SZ"
                    },
                    {
                        "name": "雪浪环境",
                        "scale": 1947316756,
                        "id": "300385.SZ"
                    },
                    {
                        "name": "金盾股份",
                        "scale": 1505921613,
                        "id": "300411.SZ"
                    },
                    {
                        "name": "迦南科技",
                        "scale": 3524500469,
                        "id": "300412.SZ"
                    },
                    {
                        "name": "伊之密",
                        "scale": 10179726937,
                        "id": "300415.SZ"
                    },
                    {
                        "name": "普丽盛",
                        "scale": 4.84868215E+9,
                        "id": "300442.SZ"
                    },
                    {
                        "name": "先导智能",
                        "scale": 81447155351,
                        "id": "300450.SZ"
                    },
                    {
                        "name": "赢合科技",
                        "scale": 16271230985,
                        "id": "300457.SZ"
                    },
                    {
                        "name": "田中精机",
                        "scale": 1126590486,
                        "id": "300461.SZ"
                    },
                    {
                        "name": "厚普股份",
                        "scale": 5891628991,
                        "id": "300471.SZ"
                    },
                    {
                        "name": "新元科技",
                        "scale": 3468736453,
                        "id": "300472.SZ"
                    },
                    {
                        "name": "光力科技",
                        "scale": 5142399006,
                        "id": "300480.SZ"
                    },
                    {
                        "name": "首华燃气",
                        "scale": 3635401638,
                        "id": "300483.SZ"
                    },
                    {
                        "name": "东杰智能",
                        "scale": 3766627704,
                        "id": "300486.SZ"
                    },
                    {
                        "name": "高澜股份",
                        "scale": 3349877491,
                        "id": "300499.SZ"
                    },
                    {
                        "name": "新美星",
                        "scale": 953416373,
                        "id": "300509.SZ"
                    },
                    {
                        "name": "中亚股份",
                        "scale": 2712984543,
                        "id": "300512.SZ"
                    },
                    {
                        "name": "爱司凯",
                        "scale": 2030386676,
                        "id": "300521.SZ"
                    },
                    {
                        "name": "蜀道装备",
                        "scale": 2451371238,
                        "id": "300540.SZ"
                    },
                    {
                        "name": "优德精密",
                        "scale": 1584118925,
                        "id": "300549.SZ"
                    },
                    {
                        "name": "长川科技",
                        "scale": 27105740948,
                        "id": "300604.SZ"
                    },
                    {
                        "name": "金银河",
                        "scale": 5172252717,
                        "id": "300619.SZ"
                    },
                    {
                        "name": "沪宁股份",
                        "scale": 1787120987,
                        "id": "300669.SZ"
                    },
                    {
                        "name": "捷佳伟创",
                        "scale": 35085873894,
                        "id": "300724.SZ"
                    },
                    {
                        "name": "迈为股份",
                        "scale": 5.497529739E+10,
                        "id": "300751.SZ"
                    },
                    {
                        "name": "金马游乐",
                        "scale": 1335964504,
                        "id": "300756.SZ"
                    },
                    {
                        "name": "罗博特科",
                        "scale": 6.14744E+9,
                        "id": "300757.SZ"
                    },
                    {
                        "name": "帝尔激光",
                        "scale": 2.208891823E+10,
                        "id": "300776.SZ"
                    },
                    {
                        "name": "国林科技",
                        "scale": 2442217515,
                        "id": "300786.SZ"
                    },
                    {
                        "name": "力合科技",
                        "scale": 2.342864E+9,
                        "id": "300800.SZ"
                    },
                    {
                        "name": "矩子科技",
                        "scale": 3665450304,
                        "id": "300802.SZ"
                    },
                    {
                        "name": "易天股份",
                        "scale": 1296667181,
                        "id": "300812.SZ"
                    },
                    {
                        "name": "泰林生物",
                        "scale": 981850394,
                        "id": "300813.SZ"
                    },
                    {
                        "name": "建科机械",
                        "scale": 762345384,
                        "id": "300823.SZ"
                    },
                    {
                        "name": "浩洋股份",
                        "scale": 2.03188316E+9,
                        "id": "300833.SZ"
                    },
                    {
                        "name": "佰奥智能",
                        "scale": 1038481223,
                        "id": "300836.SZ"
                    },
                    {
                        "name": "浙矿股份",
                        "scale": 1.3808725E+9,
                        "id": "300837.SZ"
                    },
                    {
                        "name": "蓝盾光电",
                        "scale": 2443708167,
                        "id": "300862.SZ"
                    },
                    {
                        "name": "大宏立",
                        "scale": 609836205,
                        "id": "300865.SZ"
                    },
                    {
                        "name": "大叶股份",
                        "scale": 1.2089E+9,
                        "id": "300879.SZ"
                    },
                    {
                        "name": "国安达",
                        "scale": 2.46634983E+9,
                        "id": "300902.SZ"
                    },
                    {
                        "name": "通用电梯",
                        "scale": 8.7105462E+8,
                        "id": "300931.SZ"
                    },
                    {
                        "name": "德固特",
                        "scale": 1.071E+9,
                        "id": "300950.SZ"
                    },
                    {
                        "name": "华立科技",
                        "scale": 1471022183,
                        "id": "301011.SZ"
                    },
                    {
                        "name": "利和兴",
                        "scale": 2155363062,
                        "id": "301013.SZ"
                    },
                    {
                        "name": "申菱环境",
                        "scale": 3.996252E+9,
                        "id": "301018.SZ"
                    },
                    {
                        "name": "仕净科技",
                        "scale": 3410179089,
                        "id": "301030.SZ"
                    },
                    {
                        "name": "远信工业",
                        "scale": 4.466745E+8,
                        "id": "301053.SZ"
                    },
                    {
                        "name": "万事利",
                        "scale": 533978462,
                        "id": "301066.SZ"
                    },
                    {
                        "name": "邵阳液压",
                        "scale": 499836506,
                        "id": "301079.SZ"
                    },
                    {
                        "name": "严牌股份",
                        "scale": 642361639,
                        "id": "301081.SZ"
                    },
                    {
                        "name": "明月镜片",
                        "scale": 1674534453,
                        "id": "301101.SZ"
                    },
                    {
                        "name": "强瑞技术",
                        "scale": 546577603,
                        "id": "301128.SZ"
                    },
                    {
                        "name": "三一重工",
                        "scale": 142687205153,
                        "id": "600031.SH"
                    },
                    {
                        "name": "太原重工",
                        "scale": 7.1277949E+9,
                        "id": "600169.SH"
                    },
                    {
                        "name": "北方股份",
                        "scale": 3.2419E+9,
                        "id": "600262.SH"
                    },
                    {
                        "name": "标准股份",
                        "scale": 1882293334,
                        "id": "600302.SH"
                    },
                    {
                        "name": "振华重工",
                        "scale": 12457491229,
                        "id": "600320.SH"
                    },
                    {
                        "name": "汉马科技",
                        "scale": 4879402442,
                        "id": "600375.SH"
                    },
                    {
                        "name": "ST龙净",
                        "scale": 13534758614,
                        "id": "600388.SH"
                    },
                    {
                        "name": "国机通用",
                        "scale": 2164116155,
                        "id": "600444.SH"
                    },
                    {
                        "name": "科达制造",
                        "scale": 31319745079,
                        "id": "600499.SH"
                    },
                    {
                        "name": "航天晨光",
                        "scale": 5.22391664E+9,
                        "id": "600501.SH"
                    },
                    {
                        "name": "文一科技",
                        "scale": 2.2512903E+9,
                        "id": "600520.SH"
                    },
                    {
                        "name": "菲达环保",
                        "scale": 3.08736235E+9,
                        "id": "600526.SH"
                    },
                    {
                        "name": "卓郎智能",
                        "scale": 7316294161,
                        "id": "600545.SH"
                    },
                    {
                        "name": "金自天正",
                        "scale": 2770967745,
                        "id": "600560.SH"
                    },
                    {
                        "name": "克劳斯",
                        "scale": 3110153913,
                        "id": "600579.SH"
                    },
                    {
                        "name": "天地科技",
                        "scale": 20237699682,
                        "id": "600582.SH"
                    },
                    {
                        "name": "安徽合力",
                        "scale": 9000598552,
                        "id": "600761.SH"
                    },
                    {
                        "name": "厦工股份",
                        "scale": 5251319661,
                        "id": "600815.SH"
                    },
                    {
                        "name": "上海机电",
                        "scale": 11186214641,
                        "id": "600835.SH"
                    },
                    {
                        "name": "上工申贝",
                        "scale": 2712107379,
                        "id": "600843.SH"
                    },
                    {
                        "name": "广日股份",
                        "scale": 5993829858,
                        "id": "600894.SH"
                    },
                    {
                        "name": "建设机械",
                        "scale": 6.59246767E+9,
                        "id": "600984.SH"
                    },
                    {
                        "name": "一拖股份",
                        "scale": 6.3013851E+9,
                        "id": "601038.SH"
                    },
                    {
                        "name": "中国一重",
                        "scale": 21259127074,
                        "id": "601106.SH"
                    },
                    {
                        "name": "国机重装",
                        "scale": 10359479275,
                        "id": "601399.SH"
                    },
                    {
                        "name": "中信重工",
                        "scale": 17140706207,
                        "id": "601608.SH"
                    },
                    {
                        "name": "蓝科高新",
                        "scale": 2783046354,
                        "id": "601798.SH"
                    },
                    {
                        "name": "合锻智能",
                        "scale": 3797102876,
                        "id": "603011.SH"
                    },
                    {
                        "name": "创力集团",
                        "scale": 4.1949304E+9,
                        "id": "603012.SH"
                    },
                    {
                        "name": "天鹅股份",
                        "scale": 1.57623258E+9,
                        "id": "603029.SH"
                    },
                    {
                        "name": "如通股份",
                        "scale": 1.93280412E+9,
                        "id": "603036.SH"
                    },
                    {
                        "name": "乐惠国际",
                        "scale": 6411655393,
                        "id": "603076.SH"
                    },
                    {
                        "name": "越剑智能",
                        "scale": 827659787,
                        "id": "603095.SH"
                    },
                    {
                        "name": "上海亚虹",
                        "scale": 1.946E+9,
                        "id": "603159.SH"
                    },
                    {
                        "name": "兰石重装",
                        "scale": 9784125567,
                        "id": "603169.SH"
                    },
                    {
                        "name": "上机数控",
                        "scale": 60822465848,
                        "id": "603185.SH"
                    },
                    {
                        "name": "快克股份",
                        "scale": 6739718713,
                        "id": "603203.SH"
                    },
                    {
                        "name": "景津装备",
                        "scale": 19252788134,
                        "id": "603279.SH"
                    },
                    {
                        "name": "赛腾股份",
                        "scale": 5263099518,
                        "id": "603283.SH"
                    },
                    {
                        "name": "泰瑞机器",
                        "scale": 2933562048,
                        "id": "603289.SH"
                    },
                    {
                        "name": "杭叉集团",
                        "scale": 1.275336596E+10,
                        "id": "603298.SH"
                    },
                    {
                        "name": "水发燃气",
                        "scale": 3273576602,
                        "id": "603318.SH"
                    },
                    {
                        "name": "梅轮电梯",
                        "scale": 2.18891E+9,
                        "id": "603321.SH"
                    },
                    {
                        "name": "盛剑环境",
                        "scale": 1783591241,
                        "id": "603324.SH"
                    },
                    {
                        "name": "杰克股份",
                        "scale": 9457262775,
                        "id": "603337.SH"
                    },
                    {
                        "name": "浙江鼎力",
                        "scale": 22016005779,
                        "id": "603338.SH"
                    },
                    {
                        "name": "华菱精工",
                        "scale": 2.173442E+9,
                        "id": "603356.SH"
                    },
                    {
                        "name": "展鹏科技",
                        "scale": 2166569065,
                        "id": "603488.SH"
                    },
                    {
                        "name": "诺力股份",
                        "scale": 4691763929,
                        "id": "603611.SH"
                    },
                    {
                        "name": "艾迪精密",
                        "scale": 15158692989,
                        "id": "603638.SH"
                    },
                    {
                        "name": "泰禾智能",
                        "scale": 2267153664,
                        "id": "603656.SH"
                    },
                    {
                        "name": "福龙马",
                        "scale": 4534804091,
                        "id": "603686.SH"
                    },
                    {
                        "name": "至纯科技",
                        "scale": 13963742413,
                        "id": "603690.SH"
                    },
                    {
                        "name": "星光农机",
                        "scale": 2.2204E+9,
                        "id": "603789.SH"
                    },
                    {
                        "name": "道森股份",
                        "scale": 8.00176E+9,
                        "id": "603800.SH"
                    },
                    {
                        "name": "华荣股份",
                        "scale": 7.952535E+9,
                        "id": "603855.SH"
                    },
                    {
                        "name": "天永智能",
                        "scale": 2.8770896E+9,
                        "id": "603895.SH"
                    },
                    {
                        "name": "永创智能",
                        "scale": 6580824003,
                        "id": "603901.SH"
                    },
                    {
                        "name": "佳力图",
                        "scale": 3568838475,
                        "id": "603912.SH"
                    },
                    {
                        "name": "威派格",
                        "scale": 4519444947,
                        "id": "603956.SH"
                    },
                    {
                        "name": "克来机电",
                        "scale": 5890245064,
                        "id": "603960.SH"
                    },
                    {
                        "name": "法兰泰克",
                        "scale": 3546849269,
                        "id": "603966.SH"
                    },
                    {
                        "name": "健麾信息",
                        "scale": 2126220036,
                        "id": "605186.SH"
                    },
                    {
                        "name": "同力日升",
                        "scale": 2.15088E+9,
                        "id": "605286.SH"
                    },
                    {
                        "name": "中际联合",
                        "scale": 5.4235104E+9,
                        "id": "605305.SH"
                    },
                    {
                        "name": "华兴源创",
                        "scale": 14872707765,
                        "id": "688001.SH"
                    },
                    {
                        "name": "杭可科技",
                        "scale": 2.93026692E+10,
                        "id": "688006.SH"
                    },
                    {
                        "name": "中微公司",
                        "scale": 87931924851,
                        "id": "688012.SH"
                    },
                    {
                        "name": "瀚川智能",
                        "scale": 7651822545,
                        "id": "688022.SH"
                    },
                    {
                        "name": "芯源微",
                        "scale": 1.00963408E+10,
                        "id": "688037.SH"
                    },
                    {
                        "name": "金达莱",
                        "scale": 2401368377,
                        "id": "688057.SH"
                    },
                    {
                        "name": "华依科技",
                        "scale": 2761818611,
                        "id": "688071.SH"
                    },
                    {
                        "name": "瑞松科技",
                        "scale": 2054890669,
                        "id": "688090.SH"
                    },
                    {
                        "name": "爱科科技",
                        "scale": 777973063,
                        "id": "688092.SH"
                    },
                    {
                        "name": "博众精工",
                        "scale": 1807060325,
                        "id": "688097.SH"
                    },
                    {
                        "name": "联测科技",
                        "scale": 2.23530367E+9,
                        "id": "688113.SH"
                    },
                    {
                        "name": "卓然股份",
                        "scale": 915684254,
                        "id": "688121.SH"
                    },
                    {
                        "name": "中国电研",
                        "scale": 2.28586215E+9,
                        "id": "688128.SH"
                    },
                    {
                        "name": "先惠技术",
                        "scale": 3800510273,
                        "id": "688155.SH"
                    },
                    {
                        "name": "华峰测控",
                        "scale": 19258419465,
                        "id": "688200.SH"
                    },
                    {
                        "name": "中科微至",
                        "scale": 1.4974278E+9,
                        "id": "688211.SH"
                    },
                    {
                        "name": "瑞晟智能",
                        "scale": 519869784,
                        "id": "688215.SH"
                    },
                    {
                        "name": "凯尔达",
                        "scale": 856877651,
                        "id": "688255.SH"
                    },
                    {
                        "name": "*ST恒誉",
                        "scale": 739136498,
                        "id": "688309.SH"
                    },
                    {
                        "name": "迈得医疗",
                        "scale": 8.613891E+8,
                        "id": "688310.SH"
                    },
                    {
                        "name": "燕麦科技",
                        "scale": 1347989498,
                        "id": "688312.SH"
                    },
                    {
                        "name": "深科达",
                        "scale": 1719449951,
                        "id": "688328.SH"
                    },
                    {
                        "name": "艾隆科技",
                        "scale": 1.86174065E+9,
                        "id": "688329.SH"
                    },
                    {
                        "name": "迪威尔",
                        "scale": 3.75476472E+9,
                        "id": "688377.SH"
                    },
                    {
                        "name": "奥来德",
                        "scale": 2.65315011E+9,
                        "id": "688378.SH"
                    },
                    {
                        "name": "新益昌",
                        "scale": 4177777402,
                        "id": "688383.SH"
                    },
                    {
                        "name": "铁建重工",
                        "scale": 6005701992,
                        "id": "688425.SH"
                    },
                    {
                        "name": "利元亨",
                        "scale": 7259308428,
                        "id": "688499.SH"
                    },
                    {
                        "name": "青达环保",
                        "scale": 1165043584,
                        "id": "688501.SH"
                    },
                    {
                        "name": "联赢激光",
                        "scale": 9509028854,
                        "id": "688518.SH"
                    },
                    {
                        "name": "豪森股份",
                        "scale": 1210402479,
                        "id": "688529.SH"
                    },
                    {
                        "name": "科威尔",
                        "scale": 2477914401,
                        "id": "688551.SH"
                    },
                    {
                        "name": "高测股份",
                        "scale": 14202274169,
                        "id": "688556.SH"
                    },
                    {
                        "name": "海目星",
                        "scale": 11235982375,
                        "id": "688559.SH"
                    },
                    {
                        "name": "正帆科技",
                        "scale": 7032855857,
                        "id": "688596.SH"
                    },
                    {
                        "name": "皖仪科技",
                        "scale": 1.2202981E+9,
                        "id": "688600.SH"
                    },
                    {
                        "name": "芯碁微装",
                        "scale": 5.63605921E+9,
                        "id": "688630.SH"
                    },
                    {
                        "name": "星球石墨",
                        "scale": 1355663012,
                        "id": "688633.SH"
                    },
                    {
                        "name": "东威科技",
                        "scale": 12026201766,
                        "id": "688700.SH"
                    },
                    {
                        "name": "宏华数科",
                        "scale": 7640993144,
                        "id": "688789.SH"
                    },
                    {
                        "name": "浩淼科技",
                        "scale": 284923065,
                        "id": "831856.BJ"
                    },
                    {
                        "name": "三友科技",
                        "scale": 173982055,
                        "id": "834475.BJ"
                    },
                    {
                        "name": "同力股份",
                        "scale": 1506254124,
                        "id": "834599.BJ"
                    },
                    {
                        "name": "五新隧装",
                        "scale": 315357205,
                        "id": "835174.BJ"
                    },
                    {
                        "name": "凯腾精工",
                        "scale": 2.3369721E+8,
                        "id": "871553.BJ"
                    }
                ],
                "name": "专用设备",
                "scale": 1830883107188,
                "id": "640200"
            },
            {
                "children": [
                    {
                        "name": "航天科技",
                        "scale": 7519057245,
                        "id": "000901.SZ"
                    },
                    {
                        "name": "奥普光电",
                        "scale": 6.0358491E+9,
                        "id": "002338.SZ"
                    },
                    {
                        "name": "东方中科",
                        "scale": 3339679553,
                        "id": "002819.SZ"
                    },
                    {
                        "name": "威星智能",
                        "scale": 1334593888,
                        "id": "002849.SZ"
                    },
                    {
                        "name": "三晖电气",
                        "scale": 1.89696E+9,
                        "id": "002857.SZ"
                    },
                    {
                        "name": "华盛昌",
                        "scale": 8.833351E+8,
                        "id": "002980.SZ"
                    },
                    {
                        "name": "汉威科技",
                        "scale": 6759774103,
                        "id": "300007.SZ"
                    },
                    {
                        "name": "三川智慧",
                        "scale": 6231288737,
                        "id": "300066.SZ"
                    },
                    {
                        "name": "万讯自控",
                        "scale": 2630301704,
                        "id": "300112.SZ"
                    },
                    {
                        "name": "中航电测",
                        "scale": 7177740063,
                        "id": "300114.SZ"
                    },
                    {
                        "name": "天瑞仪器",
                        "scale": 1914002973,
                        "id": "300165.SZ"
                    },
                    {
                        "name": "新天科技",
                        "scale": 3083579479,
                        "id": "300259.SZ"
                    },
                    {
                        "name": "远方信息",
                        "scale": 1790468661,
                        "id": "300306.SZ"
                    },
                    {
                        "name": "麦克奥迪",
                        "scale": 4799839459,
                        "id": "300341.SZ"
                    },
                    {
                        "name": "金卡智能",
                        "scale": 3928563149,
                        "id": "300349.SZ"
                    },
                    {
                        "name": "东华测试",
                        "scale": 2970592956,
                        "id": "300354.SZ"
                    },
                    {
                        "name": "*ST安控",
                        "scale": 2221415646,
                        "id": "300370.SZ"
                    },
                    {
                        "name": "汇中股份",
                        "scale": 1408271678,
                        "id": "300371.SZ"
                    },
                    {
                        "name": "正业科技",
                        "scale": 4105703198,
                        "id": "300410.SZ"
                    },
                    {
                        "name": "苏试试验",
                        "scale": 10654949508,
                        "id": "300416.SZ"
                    },
                    {
                        "name": "南华仪器",
                        "scale": 902092158,
                        "id": "300417.SZ"
                    },
                    {
                        "name": "康斯特",
                        "scale": 1.64236645E+9,
                        "id": "300445.SZ"
                    },
                    {
                        "name": "三德科技",
                        "scale": 2008454927,
                        "id": "300515.SZ"
                    },
                    {
                        "name": "集智股份",
                        "scale": 1.48555494E+9,
                        "id": "300553.SZ"
                    },
                    {
                        "name": "理工光科",
                        "scale": 1814794404,
                        "id": "300557.SZ"
                    },
                    {
                        "name": "精测电子",
                        "scale": 9.69928118E+9,
                        "id": "300567.SZ"
                    },
                    {
                        "name": "安车检测",
                        "scale": 2774666018,
                        "id": "300572.SZ"
                    },
                    {
                        "name": "星云股份",
                        "scale": 4270538834,
                        "id": "300648.SZ"
                    },
                    {
                        "name": "必创科技",
                        "scale": 2714792608,
                        "id": "300667.SZ"
                    },
                    {
                        "name": "海川智能",
                        "scale": 1195792683,
                        "id": "300720.SZ"
                    },
                    {
                        "name": "山科智能",
                        "scale": 613574415,
                        "id": "300897.SZ"
                    },
                    {
                        "name": "迈拓股份",
                        "scale": 1275637682,
                        "id": "301006.SZ"
                    },
                    {
                        "name": "瑞纳智能",
                        "scale": 1.2227196E+9,
                        "id": "301129.SZ"
                    },
                    {
                        "name": "海兴电力",
                        "scale": 7848265682,
                        "id": "603556.SH"
                    },
                    {
                        "name": "柯力传感",
                        "scale": 5.17007787E+9,
                        "id": "603662.SH"
                    },
                    {
                        "name": "宁水集团",
                        "scale": 3.40227108E+9,
                        "id": "603700.SH"
                    },
                    {
                        "name": "咸亨国际",
                        "scale": 2512738386,
                        "id": "605056.SH"
                    },
                    {
                        "name": "莱伯泰科",
                        "scale": 1090627648,
                        "id": "688056.SH"
                    },
                    {
                        "name": "鼎阳科技",
                        "scale": 1804461267,
                        "id": "688112.SH"
                    },
                    {
                        "name": "秦川物联",
                        "scale": 5.7431262E+8,
                        "id": "688528.SH"
                    },
                    {
                        "name": "禾信仪器",
                        "scale": 5.8667E+8,
                        "id": "688622.SH"
                    },
                    {
                        "name": "优利德",
                        "scale": 1.343454E+9,
                        "id": "688628.SH"
                    },
                    {
                        "name": "四方光电",
                        "scale": 3.26644325E+9,
                        "id": "688665.SH"
                    },
                    {
                        "name": "奥普特",
                        "scale": 5733571395,
                        "id": "688686.SH"
                    },
                    {
                        "name": "容知日新",
                        "scale": 3.77497113E+9,
                        "id": "688768.SH"
                    },
                    {
                        "name": "海希通讯",
                        "scale": 3.3532668E+8,
                        "id": "831305.BJ"
                    },
                    {
                        "name": "创远信科",
                        "scale": 991397767,
                        "id": "831961.BJ"
                    },
                    {
                        "name": "中寰股份",
                        "scale": 221589177,
                        "id": "836260.BJ"
                    }
                ],
                "name": "仪器仪表",
                "scale": 150962410051,
                "id": "640300"
            },
            {
                "children": [
                    {
                        "name": "中集集团",
                        "scale": 21341715563,
                        "id": "000039.SZ"
                    },
                    {
                        "name": "恒星科技",
                        "scale": 9234630313,
                        "id": "002132.SZ"
                    },
                    {
                        "name": "通润装备",
                        "scale": 3125317606,
                        "id": "002150.SZ"
                    },
                    {
                        "name": "巨力索具",
                        "scale": 4009858125,
                        "id": "002342.SZ"
                    },
                    {
                        "name": "大金重工",
                        "scale": 26517626712,
                        "id": "002487.SZ"
                    },
                    {
                        "name": "泰嘉股份",
                        "scale": 3792539048,
                        "id": "002843.SZ"
                    },
                    {
                        "name": "祥鑫科技",
                        "scale": 5246737727,
                        "id": "002965.SZ"
                    },
                    {
                        "name": "华亚智能",
                        "scale": 2889153614,
                        "id": "003043.SZ"
                    },
                    {
                        "name": "富瑞特装",
                        "scale": 3740528285,
                        "id": "300228.SZ"
                    },
                    {
                        "name": "宝色股份",
                        "scale": 4.78134E+9,
                        "id": "300402.SZ"
                    },
                    {
                        "name": "海昌新材",
                        "scale": 1.0818885E+9,
                        "id": "300885.SZ"
                    },
                    {
                        "name": "恒而达",
                        "scale": 1.33749882E+9,
                        "id": "300946.SZ"
                    },
                    {
                        "name": "震裕科技",
                        "scale": 6.0976924E+9,
                        "id": "300953.SZ"
                    },
                    {
                        "name": "致远新能",
                        "scale": 1078738646,
                        "id": "300985.SZ"
                    },
                    {
                        "name": "津荣天宇",
                        "scale": 1339580462,
                        "id": "300988.SZ"
                    },
                    {
                        "name": "海锅股份",
                        "scale": 6.145308E+8,
                        "id": "301063.SZ"
                    },
                    {
                        "name": "丰光精密",
                        "scale": 767701812,
                        "id": "430510.BJ"
                    },
                    {
                        "name": "大西洋",
                        "scale": 3249329488,
                        "id": "600558.SH"
                    },
                    {
                        "name": "京城股份",
                        "scale": 5.83464E+9,
                        "id": "600860.SH"
                    },
                    {
                        "name": "贵绳股份",
                        "scale": 4.3969146E+9,
                        "id": "600992.SH"
                    },
                    {
                        "name": "玉龙股份",
                        "scale": 14822677637,
                        "id": "601028.SH"
                    },
                    {
                        "name": "赛福天",
                        "scale": 2.956512E+9,
                        "id": "603028.SH"
                    },
                    {
                        "name": "大业股份",
                        "scale": 2497841571,
                        "id": "603278.SH"
                    },
                    {
                        "name": "科森科技",
                        "scale": 4683184584,
                        "id": "603626.SH"
                    },
                    {
                        "name": "银龙股份",
                        "scale": 4.10408E+9,
                        "id": "603969.SH"
                    },
                    {
                        "name": "华锐精密",
                        "scale": 3124348161,
                        "id": "688059.SH"
                    },
                    {
                        "name": "新锐股份",
                        "scale": 878477109,
                        "id": "688257.SH"
                    },
                    {
                        "name": "欧科亿",
                        "scale": 3947871382,
                        "id": "688308.SH"
                    },
                    {
                        "name": "明志科技",
                        "scale": 820886549,
                        "id": "688355.SH"
                    },
                    {
                        "name": "华光新材",
                        "scale": 9.13308E+8,
                        "id": "688379.SH"
                    },
                    {
                        "name": "拾比佰",
                        "scale": 4.715277E+8,
                        "id": "831768.BJ"
                    },
                    {
                        "name": "美之高",
                        "scale": 1.2050182E+8,
                        "id": "834765.BJ"
                    },
                    {
                        "name": "吉冈精密",
                        "scale": 3.5892526E+8,
                        "id": "836720.BJ"
                    }
                ],
                "name": "金属制品",
                "scale": 150178104294,
                "id": "640400"
            },
            {
                "children": [
                    {
                        "name": "神州高铁",
                        "scale": 6573199419,
                        "id": "000008.SZ"
                    },
                    {
                        "name": "众合科技",
                        "scale": 4866156543,
                        "id": "000925.SZ"
                    },
                    {
                        "name": "华铁股份",
                        "scale": 8961764243,
                        "id": "000976.SZ"
                    },
                    {
                        "name": "科安达",
                        "scale": 1.04055557E+9,
                        "id": "002972.SZ"
                    },
                    {
                        "name": "永贵电器",
                        "scale": 4226150038,
                        "id": "300351.SZ"
                    },
                    {
                        "name": "朗进科技",
                        "scale": 1688162111,
                        "id": "300594.SZ"
                    },
                    {
                        "name": "交大思诺",
                        "scale": 824296789,
                        "id": "300851.SZ"
                    },
                    {
                        "name": "日月明",
                        "scale": 824338737,
                        "id": "300906.SZ"
                    },
                    {
                        "name": "研奥股份",
                        "scale": 7.433031E+8,
                        "id": "300923.SZ"
                    },
                    {
                        "name": "通业科技",
                        "scale": 5.16096E+8,
                        "id": "300960.SZ"
                    },
                    {
                        "name": "雷尔伟",
                        "scale": 6.255E+8,
                        "id": "301016.SZ"
                    },
                    {
                        "name": "金鹰重工",
                        "scale": 9.5200068E+8,
                        "id": "301048.SZ"
                    },
                    {
                        "name": "晋西车轴",
                        "scale": 5243548445,
                        "id": "600495.SH"
                    },
                    {
                        "name": "中铁工业",
                        "scale": 18461093696,
                        "id": "600528.SH"
                    },
                    {
                        "name": "XD中国中",
                        "scale": 121152434279,
                        "id": "601766.SH"
                    },
                    {
                        "name": "康尼机电",
                        "scale": 4021079433,
                        "id": "603111.SH"
                    },
                    {
                        "name": "祥和实业",
                        "scale": 3.51871396E+9,
                        "id": "603500.SH"
                    },
                    {
                        "name": "今创集团",
                        "scale": 6073820444,
                        "id": "603680.SH"
                    },
                    {
                        "name": "威奥股份",
                        "scale": 1615536002,
                        "id": "605001.SH"
                    },
                    {
                        "name": "必得科技",
                        "scale": 6.19905E+8,
                        "id": "605298.SH"
                    },
                    {
                        "name": "中国通号",
                        "scale": 8953666597,
                        "id": "688009.SH"
                    },
                    {
                        "name": "交控科技",
                        "scale": 4469855577,
                        "id": "688015.SH"
                    },
                    {
                        "name": "天宜上佳",
                        "scale": 12912982046,
                        "id": "688033.SH"
                    },
                    {
                        "name": "时代电气",
                        "scale": 10505002122,
                        "id": "688187.SH"
                    },
                    {
                        "name": "高铁电气",
                        "scale": 6.73756E+8,
                        "id": "688285.SH"
                    },
                    {
                        "name": "工大高科",
                        "scale": 1244966207,
                        "id": "688367.SH"
                    },
                    {
                        "name": "铁科轨道",
                        "scale": 2725943073,
                        "id": "688569.SH"
                    }
                ],
                "name": "运输设备",
                "scale": 234033826111,
                "id": "640500"
            }
        ],
        "name": "机械设备",
        "scale": 3269655515181,
        "id": "640000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "航天电器",
                        "scale": 34534932047,
                        "id": "002025.SZ"
                    },
                    {
                        "name": "北斗星通",
                        "scale": 1.363956795E+10,
                        "id": "002151.SZ"
                    },
                    {
                        "name": "星网宇达",
                        "scale": 3.48338988E+9,
                        "id": "002829.SZ"
                    },
                    {
                        "name": "天奥电子",
                        "scale": 6.22409829E+9,
                        "id": "002935.SZ"
                    },
                    {
                        "name": "天箭科技",
                        "scale": 2068027319,
                        "id": "002977.SZ"
                    },
                    {
                        "name": "中天火箭",
                        "scale": 2242421488,
                        "id": "003009.SZ"
                    },
                    {
                        "name": "钢研高纳",
                        "scale": 23193203853,
                        "id": "300034.SZ"
                    },
                    {
                        "name": "振芯科技",
                        "scale": 14179546799,
                        "id": "300101.SZ"
                    },
                    {
                        "name": "亚光科技",
                        "scale": 7091519015,
                        "id": "300123.SZ"
                    },
                    {
                        "name": "景嘉微",
                        "scale": 19686823324,
                        "id": "300474.SZ"
                    },
                    {
                        "name": "新余国科",
                        "scale": 5.9483424E+9,
                        "id": "300722.SZ"
                    },
                    {
                        "name": "中国卫星",
                        "scale": 25825562708,
                        "id": "600118.SH"
                    },
                    {
                        "name": "航天动力",
                        "scale": 7.24364205E+9,
                        "id": "600343.SH"
                    },
                    {
                        "name": "航天电子",
                        "scale": 18491044731,
                        "id": "600879.SH"
                    },
                    {
                        "name": "中国卫通",
                        "scale": 4.556E+10,
                        "id": "601698.SH"
                    },
                    {
                        "name": "鸿远电子",
                        "scale": 2.989649012E+10,
                        "id": "603267.SH"
                    },
                    {
                        "name": "火炬电子",
                        "scale": 24782722805,
                        "id": "603678.SH"
                    },
                    {
                        "name": "国光电气",
                        "scale": 3561599432,
                        "id": "688776.SH"
                    }
                ],
                "name": "航天装备",
                "scale": 287652934211,
                "id": "650100"
            },
            {
                "children": [
                    {
                        "name": "烽火电子",
                        "scale": 5774665692,
                        "id": "000561.SZ"
                    },
                    {
                        "name": "炼石航空",
                        "scale": 4557420991,
                        "id": "000697.SZ"
                    },
                    {
                        "name": "航发控制",
                        "scale": 37316763058,
                        "id": "000738.SZ"
                    },
                    {
                        "name": "中航西飞",
                        "scale": 86935302154,
                        "id": "000768.SZ"
                    },
                    {
                        "name": "中航机电",
                        "scale": 4.770517348E+10,
                        "id": "002013.SZ"
                    },
                    {
                        "name": "海特高新",
                        "scale": 7198919446,
                        "id": "002023.SZ"
                    },
                    {
                        "name": "中航光电",
                        "scale": 9.833087756E+10,
                        "id": "002179.SZ"
                    },
                    {
                        "name": "成飞集成",
                        "scale": 10048008897,
                        "id": "002190.SZ"
                    },
                    {
                        "name": "博云新材",
                        "scale": 5093896595,
                        "id": "002297.SZ"
                    },
                    {
                        "name": "航天彩虹",
                        "scale": 17523755043,
                        "id": "002389.SZ"
                    },
                    {
                        "name": "雷科防务",
                        "scale": 7054620115,
                        "id": "002413.SZ"
                    },
                    {
                        "name": "长鹰信质",
                        "scale": 6794576835,
                        "id": "002664.SZ"
                    },
                    {
                        "name": "新兴装备",
                        "scale": 1968860942,
                        "id": "002933.SZ"
                    },
                    {
                        "name": "北摩高科",
                        "scale": 8.95878218E+9,
                        "id": "002985.SZ"
                    },
                    {
                        "name": "ST新研",
                        "scale": 3.25287322E+9,
                        "id": "300159.SZ"
                    },
                    {
                        "name": "天和防务",
                        "scale": 4951417767,
                        "id": "300397.SZ"
                    },
                    {
                        "name": "航新科技",
                        "scale": 2604436183,
                        "id": "300424.SZ"
                    },
                    {
                        "name": "晨曦航空",
                        "scale": 7.07067216E+9,
                        "id": "300581.SZ"
                    },
                    {
                        "name": "爱乐达",
                        "scale": 6037068443,
                        "id": "300696.SZ"
                    },
                    {
                        "name": "安达维尔",
                        "scale": 2076135223,
                        "id": "300719.SZ"
                    },
                    {
                        "name": "三角防务",
                        "scale": 20651872846,
                        "id": "300775.SZ"
                    },
                    {
                        "name": "广联航空",
                        "scale": 3.6679965E+9,
                        "id": "300900.SZ"
                    },
                    {
                        "name": "恒宇信通",
                        "scale": 1.05335775E+9,
                        "id": "300965.SZ"
                    },
                    {
                        "name": "中直股份",
                        "scale": 3.051131482E+10,
                        "id": "600038.SH"
                    },
                    {
                        "name": "洪都航空",
                        "scale": 20703095961,
                        "id": "600316.SH"
                    },
                    {
                        "name": "中航电子",
                        "scale": 37137406744,
                        "id": "600372.SH"
                    },
                    {
                        "name": "航发科技",
                        "scale": 6691722269,
                        "id": "600391.SH"
                    },
                    {
                        "name": "中航沈飞",
                        "scale": 129494013866,
                        "id": "600760.SH"
                    },
                    {
                        "name": "中航重机",
                        "scale": 43505635315,
                        "id": "600765.SH"
                    },
                    {
                        "name": "中航高科",
                        "scale": 36692913478,
                        "id": "600862.SH"
                    },
                    {
                        "name": "航发动力",
                        "scale": 121215048956,
                        "id": "600893.SH"
                    },
                    {
                        "name": "派克新材",
                        "scale": 5.28902E+9,
                        "id": "605123.SH"
                    },
                    {
                        "name": "新光光电",
                        "scale": 1.52865652E+9,
                        "id": "688011.SH"
                    },
                    {
                        "name": "纵横股份",
                        "scale": 2.416068E+9,
                        "id": "688070.SH"
                    },
                    {
                        "name": "航宇科技",
                        "scale": 7492865201,
                        "id": "688239.SH"
                    },
                    {
                        "name": "航亚科技",
                        "scale": 3222496927,
                        "id": "688510.SH"
                    },
                    {
                        "name": "江航装备",
                        "scale": 4794807101,
                        "id": "688586.SH"
                    },
                    {
                        "name": "智明达",
                        "scale": 3705911257,
                        "id": "688636.SH"
                    },
                    {
                        "name": "迈信林",
                        "scale": 1538934969,
                        "id": "688685.SH"
                    },
                    {
                        "name": "星辰科技",
                        "scale": 608316702,
                        "id": "832885.BJ"
                    }
                ],
                "name": "航空装备",
                "scale": 853175681166,
                "id": "650200"
            },
            {
                "children": [
                    {
                        "name": "中兵红箭",
                        "scale": 49119588634,
                        "id": "000519.SZ"
                    },
                    {
                        "name": "航天发展",
                        "scale": 20171718891,
                        "id": "000547.SZ"
                    },
                    {
                        "name": "甘化科工",
                        "scale": 5987080382,
                        "id": "000576.SZ"
                    },
                    {
                        "name": "奥维通信",
                        "scale": 2833201143,
                        "id": "002231.SZ"
                    },
                    {
                        "name": "海格通信",
                        "scale": 21042395964,
                        "id": "002465.SZ"
                    },
                    {
                        "name": "中船应急",
                        "scale": 7320482815,
                        "id": "300527.SZ"
                    },
                    {
                        "name": "上海瀚讯",
                        "scale": 8.68603866E+9,
                        "id": "300762.SZ"
                    },
                    {
                        "name": "捷强装备",
                        "scale": 1745358206,
                        "id": "300875.SZ"
                    },
                    {
                        "name": "天秦装备",
                        "scale": 1618631205,
                        "id": "300922.SZ"
                    },
                    {
                        "name": "光电股份",
                        "scale": 7051425048,
                        "id": "600184.SH"
                    },
                    {
                        "name": "北方导航",
                        "scale": 1.41932196E+10,
                        "id": "600435.SH"
                    },
                    {
                        "name": "国睿科技",
                        "scale": 10637888787,
                        "id": "600562.SH"
                    },
                    {
                        "name": "中国海防",
                        "scale": 12738863506,
                        "id": "600764.SH"
                    },
                    {
                        "name": "内蒙一机",
                        "scale": 15477027444,
                        "id": "600967.SH"
                    },
                    {
                        "name": "四创电子",
                        "scale": 6762565309,
                        "id": "600990.SH"
                    },
                    {
                        "name": "长城军工",
                        "scale": 9501876608,
                        "id": "601606.SH"
                    },
                    {
                        "name": "兴图新科",
                        "scale": 7.5361998E+8,
                        "id": "688081.SH"
                    },
                    {
                        "name": "盟升电子",
                        "scale": 4743086417,
                        "id": "688311.SH"
                    },
                    {
                        "name": "天微电子",
                        "scale": 1.63169036E+9,
                        "id": "688511.SH"
                    },
                    {
                        "name": "霍莱沃",
                        "scale": 3015758404,
                        "id": "688682.SH"
                    },
                    {
                        "name": "科思科技",
                        "scale": 3.32699561E+9,
                        "id": "688788.SH"
                    }
                ],
                "name": "地面兵装",
                "scale": 208358512973,
                "id": "650300"
            },
            {
                "children": [
                    {
                        "name": "天海防务",
                        "scale": 6268524911,
                        "id": "300008.SZ"
                    },
                    {
                        "name": "海兰信",
                        "scale": 7091469258,
                        "id": "300065.SZ"
                    },
                    {
                        "name": "江龙船艇",
                        "scale": 3146297099,
                        "id": "300589.SZ"
                    },
                    {
                        "name": "国瑞科技",
                        "scale": 2234628288,
                        "id": "300600.SZ"
                    },
                    {
                        "name": "中科海讯",
                        "scale": 1568630929,
                        "id": "300810.SZ"
                    },
                    {
                        "name": "中船科技",
                        "scale": 9497623491,
                        "id": "600072.SH"
                    },
                    {
                        "name": "中国船舶",
                        "scale": 59861040218,
                        "id": "600150.SH"
                    },
                    {
                        "name": "中国动力",
                        "scale": 33087696703,
                        "id": "600482.SH"
                    },
                    {
                        "name": "中船防务",
                        "scale": 18038716575,
                        "id": "600685.SH"
                    },
                    {
                        "name": "亚星锚链",
                        "scale": 9.037548E+9,
                        "id": "601890.SH"
                    },
                    {
                        "name": "中国重工",
                        "scale": 83697614439,
                        "id": "601989.SH"
                    }
                ],
                "name": "船舶制造",
                "scale": 233529789911,
                "id": "650400"
            }
        ],
        "name": "国防军工",
        "scale": 1582716918261,
        "id": "650000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "中国长城",
                        "scale": 30752260736,
                        "id": "000066.SZ"
                    },
                    {
                        "name": "浪潮信息",
                        "scale": 36297883363,
                        "id": "000977.SZ"
                    },
                    {
                        "name": "新 大 陆",
                        "scale": 15436020511,
                        "id": "000997.SZ"
                    },
                    {
                        "name": "广电运通",
                        "scale": 22825420382,
                        "id": "002152.SZ"
                    },
                    {
                        "name": "*ST御银",
                        "scale": 2161783275,
                        "id": "002177.SZ"
                    },
                    {
                        "name": "纳思达",
                        "scale": 61242254572,
                        "id": "002180.SZ"
                    },
                    {
                        "name": "证通电子",
                        "scale": 5294551899,
                        "id": "002197.SZ"
                    },
                    {
                        "name": "卫 士 通",
                        "scale": 32036417014,
                        "id": "002268.SZ"
                    },
                    {
                        "name": "辉煌科技",
                        "scale": 2649457191,
                        "id": "002296.SZ"
                    },
                    {
                        "name": "威创股份",
                        "scale": 4.15981304E+9,
                        "id": "002308.SZ"
                    },
                    {
                        "name": "新北洋",
                        "scale": 4867185593,
                        "id": "002376.SZ"
                    },
                    {
                        "name": "合众思壮",
                        "scale": 4572724717,
                        "id": "002383.SZ"
                    },
                    {
                        "name": "达华智能",
                        "scale": 4858672496,
                        "id": "002512.SZ"
                    },
                    {
                        "name": "英飞拓",
                        "scale": 4091577471,
                        "id": "002528.SZ"
                    },
                    {
                        "name": "雷柏科技",
                        "scale": 3.5584417E+9,
                        "id": "002577.SZ"
                    },
                    {
                        "name": "同为股份",
                        "scale": 1444650303,
                        "id": "002835.SZ"
                    },
                    {
                        "name": "中新赛克",
                        "scale": 2849691192,
                        "id": "002912.SZ"
                    },
                    {
                        "name": "锐明技术",
                        "scale": 2513762828,
                        "id": "002970.SZ"
                    },
                    {
                        "name": "盛视科技",
                        "scale": 1992513693,
                        "id": "002990.SZ"
                    },
                    {
                        "name": "声迅股份",
                        "scale": 754955064,
                        "id": "003004.SZ"
                    },
                    {
                        "name": "朗科科技",
                        "scale": 2361021496,
                        "id": "300042.SZ"
                    },
                    {
                        "name": "华力创通",
                        "scale": 3690200637,
                        "id": "300045.SZ"
                    },
                    {
                        "name": "新国都",
                        "scale": 5406586552,
                        "id": "300130.SZ"
                    },
                    {
                        "name": "安居宝",
                        "scale": 1885755148,
                        "id": "300155.SZ"
                    },
                    {
                        "name": "中海达",
                        "scale": 5346605123,
                        "id": "300177.SZ"
                    },
                    {
                        "name": "中威电子",
                        "scale": 1361849239,
                        "id": "300270.SZ"
                    },
                    {
                        "name": "同有科技",
                        "scale": 3057244757,
                        "id": "300302.SZ"
                    },
                    {
                        "name": "兆日科技",
                        "scale": 2368501451,
                        "id": "300333.SZ"
                    },
                    {
                        "name": "汇金股份",
                        "scale": 3.82596436E+9,
                        "id": "300368.SZ"
                    },
                    {
                        "name": "飞天诚信",
                        "scale": 2859339676,
                        "id": "300386.SZ"
                    },
                    {
                        "name": "汉邦高科",
                        "scale": 1.65346006E+9,
                        "id": "300449.SZ"
                    },
                    {
                        "name": "康拓红外",
                        "scale": 5331144543,
                        "id": "300455.SZ"
                    },
                    {
                        "name": "华铭智能",
                        "scale": 1445278097,
                        "id": "300462.SZ"
                    },
                    {
                        "name": "神思电子",
                        "scale": 4498442948,
                        "id": "300479.SZ"
                    },
                    {
                        "name": "雄帝科技",
                        "scale": 2095000186,
                        "id": "300546.SZ"
                    },
                    {
                        "name": "古鳌科技",
                        "scale": 2788054876,
                        "id": "300551.SZ"
                    },
                    {
                        "name": "智莱科技",
                        "scale": 2955018873,
                        "id": "300771.SZ"
                    },
                    {
                        "name": "唐源电气",
                        "scale": 645202363,
                        "id": "300789.SZ"
                    },
                    {
                        "name": "天迈科技",
                        "scale": 7.8136805E+8,
                        "id": "300807.SZ"
                    },
                    {
                        "name": "捷安高科",
                        "scale": 1091321625,
                        "id": "300845.SZ"
                    },
                    {
                        "name": "狄耐克",
                        "scale": 1583245351,
                        "id": "300884.SZ"
                    },
                    {
                        "name": "创识科技",
                        "scale": 2000619293,
                        "id": "300941.SZ"
                    },
                    {
                        "name": "安联锐视",
                        "scale": 1.45747308E+9,
                        "id": "301042.SZ"
                    },
                    {
                        "name": "凯旺科技",
                        "scale": 6.107404E+8,
                        "id": "301182.SZ"
                    },
                    {
                        "name": "同方股份",
                        "scale": 13782130122,
                        "id": "600100.SH"
                    },
                    {
                        "name": "渤海化学",
                        "scale": 3360047037,
                        "id": "600800.SH"
                    },
                    {
                        "name": "航天长峰",
                        "scale": 3999851782,
                        "id": "600855.SH"
                    },
                    {
                        "name": "中科曙光",
                        "scale": 43333274453,
                        "id": "603019.SH"
                    },
                    {
                        "name": "恒银科技",
                        "scale": 2.7795768E+9,
                        "id": "603106.SH"
                    },
                    {
                        "name": "恒为科技",
                        "scale": 2840665227,
                        "id": "603496.SH"
                    },
                    {
                        "name": "淳中科技",
                        "scale": 3098160124,
                        "id": "603516.SH"
                    },
                    {
                        "name": "苏州科达",
                        "scale": 2816898641,
                        "id": "603660.SH"
                    },
                    {
                        "name": "冠石科技",
                        "scale": 794624898,
                        "id": "605588.SH"
                    },
                    {
                        "name": "云涌科技",
                        "scale": 1.34925E+9,
                        "id": "688060.SH"
                    },
                    {
                        "name": "道通科技",
                        "scale": 10403623234,
                        "id": "688208.SH"
                    },
                    {
                        "name": "鸿泉物联",
                        "scale": 1298662346,
                        "id": "688288.SH"
                    }
                ],
                "name": "计算机设备",
                "scale": 395316239888,
                "id": "710100"
            },
            {
                "children": [
                    {
                        "name": "ST国华",
                        "scale": 1126059628,
                        "id": "000004.SZ"
                    },
                    {
                        "name": "神州数码",
                        "scale": 10669905757,
                        "id": "000034.SZ"
                    },
                    {
                        "name": "常山北明",
                        "scale": 10282358267,
                        "id": "000158.SZ"
                    },
                    {
                        "name": "神州信息",
                        "scale": 11216255731,
                        "id": "000555.SZ"
                    },
                    {
                        "name": "*ST顺利",
                        "scale": 1.47097934E+9,
                        "id": "000606.SZ"
                    },
                    {
                        "name": "紫光股份",
                        "scale": 54198513612,
                        "id": "000938.SZ"
                    },
                    {
                        "name": "南天信息",
                        "scale": 4415475702,
                        "id": "000948.SZ"
                    },
                    {
                        "name": "远光软件",
                        "scale": 9.65038441E+9,
                        "id": "002063.SZ"
                    },
                    {
                        "name": "东华软件",
                        "scale": 18267356018,
                        "id": "002065.SZ"
                    },
                    {
                        "name": "*ST凯瑞",
                        "scale": 1512143698,
                        "id": "002072.SZ"
                    },
                    {
                        "name": "石基信息",
                        "scale": 17039482457,
                        "id": "002153.SZ"
                    },
                    {
                        "name": "二三四五",
                        "scale": 12565187336,
                        "id": "002195.SZ"
                    },
                    {
                        "name": "天融信",
                        "scale": 10937808535,
                        "id": "002212.SZ"
                    },
                    {
                        "name": "科大讯飞",
                        "scale": 86725079754,
                        "id": "002230.SZ"
                    },
                    {
                        "name": "启明信息",
                        "scale": 5793217092,
                        "id": "002232.SZ"
                    },
                    {
                        "name": "川大智胜",
                        "scale": 2726796742,
                        "id": "002253.SZ"
                    },
                    {
                        "name": "久其软件",
                        "scale": 3233827572,
                        "id": "002279.SZ"
                    },
                    {
                        "name": "联络互动",
                        "scale": 5807491652,
                        "id": "002280.SZ"
                    },
                    {
                        "name": "川发龙蟒",
                        "scale": 19304553687,
                        "id": "002312.SZ"
                    },
                    {
                        "name": "*ST亚联",
                        "scale": 1044552569,
                        "id": "002316.SZ"
                    },
                    {
                        "name": "皖通科技",
                        "scale": 3082141826,
                        "id": "002331.SZ"
                    },
                    {
                        "name": "汉王科技",
                        "scale": 3297037196,
                        "id": "002362.SZ"
                    },
                    {
                        "name": "太极股份",
                        "scale": 11426768146,
                        "id": "002368.SZ"
                    },
                    {
                        "name": "千方科技",
                        "scale": 14133393214,
                        "id": "002373.SZ"
                    },
                    {
                        "name": "科远智慧",
                        "scale": 1906064133,
                        "id": "002380.SZ"
                    },
                    {
                        "name": "中远海科",
                        "scale": 3586175685,
                        "id": "002401.SZ"
                    },
                    {
                        "name": "四维图新",
                        "scale": 31763651024,
                        "id": "002405.SZ"
                    },
                    {
                        "name": "广联达",
                        "scale": 49559539944,
                        "id": "002410.SZ"
                    },
                    {
                        "name": "*ST深南",
                        "scale": 1257114234,
                        "id": "002417.SZ"
                    },
                    {
                        "name": "达实智能",
                        "scale": 6587727826,
                        "id": "002421.SZ"
                    },
                    {
                        "name": "启明星辰",
                        "scale": 14198485706,
                        "id": "002439.SZ"
                    },
                    {
                        "name": "榕基软件",
                        "scale": 3190183967,
                        "id": "002474.SZ"
                    },
                    {
                        "name": "金财互联",
                        "scale": 5906257017,
                        "id": "002530.SZ"
                    },
                    {
                        "name": "海联金汇",
                        "scale": 1.056556953E+10,
                        "id": "002537.SZ"
                    },
                    {
                        "name": "捷顺科技",
                        "scale": 3522577393,
                        "id": "002609.SZ"
                    },
                    {
                        "name": "荣联科技",
                        "scale": 3768364284,
                        "id": "002642.SZ"
                    },
                    {
                        "name": "博彦科技",
                        "scale": 5.79313034E+9,
                        "id": "002649.SZ"
                    },
                    {
                        "name": "中科金财",
                        "scale": 5006934863,
                        "id": "002657.SZ"
                    },
                    {
                        "name": "索菱股份",
                        "scale": 4489816555,
                        "id": "002766.SZ"
                    },
                    {
                        "name": "真视通",
                        "scale": 2065270574,
                        "id": "002771.SZ"
                    },
                    {
                        "name": "久远银海",
                        "scale": 5871557158,
                        "id": "002777.SZ"
                    },
                    {
                        "name": "德赛西威",
                        "scale": 8.95980575E+10,
                        "id": "002920.SZ"
                    },
                    {
                        "name": "京北方",
                        "scale": 3.13742298E+9,
                        "id": "002987.SZ"
                    },
                    {
                        "name": "竞业达",
                        "scale": 9.545228E+8,
                        "id": "003005.SZ"
                    },
                    {
                        "name": "直真科技",
                        "scale": 789854658,
                        "id": "003007.SZ"
                    },
                    {
                        "name": "吉大正元",
                        "scale": 2296987094,
                        "id": "003029.SZ"
                    },
                    {
                        "name": "神州泰岳",
                        "scale": 7425842458,
                        "id": "300002.SZ"
                    },
                    {
                        "name": "豆神教育",
                        "scale": 2751676485,
                        "id": "300010.SZ"
                    },
                    {
                        "name": "银江技术",
                        "scale": 4891945211,
                        "id": "300020.SZ"
                    },
                    {
                        "name": "同花顺",
                        "scale": 23952591313,
                        "id": "300033.SZ"
                    },
                    {
                        "name": "超图软件",
                        "scale": 8010511353,
                        "id": "300036.SZ"
                    },
                    {
                        "name": "赛为智能",
                        "scale": 3700671239,
                        "id": "300044.SZ"
                    },
                    {
                        "name": "天源迪科",
                        "scale": 3863140442,
                        "id": "300047.SZ"
                    },
                    {
                        "name": "华平股份",
                        "scale": 2185988055,
                        "id": "300074.SZ"
                    },
                    {
                        "name": "数字政通",
                        "scale": 6841752177,
                        "id": "300075.SZ"
                    },
                    {
                        "name": "思创医惠",
                        "scale": 4140960026,
                        "id": "300078.SZ"
                    },
                    {
                        "name": "数码视讯",
                        "scale": 7246395568,
                        "id": "300079.SZ"
                    },
                    {
                        "name": "银之杰",
                        "scale": 5794238956,
                        "id": "300085.SZ"
                    },
                    {
                        "name": "易联众",
                        "scale": 2545258077,
                        "id": "300096.SZ"
                    },
                    {
                        "name": "世纪瑞尔",
                        "scale": 2184899907,
                        "id": "300150.SZ"
                    },
                    {
                        "name": "东方国信",
                        "scale": 8451213988,
                        "id": "300166.SZ"
                    },
                    {
                        "name": "迪威迅",
                        "scale": 1.7353872E+9,
                        "id": "300167.SZ"
                    },
                    {
                        "name": "万达信息",
                        "scale": 11454257577,
                        "id": "300168.SZ"
                    },
                    {
                        "name": "汉得信息",
                        "scale": 7512269064,
                        "id": "300170.SZ"
                    },
                    {
                        "name": "美亚柏科",
                        "scale": 9769574328,
                        "id": "300188.SZ"
                    },
                    {
                        "name": "天泽信息",
                        "scale": 2590314581,
                        "id": "300209.SZ"
                    },
                    {
                        "name": "易华录",
                        "scale": 11207348393,
                        "id": "300212.SZ"
                    },
                    {
                        "name": "拓尔思",
                        "scale": 10365179937,
                        "id": "300229.SZ"
                    },
                    {
                        "name": "银信科技",
                        "scale": 2838430331,
                        "id": "300231.SZ"
                    },
                    {
                        "name": "方直科技",
                        "scale": 1286582672,
                        "id": "300235.SZ"
                    },
                    {
                        "name": "天玑科技",
                        "scale": 2587244527,
                        "id": "300245.SZ"
                    },
                    {
                        "name": "新开普",
                        "scale": 3796697557,
                        "id": "300248.SZ"
                    },
                    {
                        "name": "初灵信息",
                        "scale": 2246666886,
                        "id": "300250.SZ"
                    },
                    {
                        "name": "卫宁健康",
                        "scale": 14918094015,
                        "id": "300253.SZ"
                    },
                    {
                        "name": "佳创视讯",
                        "scale": 2252363198,
                        "id": "300264.SZ"
                    },
                    {
                        "name": "华宇软件",
                        "scale": 5067796379,
                        "id": "300271.SZ"
                    },
                    {
                        "name": "海联讯",
                        "scale": 2448063285,
                        "id": "300277.SZ"
                    },
                    {
                        "name": "飞利信",
                        "scale": 5308237428,
                        "id": "300287.SZ"
                    },
                    {
                        "name": "朗玛信息",
                        "scale": 2580038472,
                        "id": "300288.SZ"
                    },
                    {
                        "name": "荣科科技",
                        "scale": 2790862372,
                        "id": "300290.SZ"
                    },
                    {
                        "name": "*ST蓝盾",
                        "scale": 2832458809,
                        "id": "300297.SZ"
                    },
                    {
                        "name": "海峡创新",
                        "scale": 3.02086557E+9,
                        "id": "300300.SZ"
                    },
                    {
                        "name": "任子行",
                        "scale": 3718723038,
                        "id": "300311.SZ"
                    },
                    {
                        "name": "旋极信息",
                        "scale": 6569973713,
                        "id": "300324.SZ"
                    },
                    {
                        "name": "*ST计通",
                        "scale": 994291108,
                        "id": "300330.SZ"
                    },
                    {
                        "name": "润和软件",
                        "scale": 15676133077,
                        "id": "300339.SZ"
                    },
                    {
                        "name": "立方数科",
                        "scale": 2.75480607E+9,
                        "id": "300344.SZ"
                    },
                    {
                        "name": "长亮科技",
                        "scale": 7136203266,
                        "id": "300348.SZ"
                    },
                    {
                        "name": "北信源",
                        "scale": 5843660953,
                        "id": "300352.SZ"
                    },
                    {
                        "name": "恒华科技",
                        "scale": 3043070406,
                        "id": "300365.SZ"
                    },
                    {
                        "name": "创意信息",
                        "scale": 4.45600378E+9,
                        "id": "300366.SZ"
                    },
                    {
                        "name": "绿盟科技",
                        "scale": 7970101339,
                        "id": "300369.SZ"
                    },
                    {
                        "name": "赢时胜",
                        "scale": 5745603989,
                        "id": "300377.SZ"
                    },
                    {
                        "name": "鼎捷软件",
                        "scale": 5370677081,
                        "id": "300378.SZ"
                    },
                    {
                        "name": "东方通",
                        "scale": 8422236304,
                        "id": "300379.SZ"
                    },
                    {
                        "name": "安硕信息",
                        "scale": 1881597418,
                        "id": "300380.SZ"
                    },
                    {
                        "name": "天利科技",
                        "scale": 2293037879,
                        "id": "300399.SZ"
                    },
                    {
                        "name": "浩丰科技",
                        "scale": 2144004479,
                        "id": "300419.SZ"
                    },
                    {
                        "name": "运达科技",
                        "scale": 3347146898,
                        "id": "300440.SZ"
                    },
                    {
                        "name": "浩云科技",
                        "scale": 2710281577,
                        "id": "300448.SZ"
                    },
                    {
                        "name": "创业慧康",
                        "scale": 10126952684,
                        "id": "300451.SZ"
                    },
                    {
                        "name": "深信服",
                        "scale": 28073979281,
                        "id": "300454.SZ"
                    },
                    {
                        "name": "高伟达",
                        "scale": 4034263181,
                        "id": "300465.SZ"
                    },
                    {
                        "name": "四方精创",
                        "scale": 5629007396,
                        "id": "300468.SZ"
                    },
                    {
                        "name": "信息发展",
                        "scale": 2541699284,
                        "id": "300469.SZ"
                    },
                    {
                        "name": "中科创达",
                        "scale": 4.442128223E+10,
                        "id": "300496.SZ"
                    },
                    {
                        "name": "维宏股份",
                        "scale": 1586750154,
                        "id": "300508.SZ"
                    },
                    {
                        "name": "科大国创",
                        "scale": 4574323952,
                        "id": "300520.SZ"
                    },
                    {
                        "name": "辰安科技",
                        "scale": 5.4632458E+9,
                        "id": "300523.SZ"
                    },
                    {
                        "name": "博思软件",
                        "scale": 7693577188,
                        "id": "300525.SZ"
                    },
                    {
                        "name": "今天国际",
                        "scale": 3124577055,
                        "id": "300532.SZ"
                    },
                    {
                        "name": "先进数通",
                        "scale": 3173912651,
                        "id": "300541.SZ"
                    },
                    {
                        "name": "新晨科技",
                        "scale": 3303652649,
                        "id": "300542.SZ"
                    },
                    {
                        "name": "和仁科技",
                        "scale": 3344534438,
                        "id": "300550.SZ"
                    },
                    {
                        "name": "万集科技",
                        "scale": 3640944503,
                        "id": "300552.SZ"
                    },
                    {
                        "name": "丝路视觉",
                        "scale": 2008450038,
                        "id": "300556.SZ"
                    },
                    {
                        "name": "佳发教育",
                        "scale": 2762943717,
                        "id": "300559.SZ"
                    },
                    {
                        "name": "汇金科技",
                        "scale": 1884071191,
                        "id": "300561.SZ"
                    },
                    {
                        "name": "数字认证",
                        "scale": 6622715971,
                        "id": "300579.SZ"
                    },
                    {
                        "name": "熙菱信息",
                        "scale": 1550731901,
                        "id": "300588.SZ"
                    },
                    {
                        "name": "诚迈科技",
                        "scale": 7452922801,
                        "id": "300598.SZ"
                    },
                    {
                        "name": "恒锋信息",
                        "scale": 1491657789,
                        "id": "300605.SZ"
                    },
                    {
                        "name": "思特奇",
                        "scale": 1826473164,
                        "id": "300608.SZ"
                    },
                    {
                        "name": "汇纳科技",
                        "scale": 1413614786,
                        "id": "300609.SZ"
                    },
                    {
                        "name": "万兴科技",
                        "scale": 3695704201,
                        "id": "300624.SZ"
                    },
                    {
                        "name": "彩讯股份",
                        "scale": 5536905363,
                        "id": "300634.SZ"
                    },
                    {
                        "name": "正元智慧",
                        "scale": 3027790946,
                        "id": "300645.SZ"
                    },
                    {
                        "name": "中孚信息",
                        "scale": 3317669561,
                        "id": "300659.SZ"
                    },
                    {
                        "name": "科蓝软件",
                        "scale": 6435635129,
                        "id": "300663.SZ"
                    },
                    {
                        "name": "宇信科技",
                        "scale": 1.171626895E+10,
                        "id": "300674.SZ"
                    },
                    {
                        "name": "中科信息",
                        "scale": 2148859091,
                        "id": "300678.SZ"
                    },
                    {
                        "name": "朗新科技",
                        "scale": 32386592388,
                        "id": "300682.SZ"
                    },
                    {
                        "name": "赛意信息",
                        "scale": 7785268938,
                        "id": "300687.SZ"
                    },
                    {
                        "name": "科创信息",
                        "scale": 1829996933,
                        "id": "300730.SZ"
                    },
                    {
                        "name": "奥飞数据",
                        "scale": 7232369296,
                        "id": "300738.SZ"
                    },
                    {
                        "name": "每日互动",
                        "scale": 4201020599,
                        "id": "300766.SZ"
                    },
                    {
                        "name": "迪普科技",
                        "scale": 5666145341,
                        "id": "300768.SZ"
                    },
                    {
                        "name": "拉卡拉",
                        "scale": 13790941152,
                        "id": "300773.SZ"
                    },
                    {
                        "name": "左江科技",
                        "scale": 2712158325,
                        "id": "300799.SZ"
                    },
                    {
                        "name": "指南针",
                        "scale": 12800166281,
                        "id": "300803.SZ"
                    },
                    {
                        "name": "金现代",
                        "scale": 1685599896,
                        "id": "300830.SZ"
                    },
                    {
                        "name": "首都在线",
                        "scale": 3357486854,
                        "id": "300846.SZ"
                    },
                    {
                        "name": "天阳科技",
                        "scale": 3664685067,
                        "id": "300872.SZ"
                    },
                    {
                        "name": "铜牛信息",
                        "scale": 1829097578,
                        "id": "300895.SZ"
                    },
                    {
                        "name": "法本信息",
                        "scale": 2432403554,
                        "id": "300925.SZ"
                    },
                    {
                        "name": "盈建科",
                        "scale": 1221324698,
                        "id": "300935.SZ"
                    },
                    {
                        "name": "普联软件",
                        "scale": 2.81216296E+9,
                        "id": "300996.SZ"
                    },
                    {
                        "name": "亚康股份",
                        "scale": 6.526E+8,
                        "id": "301085.SZ"
                    },
                    {
                        "name": "同辉信息",
                        "scale": 425176037,
                        "id": "430090.BJ"
                    },
                    {
                        "name": "航天信息",
                        "scale": 20289086786,
                        "id": "600271.SH"
                    },
                    {
                        "name": "华胜天成",
                        "scale": 6427648791,
                        "id": "600410.SH"
                    },
                    {
                        "name": "金证股份",
                        "scale": 9553524887,
                        "id": "600446.SH"
                    },
                    {
                        "name": "湘邮科技",
                        "scale": 2.3371257E+9,
                        "id": "600476.SH"
                    },
                    {
                        "name": "中国软件",
                        "scale": 2.648878262E+10,
                        "id": "600536.SH"
                    },
                    {
                        "name": "恒生电子",
                        "scale": 63314799994,
                        "id": "600570.SH"
                    },
                    {
                        "name": "信雅达",
                        "scale": 3926092831,
                        "id": "600571.SH"
                    },
                    {
                        "name": "用友网络",
                        "scale": 73558201226,
                        "id": "600588.SH"
                    },
                    {
                        "name": "云赛智联",
                        "scale": 7777953648,
                        "id": "600602.SH"
                    },
                    {
                        "name": "*ST中安",
                        "scale": 2227377304,
                        "id": "600654.SH"
                    },
                    {
                        "name": "东软集团",
                        "scale": 13895684137,
                        "id": "600718.SH"
                    },
                    {
                        "name": "佳都科技",
                        "scale": 12505968122,
                        "id": "600728.SH"
                    },
                    {
                        "name": "浪潮软件",
                        "scale": 4349405265,
                        "id": "600756.SH"
                    },
                    {
                        "name": "浙大网新",
                        "scale": 6966633752,
                        "id": "600797.SH"
                    },
                    {
                        "name": "宝信软件",
                        "scale": 57381256905,
                        "id": "600845.SH"
                    },
                    {
                        "name": "电科数字",
                        "scale": 11542084237,
                        "id": "600850.SH"
                    },
                    {
                        "name": "三六零",
                        "scale": 55448018409,
                        "id": "601360.SH"
                    },
                    {
                        "name": "大智慧",
                        "scale": 12804701184,
                        "id": "601519.SH"
                    },
                    {
                        "name": "ST泛微",
                        "scale": 9512012165,
                        "id": "603039.SH"
                    },
                    {
                        "name": "海量数据",
                        "scale": 4835564819,
                        "id": "603138.SH"
                    },
                    {
                        "name": "税友股份",
                        "scale": 2.66777108E+9,
                        "id": "603171.SH"
                    },
                    {
                        "name": "网达软件",
                        "scale": 3762894952,
                        "id": "603189.SH"
                    },
                    {
                        "name": "格尔软件",
                        "scale": 2690292803,
                        "id": "603232.SH"
                    },
                    {
                        "name": "顶点软件",
                        "scale": 5097990635,
                        "id": "603383.SH"
                    },
                    {
                        "name": "思维列控",
                        "scale": 5234897196,
                        "id": "603508.SH"
                    },
                    {
                        "name": "多伦科技",
                        "scale": 4905538524,
                        "id": "603528.SH"
                    },
                    {
                        "name": "南威软件",
                        "scale": 9263643303,
                        "id": "603636.SH"
                    },
                    {
                        "name": "新智认知",
                        "scale": 4505189536,
                        "id": "603869.SH"
                    },
                    {
                        "name": "数据港",
                        "scale": 8746174168,
                        "id": "603881.SH"
                    },
                    {
                        "name": "金桥信息",
                        "scale": 2824354777,
                        "id": "603918.SH"
                    },
                    {
                        "name": "中科软",
                        "scale": 1.091070641E+10,
                        "id": "603927.SH"
                    },
                    {
                        "name": "麦迪科技",
                        "scale": 6213350949,
                        "id": "603990.SH"
                    },
                    {
                        "name": "DR新炬网",
                        "scale": 695013641,
                        "id": "605398.SH"
                    },
                    {
                        "name": "博汇科技",
                        "scale": 1068199409,
                        "id": "688004.SH"
                    },
                    {
                        "name": "安恒信息",
                        "scale": 9079784225,
                        "id": "688023.SH"
                    },
                    {
                        "name": "山石网科",
                        "scale": 2.2687546E+9,
                        "id": "688030.SH"
                    },
                    {
                        "name": "中科通达",
                        "scale": 1145790688,
                        "id": "688038.SH"
                    },
                    {
                        "name": "当虹科技",
                        "scale": 2230900459,
                        "id": "688039.SH"
                    },
                    {
                        "name": "佳华科技",
                        "scale": 685079208,
                        "id": "688051.SH"
                    },
                    {
                        "name": "宝兰德",
                        "scale": 1760683652,
                        "id": "688058.SH"
                    },
                    {
                        "name": "航天宏图",
                        "scale": 1.508631253E+10,
                        "id": "688066.SH"
                    },
                    {
                        "name": "龙软科技",
                        "scale": 1732304426,
                        "id": "688078.SH"
                    },
                    {
                        "name": "中望软件",
                        "scale": 9896505798,
                        "id": "688083.SH"
                    },
                    {
                        "name": "虹软科技",
                        "scale": 8.70045085E+9,
                        "id": "688088.SH"
                    },
                    {
                        "name": "福昕软件",
                        "scale": 3106912765,
                        "id": "688095.SH"
                    },
                    {
                        "name": "品茗股份",
                        "scale": 884234872,
                        "id": "688109.SH"
                    },
                    {
                        "name": "金山办公",
                        "scale": 41047469605,
                        "id": "688111.SH"
                    },
                    {
                        "name": "普元信息",
                        "scale": 1373252663,
                        "id": "688118.SH"
                    },
                    {
                        "name": "优刻得-W",
                        "scale": 4980791199,
                        "id": "688158.SH"
                    },
                    {
                        "name": "安博通",
                        "scale": 1.53828864E+9,
                        "id": "688168.SH"
                    },
                    {
                        "name": "纬德信息",
                        "scale": 498201599,
                        "id": "688171.SH"
                    },
                    {
                        "name": "柏楚电子",
                        "scale": 32572920228,
                        "id": "688188.SH"
                    },
                    {
                        "name": "信安世纪",
                        "scale": 2300281728,
                        "id": "688201.SH"
                    },
                    {
                        "name": "亚信安全",
                        "scale": 749075222,
                        "id": "688225.SH"
                    },
                    {
                        "name": "品高股份",
                        "scale": 571499616,
                        "id": "688227.SH"
                    },
                    {
                        "name": "开普云",
                        "scale": 1.01611591E+9,
                        "id": "688228.SH"
                    },
                    {
                        "name": "博睿数据",
                        "scale": 827285459,
                        "id": "688229.SH"
                    },
                    {
                        "name": "新点软件",
                        "scale": 3201721386,
                        "id": "688232.SH"
                    },
                    {
                        "name": "嘉和美康",
                        "scale": 935480545,
                        "id": "688246.SH"
                    },
                    {
                        "name": "卓易信息",
                        "scale": 1875035569,
                        "id": "688258.SH"
                    },
                    {
                        "name": "和达科技",
                        "scale": 1483225783,
                        "id": "688296.SH"
                    },
                    {
                        "name": "青云科技-U",
                        "scale": 1242388031,
                        "id": "688316.SH"
                    },
                    {
                        "name": "财富趋势",
                        "scale": 2817409248,
                        "id": "688318.SH"
                    },
                    {
                        "name": "光云科技",
                        "scale": 1663019028,
                        "id": "688365.SH"
                    },
                    {
                        "name": "致远互联",
                        "scale": 3.50562499E+9,
                        "id": "688369.SH"
                    },
                    {
                        "name": "慧辰股份",
                        "scale": 988349852,
                        "id": "688500.SH"
                    },
                    {
                        "name": "正元地信",
                        "scale": 1.95671944E+9,
                        "id": "688509.SH"
                    },
                    {
                        "name": "泽达易盛",
                        "scale": 5.941564E+8,
                        "id": "688555.SH"
                    },
                    {
                        "name": "奇安信-U",
                        "scale": 25125378916,
                        "id": "688561.SH"
                    },
                    {
                        "name": "中科星图",
                        "scale": 7495713457,
                        "id": "688568.SH"
                    },
                    {
                        "name": "山大地纬",
                        "scale": 2709642312,
                        "id": "688579.SH"
                    },
                    {
                        "name": "凌志软件",
                        "scale": 3082361296,
                        "id": "688588.SH"
                    },
                    {
                        "name": "新致软件",
                        "scale": 1893506495,
                        "id": "688590.SH"
                    },
                    {
                        "name": "罗普特",
                        "scale": 1246673992,
                        "id": "688619.SH"
                    },
                    {
                        "name": "海天瑞声",
                        "scale": 6.9913074E+8,
                        "id": "688787.SH"
                    },
                    {
                        "name": "艾融软件",
                        "scale": 755075794,
                        "id": "830799.BJ"
                    },
                    {
                        "name": "科达自控",
                        "scale": 533299949,
                        "id": "831832.BJ"
                    },
                    {
                        "name": "志晟信息",
                        "scale": 195352824,
                        "id": "832171.BJ"
                    },
                    {
                        "name": "恒拓开源",
                        "scale": 321120624,
                        "id": "834415.BJ"
                    },
                    {
                        "name": "数字人",
                        "scale": 627645584,
                        "id": "835670.BJ"
                    },
                    {
                        "name": "广道高新",
                        "scale": 373762231,
                        "id": "839680.BJ"
                    }
                ],
                "name": "计算机应用",
                "scale": 1851628348952,
                "id": "710200"
            }
        ],
        "name": "计算机",
        "scale": 2.24694458884E+12,
        "id": "710000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "华数传媒",
                        "scale": 11534456168,
                        "id": "000156.SZ"
                    },
                    {
                        "name": "广弘控股",
                        "scale": 3607368106,
                        "id": "000529.SZ"
                    },
                    {
                        "name": "湖北广电",
                        "scale": 8164621346,
                        "id": "000665.SZ"
                    },
                    {
                        "name": "中原传媒",
                        "scale": 4716733129,
                        "id": "000719.SZ"
                    },
                    {
                        "name": "华闻集团",
                        "scale": 4706420676,
                        "id": "000793.SZ"
                    },
                    {
                        "name": "北京文化",
                        "scale": 3027751782,
                        "id": "000802.SZ"
                    },
                    {
                        "name": "欢瑞世纪",
                        "scale": 1814930542,
                        "id": "000892.SZ"
                    },
                    {
                        "name": "电广传媒",
                        "scale": 7100657229,
                        "id": "000917.SZ"
                    },
                    {
                        "name": "东方网络",
                        "scale": 4072818263,
                        "id": "002175.SZ"
                    },
                    {
                        "name": "粤 传 媒",
                        "scale": 4798776257,
                        "id": "002181.SZ"
                    },
                    {
                        "name": "巴士在线",
                        "scale": 1464570203,
                        "id": "002188.SZ"
                    },
                    {
                        "name": "天威视讯",
                        "scale": 4.81535496E+9,
                        "id": "002238.SZ"
                    },
                    {
                        "name": "奥飞娱乐",
                        "scale": 4564388275,
                        "id": "002292.SZ"
                    },
                    {
                        "name": "慈文传媒",
                        "scale": 2.46320387E+9,
                        "id": "002343.SZ"
                    },
                    {
                        "name": "中南文化",
                        "scale": 5.71184119E+9,
                        "id": "002445.SZ"
                    },
                    {
                        "name": "中公教育",
                        "scale": 8488908707,
                        "id": "002607.SZ"
                    },
                    {
                        "name": "美吉姆",
                        "scale": 3724472138,
                        "id": "002621.SZ"
                    },
                    {
                        "name": "勤上股份",
                        "scale": 2360934094,
                        "id": "002638.SZ"
                    },
                    {
                        "name": "凯文教育",
                        "scale": 2.40022899E+9,
                        "id": "002659.SZ"
                    },
                    {
                        "name": "ST美盛",
                        "scale": 3329036174,
                        "id": "002699.SZ"
                    },
                    {
                        "name": "万达电影",
                        "scale": 25122795158,
                        "id": "002739.SZ"
                    },
                    {
                        "name": "力盛体育",
                        "scale": 1505710984,
                        "id": "002858.SZ"
                    },
                    {
                        "name": "金逸影视",
                        "scale": 2.568384E+9,
                        "id": "002905.SZ"
                    },
                    {
                        "name": "传智教育",
                        "scale": 2489668816,
                        "id": "003032.SZ"
                    },
                    {
                        "name": "华谊兄弟",
                        "scale": 6105224808,
                        "id": "300027.SZ"
                    },
                    {
                        "name": "*ST文化",
                        "scale": 1521100995,
                        "id": "300089.SZ"
                    },
                    {
                        "name": "华策影视",
                        "scale": 7574598069,
                        "id": "300133.SZ"
                    },
                    {
                        "name": "捷成股份",
                        "scale": 11507394159,
                        "id": "300182.SZ"
                    },
                    {
                        "name": "科德教育",
                        "scale": 1270077194,
                        "id": "300192.SZ"
                    },
                    {
                        "name": "光线传媒",
                        "scale": 25363732521,
                        "id": "300251.SZ"
                    },
                    {
                        "name": "ST三盛",
                        "scale": 1.20979274E+9,
                        "id": "300282.SZ"
                    },
                    {
                        "name": "百纳千成",
                        "scale": 3597063827,
                        "id": "300291.SZ"
                    },
                    {
                        "name": "ST开元",
                        "scale": 8.6215484E+8,
                        "id": "300338.SZ"
                    },
                    {
                        "name": "中文在线",
                        "scale": 6396504822,
                        "id": "300364.SZ"
                    },
                    {
                        "name": "唐德影视",
                        "scale": 2719062413,
                        "id": "300426.SZ"
                    },
                    {
                        "name": "幸福蓝海",
                        "scale": 2384691546,
                        "id": "300528.SZ"
                    },
                    {
                        "name": "世纪天鸿",
                        "scale": 1630191318,
                        "id": "300654.SZ"
                    },
                    {
                        "name": "中信出版",
                        "scale": 3540621209,
                        "id": "300788.SZ"
                    },
                    {
                        "name": "读客文化",
                        "scale": 882733729,
                        "id": "301025.SZ"
                    },
                    {
                        "name": "果麦文化",
                        "scale": 5.505657E+8,
                        "id": "301052.SZ"
                    },
                    {
                        "name": "歌华有线",
                        "scale": 11802276456,
                        "id": "600037.SH"
                    },
                    {
                        "name": "东望时代",
                        "scale": 4280067337,
                        "id": "600052.SH"
                    },
                    {
                        "name": "中视传媒",
                        "scale": 3.46004568E+9,
                        "id": "600088.SH"
                    },
                    {
                        "name": "ST明诚",
                        "scale": 1.10035374E+9,
                        "id": "600136.SH"
                    },
                    {
                        "name": "中体产业",
                        "scale": 5892176023,
                        "id": "600158.SH"
                    },
                    {
                        "name": "城市传媒",
                        "scale": 4416183903,
                        "id": "600229.SH"
                    },
                    {
                        "name": "博通股份",
                        "scale": 1.37470058E+9,
                        "id": "600455.SH"
                    },
                    {
                        "name": "时代出版",
                        "scale": 5.63754499E+9,
                        "id": "600551.SH"
                    },
                    {
                        "name": "祥源文化",
                        "scale": 3109400093,
                        "id": "600576.SH"
                    },
                    {
                        "name": "国新文化",
                        "scale": 3254918369,
                        "id": "600636.SH"
                    },
                    {
                        "name": "东方明珠",
                        "scale": 22877151347,
                        "id": "600637.SH"
                    },
                    {
                        "name": "昂立教育",
                        "scale": 2521629704,
                        "id": "600661.SH"
                    },
                    {
                        "name": "文投控股",
                        "scale": 4210517445,
                        "id": "600715.SH"
                    },
                    {
                        "name": "长江传媒",
                        "scale": 6285914994,
                        "id": "600757.SH"
                    },
                    {
                        "name": "新华传媒",
                        "scale": 4012369344,
                        "id": "600825.SH"
                    },
                    {
                        "name": "广电网络",
                        "scale": 4042766747,
                        "id": "600831.SH"
                    },
                    {
                        "name": "博瑞传播",
                        "scale": 5782129626,
                        "id": "600880.SH"
                    },
                    {
                        "name": "广西广电",
                        "scale": 5998984198,
                        "id": "600936.SH"
                    },
                    {
                        "name": "江苏有线",
                        "scale": 1.560223918E+10,
                        "id": "600959.SH"
                    },
                    {
                        "name": "XD中国电",
                        "scale": 1.988355E+10,
                        "id": "600977.SH"
                    },
                    {
                        "name": "贵广网络",
                        "scale": 10436004487,
                        "id": "600996.SH"
                    },
                    {
                        "name": "山东出版",
                        "scale": 1.2333579E+10,
                        "id": "601019.SH"
                    },
                    {
                        "name": "中南传媒",
                        "scale": 1.627176E+10,
                        "id": "601098.SH"
                    },
                    {
                        "name": "上海电影",
                        "scale": 4.271346E+9,
                        "id": "601595.SH"
                    },
                    {
                        "name": "浙文影业",
                        "scale": 3088828375,
                        "id": "601599.SH"
                    },
                    {
                        "name": "皖新传媒",
                        "scale": 9.52829069E+9,
                        "id": "601801.SH"
                    },
                    {
                        "name": "新华文轩",
                        "scale": 7103377983,
                        "id": "601811.SH"
                    },
                    {
                        "name": "中国科传",
                        "scale": 5.920845E+9,
                        "id": "601858.SH"
                    },
                    {
                        "name": "南方传媒",
                        "scale": 6907208324,
                        "id": "601900.SH"
                    },
                    {
                        "name": "浙版传媒",
                        "scale": 3162442495,
                        "id": "601921.SH"
                    },
                    {
                        "name": "凤凰传媒",
                        "scale": 1.6618197E+10,
                        "id": "601928.SH"
                    },
                    {
                        "name": "吉视传媒",
                        "scale": 6.37145413E+9,
                        "id": "601929.SH"
                    },
                    {
                        "name": "中国出版",
                        "scale": 8.255925E+9,
                        "id": "601949.SH"
                    },
                    {
                        "name": "出版传媒",
                        "scale": 3167759525,
                        "id": "601999.SH"
                    },
                    {
                        "name": "新经典",
                        "scale": 2994941072,
                        "id": "603096.SH"
                    },
                    {
                        "name": "横店影视",
                        "scale": 8.701224E+9,
                        "id": "603103.SH"
                    },
                    {
                        "name": "中广天择",
                        "scale": 1.703E+9,
                        "id": "603721.SH"
                    },
                    {
                        "name": "读者传媒",
                        "scale": 2.97792E+9,
                        "id": "603999.SH"
                    },
                    {
                        "name": "龙版传媒",
                        "scale": 490222228,
                        "id": "605577.SH"
                    },
                    {
                        "name": "流金岁月",
                        "scale": 8.1019104E+8,
                        "id": "834021.BJ"
                    }
                ],
                "name": "文化传媒",
                "scale": 468328977052,
                "id": "720100"
            },
            {
                "children": [
                    {
                        "name": "*ST大通",
                        "scale": 1273034822,
                        "id": "000038.SZ"
                    },
                    {
                        "name": "华媒控股",
                        "scale": 4097169386,
                        "id": "000607.SZ"
                    },
                    {
                        "name": "分众传媒",
                        "scale": 85642244375,
                        "id": "002027.SZ"
                    },
                    {
                        "name": "利欧股份",
                        "scale": 11248818141,
                        "id": "002131.SZ"
                    },
                    {
                        "name": "实益达",
                        "scale": 2398079949,
                        "id": "002137.SZ"
                    },
                    {
                        "name": "省广集团",
                        "scale": 7879173008,
                        "id": "002400.SZ"
                    },
                    {
                        "name": "恒大高新",
                        "scale": 1551428592,
                        "id": "002591.SZ"
                    },
                    {
                        "name": "万润科技",
                        "scale": 3637986318,
                        "id": "002654.SZ"
                    },
                    {
                        "name": "思美传媒",
                        "scale": 2676014353,
                        "id": "002712.SZ"
                    },
                    {
                        "name": "元隆雅图",
                        "scale": 3696830892,
                        "id": "002878.SZ"
                    },
                    {
                        "name": "天地在线",
                        "scale": 1163797142,
                        "id": "002995.SZ"
                    },
                    {
                        "name": "若羽臣",
                        "scale": 1161221393,
                        "id": "003010.SZ"
                    },
                    {
                        "name": "蓝色光标",
                        "scale": 14174894622,
                        "id": "300058.SZ"
                    },
                    {
                        "name": "旗天科技",
                        "scale": 4417268312,
                        "id": "300061.SZ"
                    },
                    {
                        "name": "天龙集团",
                        "scale": 2473197465,
                        "id": "300063.SZ"
                    },
                    {
                        "name": "福石控股",
                        "scale": 3024511276,
                        "id": "300071.SZ"
                    },
                    {
                        "name": "佳云科技",
                        "scale": 2120276873,
                        "id": "300242.SZ"
                    },
                    {
                        "name": "ST联建",
                        "scale": 2018564258,
                        "id": "300269.SZ"
                    },
                    {
                        "name": "紫天科技",
                        "scale": 3.42772825E+9,
                        "id": "300280.SZ"
                    },
                    {
                        "name": "*ST新文",
                        "scale": 1158040301,
                        "id": "300336.SZ"
                    },
                    {
                        "name": "联创股份",
                        "scale": 14112159545,
                        "id": "300343.SZ"
                    },
                    {
                        "name": "*ST腾信",
                        "scale": 1294375958,
                        "id": "300392.SZ"
                    },
                    {
                        "name": "宣亚国际",
                        "scale": 3050386721,
                        "id": "300612.SZ"
                    },
                    {
                        "name": "因赛集团",
                        "scale": 1580165773,
                        "id": "300781.SZ"
                    },
                    {
                        "name": "壹网壹创",
                        "scale": 3324497415,
                        "id": "300792.SZ"
                    },
                    {
                        "name": "电声股份",
                        "scale": 1.0562475E+9,
                        "id": "300805.SZ"
                    },
                    {
                        "name": "凯淳股份",
                        "scale": 8.41424E+8,
                        "id": "301001.SZ"
                    },
                    {
                        "name": "*ST中昌",
                        "scale": 812330181,
                        "id": "600242.SH"
                    },
                    {
                        "name": "北巴传媒",
                        "scale": 3.54816E+9,
                        "id": "600386.SH"
                    },
                    {
                        "name": "天下秀",
                        "scale": 8567497453,
                        "id": "600556.SH"
                    },
                    {
                        "name": "浙文互联",
                        "scale": 7603947252,
                        "id": "600986.SH"
                    },
                    {
                        "name": "引力传媒",
                        "scale": 2295585053,
                        "id": "603598.SH"
                    },
                    {
                        "name": "龙韵股份",
                        "scale": 1.37580212E+9,
                        "id": "603729.SH"
                    },
                    {
                        "name": "华扬联众",
                        "scale": 4339655136,
                        "id": "603825.SH"
                    },
                    {
                        "name": "丽人丽妆",
                        "scale": 2.76110843E+9,
                        "id": "605136.SH"
                    },
                    {
                        "name": "三人行",
                        "scale": 4744929641,
                        "id": "605168.SH"
                    }
                ],
                "name": "营销传播",
                "scale": 220548551906,
                "id": "720200"
            },
            {
                "children": [
                    {
                        "name": "学大教育",
                        "scale": 1706687908,
                        "id": "000526.SZ"
                    },
                    {
                        "name": "智度股份",
                        "scale": 8190864816,
                        "id": "000676.SZ"
                    },
                    {
                        "name": "视觉中国",
                        "scale": 7914450903,
                        "id": "000681.SZ"
                    },
                    {
                        "name": "生 意 宝",
                        "scale": 3334782936,
                        "id": "002095.SZ"
                    },
                    {
                        "name": "广博股份",
                        "scale": 1934576731,
                        "id": "002103.SZ"
                    },
                    {
                        "name": "ST天润",
                        "scale": 1201168993,
                        "id": "002113.SZ"
                    },
                    {
                        "name": "梦网科技",
                        "scale": 10037746411,
                        "id": "002123.SZ"
                    },
                    {
                        "name": "北纬科技",
                        "scale": 2764645501,
                        "id": "002148.SZ"
                    },
                    {
                        "name": "惠程科技",
                        "scale": 3294104801,
                        "id": "002168.SZ"
                    },
                    {
                        "name": "游族网络",
                        "scale": 8446981371,
                        "id": "002174.SZ"
                    },
                    {
                        "name": "聚力文化",
                        "scale": 1796169209,
                        "id": "002247.SZ"
                    },
                    {
                        "name": "拓维信息",
                        "scale": 7.73338858E+9,
                        "id": "002261.SZ"
                    },
                    {
                        "name": "焦点科技",
                        "scale": 2607499985,
                        "id": "002315.SZ"
                    },
                    {
                        "name": "天娱数科",
                        "scale": 5889422776,
                        "id": "002354.SZ"
                    },
                    {
                        "name": "凯撒文化",
                        "scale": 5277042157,
                        "id": "002425.SZ"
                    },
                    {
                        "name": "鼎龙文化",
                        "scale": 3440313805,
                        "id": "002502.SZ"
                    },
                    {
                        "name": "恺英网络",
                        "scale": 11558525462,
                        "id": "002517.SZ"
                    },
                    {
                        "name": "三七互娱",
                        "scale": 30891911337,
                        "id": "002555.SZ"
                    },
                    {
                        "name": "巨人网络",
                        "scale": 17186985623,
                        "id": "002558.SZ"
                    },
                    {
                        "name": "世纪华通",
                        "scale": 28620778321,
                        "id": "002602.SZ"
                    },
                    {
                        "name": "*ST艾格",
                        "scale": 0.0,
                        "id": "002619.SZ"
                    },
                    {
                        "name": "完美世界",
                        "scale": 29128132618,
                        "id": "002624.SZ"
                    },
                    {
                        "name": "宝通科技",
                        "scale": 6648421049,
                        "id": "300031.SZ"
                    },
                    {
                        "name": "星辉娱乐",
                        "scale": 2841377352,
                        "id": "300043.SZ"
                    },
                    {
                        "name": "三五互联",
                        "scale": 2157316946,
                        "id": "300051.SZ"
                    },
                    {
                        "name": "中青宝",
                        "scale": 6269118072,
                        "id": "300052.SZ"
                    },
                    {
                        "name": "顺网科技",
                        "scale": 6454524836,
                        "id": "300113.SZ"
                    },
                    {
                        "name": "天舟文化",
                        "scale": 2590105611,
                        "id": "300148.SZ"
                    },
                    {
                        "name": "上海钢联",
                        "scale": 5745697475,
                        "id": "300226.SZ"
                    },
                    {
                        "name": "吴通控股",
                        "scale": 4112330256,
                        "id": "300292.SZ"
                    },
                    {
                        "name": "三六五网",
                        "scale": 1541063512,
                        "id": "300295.SZ"
                    },
                    {
                        "name": "富春股份",
                        "scale": 3914650625,
                        "id": "300299.SZ"
                    },
                    {
                        "name": "掌趣科技",
                        "scale": 8607394866,
                        "id": "300315.SZ"
                    },
                    {
                        "name": "全通教育",
                        "scale": 3197955031,
                        "id": "300359.SZ"
                    },
                    {
                        "name": "芒果超媒",
                        "scale": 32704615656,
                        "id": "300413.SZ"
                    },
                    {
                        "name": "昆仑万维",
                        "scale": 16559821941,
                        "id": "300418.SZ"
                    },
                    {
                        "name": "汤姆猫",
                        "scale": 10963191864,
                        "id": "300459.SZ"
                    },
                    {
                        "name": "迅游科技",
                        "scale": 1.80177105E+9,
                        "id": "300467.SZ"
                    },
                    {
                        "name": "盛天网络",
                        "scale": 3001217215,
                        "id": "300494.SZ"
                    },
                    {
                        "name": "盛讯达",
                        "scale": 6780611285,
                        "id": "300518.SZ"
                    },
                    {
                        "name": "冰川网络",
                        "scale": 3064453235,
                        "id": "300533.SZ"
                    },
                    {
                        "name": "新媒股份",
                        "scale": 7992231225,
                        "id": "300770.SZ"
                    },
                    {
                        "name": "值得买",
                        "scale": 1945582103,
                        "id": "300785.SZ"
                    },
                    {
                        "name": "川网传媒",
                        "scale": 1.54114688E+9,
                        "id": "300987.SZ"
                    },
                    {
                        "name": "天亿马",
                        "scale": 555026472,
                        "id": "301178.SZ"
                    },
                    {
                        "name": "泽宇智能",
                        "scale": 1444606654,
                        "id": "301179.SZ"
                    },
                    {
                        "name": "鸥玛软件",
                        "scale": 7.238532E+8,
                        "id": "301185.SZ"
                    },
                    {
                        "name": "观想科技",
                        "scale": 8.982E+8,
                        "id": "301213.SZ"
                    },
                    {
                        "name": "ST瀚叶",
                        "scale": 8224036302,
                        "id": "600226.SH"
                    },
                    {
                        "name": "中文传媒",
                        "scale": 12534339401,
                        "id": "600373.SH"
                    },
                    {
                        "name": "浙数文化",
                        "scale": 8290534926,
                        "id": "600633.SH"
                    },
                    {
                        "name": "新国脉",
                        "scale": 8322979532,
                        "id": "600640.SH"
                    },
                    {
                        "name": "大晟文化",
                        "scale": 2323546005,
                        "id": "600892.SH"
                    },
                    {
                        "name": "人民网",
                        "scale": 12328455274,
                        "id": "603000.SH"
                    },
                    {
                        "name": "电魂网络",
                        "scale": 5.083918E+9,
                        "id": "603258.SH"
                    },
                    {
                        "name": "吉比特",
                        "scale": 24003338188,
                        "id": "603444.SH"
                    },
                    {
                        "name": "掌阅科技",
                        "scale": 6802900943,
                        "id": "603533.SH"
                    },
                    {
                        "name": "国联股份",
                        "scale": 50907730705,
                        "id": "603613.SH"
                    },
                    {
                        "name": "新华网",
                        "scale": 8.95325646E+9,
                        "id": "603888.SH"
                    },
                    {
                        "name": "国义招标",
                        "scale": 245125765,
                        "id": "831039.BJ"
                    },
                    {
                        "name": "国源科技",
                        "scale": 542170924,
                        "id": "835184.BJ"
                    },
                    {
                        "name": "云创数据",
                        "scale": 482360073,
                        "id": "835305.BJ"
                    },
                    {
                        "name": "殷图网联",
                        "scale": 1.885115E+8,
                        "id": "835508.BJ"
                    },
                    {
                        "name": "汉鑫科技",
                        "scale": 205391283,
                        "id": "837092.BJ"
                    }
                ],
                "name": "互联网传媒",
                "scale": 486451059936,
                "id": "720300"
            }
        ],
        "name": "传媒",
        "scale": 1175328588894,
        "id": "720000"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "name": "ST中嘉",
                        "scale": 1748397849,
                        "id": "000889.SZ"
                    },
                    {
                        "name": "二六三",
                        "scale": 4968642835,
                        "id": "002467.SZ"
                    },
                    {
                        "name": "会畅通讯",
                        "scale": 3385015004,
                        "id": "300578.SZ"
                    },
                    {
                        "name": "线上线下",
                        "scale": 1212654894,
                        "id": "300959.SZ"
                    },
                    {
                        "name": "中国联通",
                        "scale": 111155058854,
                        "id": "600050.SH"
                    },
                    {
                        "name": "中国移动",
                        "scale": 30369284948,
                        "id": "600941.SH"
                    },
                    {
                        "name": "中国电信",
                        "scale": 20218336418,
                        "id": "601728.SH"
                    },
                    {
                        "name": "广脉科技",
                        "scale": 237441479,
                        "id": "838924.BJ"
                    }
                ],
                "name": "通信运营",
                "scale": 173294832281,
                "id": "730100"
            },
            {
                "children": [
                    {
                        "name": "深桑达Ａ",
                        "scale": 10283982785,
                        "id": "000032.SZ"
                    },
                    {
                        "name": "中兴通讯",
                        "scale": 97601204805,
                        "id": "000063.SZ"
                    },
                    {
                        "name": "特发信息",
                        "scale": 5887962804,
                        "id": "000070.SZ"
                    },
                    {
                        "name": "汇源通信",
                        "scale": 1.9421376E+9,
                        "id": "000586.SZ"
                    },
                    {
                        "name": "富通信息",
                        "scale": 3842441856,
                        "id": "000836.SZ"
                    },
                    {
                        "name": "高鸿股份",
                        "scale": 5806704009,
                        "id": "000851.SZ"
                    },
                    {
                        "name": "ST高升",
                        "scale": 1.63056403E+9,
                        "id": "000971.SZ"
                    },
                    {
                        "name": "东信和平",
                        "scale": 5971712382,
                        "id": "002017.SZ"
                    },
                    {
                        "name": "ST新海",
                        "scale": 3385581119,
                        "id": "002089.SZ"
                    },
                    {
                        "name": "国脉科技",
                        "scale": 5950718679,
                        "id": "002093.SZ"
                    },
                    {
                        "name": "恒宝股份",
                        "scale": 5357743401,
                        "id": "002104.SZ"
                    },
                    {
                        "name": "三维通信",
                        "scale": 3420282994,
                        "id": "002115.SZ"
                    },
                    {
                        "name": "武汉凡谷",
                        "scale": 5544378097,
                        "id": "002194.SZ"
                    },
                    {
                        "name": "光迅科技",
                        "scale": 13504602264,
                        "id": "002281.SZ"
                    },
                    {
                        "name": "*ST日海",
                        "scale": 2411053654,
                        "id": "002313.SZ"
                    },
                    {
                        "name": "星网锐捷",
                        "scale": 13141304663,
                        "id": "002396.SZ"
                    },
                    {
                        "name": "盛路通信",
                        "scale": 6.72289971E+9,
                        "id": "002446.SZ"
                    },
                    {
                        "name": "通鼎互联",
                        "scale": 6410430563,
                        "id": "002491.SZ"
                    },
                    {
                        "name": "普天科技",
                        "scale": 15725371716,
                        "id": "002544.SZ"
                    },
                    {
                        "name": "海能达",
                        "scale": 5883866883,
                        "id": "002583.SZ"
                    },
                    {
                        "name": "通宇通讯",
                        "scale": 3105024155,
                        "id": "002792.SZ"
                    },
                    {
                        "name": "意华股份",
                        "scale": 11401709566,
                        "id": "002897.SZ"
                    },
                    {
                        "name": "铭普光磁",
                        "scale": 2622079103,
                        "id": "002902.SZ"
                    },
                    {
                        "name": "德生科技",
                        "scale": 2886731863,
                        "id": "002908.SZ"
                    },
                    {
                        "name": "润建股份",
                        "scale": 6104101927,
                        "id": "002929.SZ"
                    },
                    {
                        "name": "中瓷电子",
                        "scale": 6790830349,
                        "id": "003031.SZ"
                    },
                    {
                        "name": "楚天龙",
                        "scale": 4963656231,
                        "id": "003040.SZ"
                    },
                    {
                        "name": "网宿科技",
                        "scale": 12323178606,
                        "id": "300017.SZ"
                    },
                    {
                        "name": "华星创业",
                        "scale": 2.45548012E+9,
                        "id": "300025.SZ"
                    },
                    {
                        "name": "世纪鼎利",
                        "scale": 2215346244,
                        "id": "300050.SZ"
                    },
                    {
                        "name": "恒信东方",
                        "scale": 4.23082809E+9,
                        "id": "300081.SZ"
                    },
                    {
                        "name": "高新兴",
                        "scale": 6021725169,
                        "id": "300098.SZ"
                    },
                    {
                        "name": "大富科技",
                        "scale": 6233657553,
                        "id": "300134.SZ"
                    },
                    {
                        "name": "东软载波",
                        "scale": 5.2598703E+9,
                        "id": "300183.SZ"
                    },
                    {
                        "name": "天喻信息",
                        "scale": 5.42708684E+9,
                        "id": "300205.SZ"
                    },
                    {
                        "name": "亿通科技",
                        "scale": 2761880771,
                        "id": "300211.SZ"
                    },
                    {
                        "name": "佳讯飞鸿",
                        "scale": 3320837741,
                        "id": "300213.SZ"
                    },
                    {
                        "name": "金信诺",
                        "scale": 3795013193,
                        "id": "300252.SZ"
                    },
                    {
                        "name": "中际旭创",
                        "scale": 25414421911,
                        "id": "300308.SZ"
                    },
                    {
                        "name": "宜通世纪",
                        "scale": 3036778092,
                        "id": "300310.SZ"
                    },
                    {
                        "name": "东土科技",
                        "scale": 4291614734,
                        "id": "300353.SZ"
                    },
                    {
                        "name": "光环新网",
                        "scale": 17864763438,
                        "id": "300383.SZ"
                    },
                    {
                        "name": "天孚通信",
                        "scale": 12190847977,
                        "id": "300394.SZ"
                    },
                    {
                        "name": "中光防雷",
                        "scale": 2791083231,
                        "id": "300414.SZ"
                    },
                    {
                        "name": "新易盛",
                        "scale": 12207403366,
                        "id": "300502.SZ"
                    },
                    {
                        "name": "天邑股份",
                        "scale": 4104904316,
                        "id": "300504.SZ"
                    },
                    {
                        "name": "恒实科技",
                        "scale": 3042094483,
                        "id": "300513.SZ"
                    },
                    {
                        "name": "优博讯",
                        "scale": 4621664796,
                        "id": "300531.SZ"
                    },
                    {
                        "name": "博创科技",
                        "scale": 4.58258849E+9,
                        "id": "300548.SZ"
                    },
                    {
                        "name": "路通视信",
                        "scale": 1442932663,
                        "id": "300555.SZ"
                    },
                    {
                        "name": "中富通",
                        "scale": 2679317873,
                        "id": "300560.SZ"
                    },
                    {
                        "name": "神宇股份",
                        "scale": 1.63278921E+9,
                        "id": "300563.SZ"
                    },
                    {
                        "name": "科信技术",
                        "scale": 5821092858,
                        "id": "300565.SZ"
                    },
                    {
                        "name": "太辰光",
                        "scale": 3731248868,
                        "id": "300570.SZ"
                    },
                    {
                        "name": "平治信息",
                        "scale": 5064309766,
                        "id": "300571.SZ"
                    },
                    {
                        "name": "移为通信",
                        "scale": 4925859371,
                        "id": "300590.SZ"
                    },
                    {
                        "name": "吉大通信",
                        "scale": 1944591262,
                        "id": "300597.SZ"
                    },
                    {
                        "name": "立昂技术",
                        "scale": 2831214017,
                        "id": "300603.SZ"
                    },
                    {
                        "name": "欣天科技",
                        "scale": 1554753755,
                        "id": "300615.SZ"
                    },
                    {
                        "name": "光库科技",
                        "scale": 7631910871,
                        "id": "300620.SZ"
                    },
                    {
                        "name": "华测导航",
                        "scale": 14535999275,
                        "id": "300627.SZ"
                    },
                    {
                        "name": "亿联网络",
                        "scale": 38983649463,
                        "id": "300628.SZ"
                    },
                    {
                        "name": "广和通",
                        "scale": 11722027019,
                        "id": "300638.SZ"
                    },
                    {
                        "name": "澄天伟业",
                        "scale": 1.83928115E+9,
                        "id": "300689.SZ"
                    },
                    {
                        "name": "万马科技",
                        "scale": 2206983629,
                        "id": "300698.SZ"
                    },
                    {
                        "name": "万隆光电",
                        "scale": 2237159477,
                        "id": "300710.SZ"
                    },
                    {
                        "name": "广哈通信",
                        "scale": 2659572047,
                        "id": "300711.SZ"
                    },
                    {
                        "name": "兆龙互连",
                        "scale": 825496875,
                        "id": "300913.SZ"
                    },
                    {
                        "name": "南凌科技",
                        "scale": 1257290189,
                        "id": "300921.SZ"
                    },
                    {
                        "name": "信濠光电",
                        "scale": 1.3706E+9,
                        "id": "301051.SZ"
                    },
                    {
                        "name": "微创光电",
                        "scale": 340330439,
                        "id": "430198.BJ"
                    },
                    {
                        "name": "永鼎股份",
                        "scale": 5813659753,
                        "id": "600105.SH"
                    },
                    {
                        "name": "波导股份",
                        "scale": 3.20256E+9,
                        "id": "600130.SH"
                    },
                    {
                        "name": "*ST凯乐",
                        "scale": 2855322986,
                        "id": "600260.SH"
                    },
                    {
                        "name": "ST信通",
                        "scale": 1658153464,
                        "id": "600289.SH"
                    },
                    {
                        "name": "三峡新材",
                        "scale": 4443355526,
                        "id": "600293.SH"
                    },
                    {
                        "name": "长江通信",
                        "scale": 3.3165E+9,
                        "id": "600345.SH"
                    },
                    {
                        "name": "精伦电子",
                        "scale": 2.06677464E+9,
                        "id": "600355.SH"
                    },
                    {
                        "name": "ST九有",
                        "scale": 1.17909965E+9,
                        "id": "600462.SH"
                    },
                    {
                        "name": "亨通光电",
                        "scale": 38173327902,
                        "id": "600487.SH"
                    },
                    {
                        "name": "烽火通信",
                        "scale": 16848705854,
                        "id": "600498.SH"
                    },
                    {
                        "name": "中天科技",
                        "scale": 78873266458,
                        "id": "600522.SH"
                    },
                    {
                        "name": "ST实达",
                        "scale": 10851639179,
                        "id": "600734.SH"
                    },
                    {
                        "name": "南京熊猫",
                        "scale": 6516833731,
                        "id": "600775.SH"
                    },
                    {
                        "name": "东方通信",
                        "scale": 1.04586407E+10,
                        "id": "600776.SH"
                    },
                    {
                        "name": "ST鹏博士",
                        "scale": 4971688954,
                        "id": "600804.SH"
                    },
                    {
                        "name": "长飞光纤",
                        "scale": 14026798599,
                        "id": "601869.SH"
                    },
                    {
                        "name": "华脉科技",
                        "scale": 1767430592,
                        "id": "603042.SH"
                    },
                    {
                        "name": "剑桥科技",
                        "scale": 2749204169,
                        "id": "603083.SH"
                    },
                    {
                        "name": "共进股份",
                        "scale": 6345498656,
                        "id": "603118.SH"
                    },
                    {
                        "name": "中贝通信",
                        "scale": 4108469604,
                        "id": "603220.SH"
                    },
                    {
                        "name": "移远通信",
                        "scale": 29471754752,
                        "id": "603236.SH"
                    },
                    {
                        "name": "超讯通信",
                        "scale": 3.2462248E+9,
                        "id": "603322.SH"
                    },
                    {
                        "name": "鼎信通讯",
                        "scale": 5.62840411E+9,
                        "id": "603421.SH"
                    },
                    {
                        "name": "中通国脉",
                        "scale": 1691095843,
                        "id": "603559.SH"
                    },
                    {
                        "name": "纵横通信",
                        "scale": 2211760261,
                        "id": "603602.SH"
                    },
                    {
                        "name": "盛洋科技",
                        "scale": 4.7538712E+9,
                        "id": "603703.SH"
                    },
                    {
                        "name": "七一二",
                        "scale": 2.302104E+10,
                        "id": "603712.SH"
                    },
                    {
                        "name": "瑞斯康达",
                        "scale": 3402128901,
                        "id": "603803.SH"
                    },
                    {
                        "name": "国盾量子",
                        "scale": 5.6330784E+9,
                        "id": "688027.SH"
                    },
                    {
                        "name": "映翰通",
                        "scale": 1788258369,
                        "id": "688080.SH"
                    },
                    {
                        "name": "威胜信息",
                        "scale": 4.3558003E+9,
                        "id": "688100.SH"
                    },
                    {
                        "name": "有方科技",
                        "scale": 1539012249,
                        "id": "688159.SH"
                    },
                    {
                        "name": "灿勤科技",
                        "scale": 1.0782609E+9,
                        "id": "688182.SH"
                    },
                    {
                        "name": "坤恒顺维",
                        "scale": 9.3179003E+8,
                        "id": "688283.SH"
                    },
                    {
                        "name": "仕佳光子",
                        "scale": 3942240276,
                        "id": "688313.SH"
                    },
                    {
                        "name": "震有科技",
                        "scale": 1507747707,
                        "id": "688418.SH"
                    },
                    {
                        "name": "三旺通信",
                        "scale": 885613275,
                        "id": "688618.SH"
                    },
                    {
                        "name": "鼎通科技",
                        "scale": 2859897615,
                        "id": "688668.SH"
                    },
                    {
                        "name": "富士达",
                        "scale": 2765453785,
                        "id": "835640.BJ"
                    }
                ],
                "name": "通信设备",
                "scale": 844670919936,
                "id": "730200"
            }
        ],
        "name": "通信",
        "scale": 1017965752217,
        "id": "730000"
    }
]